/* automatically generated by rust-bindgen */

pub const EFI_FIRMWARE_VENDOR: &'static [u8; 6usize] = b"INTEL\x00";
pub const EFI_FIRMWARE_MAJOR_REVISION: ::ctypes::c_uint = 12;
pub const EFI_FIRMWARE_MINOR_REVISION: ::ctypes::c_uint = 33;
pub const EFI_FIRMWARE_REVISION: ::ctypes::c_uint = 786465;
pub const _STDINT_H: ::ctypes::c_uint = 1;
pub const _FEATURES_H: ::ctypes::c_uint = 1;
pub const _DEFAULT_SOURCE: ::ctypes::c_uint = 1;
pub const __USE_ISOC11: ::ctypes::c_uint = 1;
pub const __USE_ISOC99: ::ctypes::c_uint = 1;
pub const __USE_ISOC95: ::ctypes::c_uint = 1;
pub const __USE_POSIX_IMPLICITLY: ::ctypes::c_uint = 1;
pub const _POSIX_SOURCE: ::ctypes::c_uint = 1;
pub const _POSIX_C_SOURCE: ::ctypes::c_uint = 200809;
pub const __USE_POSIX: ::ctypes::c_uint = 1;
pub const __USE_POSIX2: ::ctypes::c_uint = 1;
pub const __USE_POSIX199309: ::ctypes::c_uint = 1;
pub const __USE_POSIX199506: ::ctypes::c_uint = 1;
pub const __USE_XOPEN2K: ::ctypes::c_uint = 1;
pub const __USE_XOPEN2K8: ::ctypes::c_uint = 1;
pub const _ATFILE_SOURCE: ::ctypes::c_uint = 1;
pub const __USE_MISC: ::ctypes::c_uint = 1;
pub const __USE_ATFILE: ::ctypes::c_uint = 1;
pub const __USE_FORTIFY_LEVEL: ::ctypes::c_uint = 0;
pub const _STDC_PREDEF_H: ::ctypes::c_uint = 1;
pub const __STDC_IEC_559__: ::ctypes::c_uint = 1;
pub const __STDC_IEC_559_COMPLEX__: ::ctypes::c_uint = 1;
pub const __STDC_ISO_10646__: ::ctypes::c_uint = 201505;
pub const __STDC_NO_THREADS__: ::ctypes::c_uint = 1;

pub const ICMP_V6_DEST_UNREACHABLE: ::ctypes::c_uint = 1;
pub const ICMP_V6_PACKET_TOO_BIG: ::ctypes::c_uint = 2;
pub const ICMP_V6_TIME_EXCEEDED: ::ctypes::c_uint = 3;
pub const ICMP_V6_PARAMETER_PROBLEM: ::ctypes::c_uint = 4;
pub const ICMP_V6_ECHO_REQUEST: ::ctypes::c_uint = 128;
pub const ICMP_V6_ECHO_REPLY: ::ctypes::c_uint = 129;
pub const ICMP_V6_LISTENER_QUERY: ::ctypes::c_uint = 130;
pub const ICMP_V6_LISTENER_REPORT: ::ctypes::c_uint = 131;
pub const ICMP_V6_LISTENER_DONE: ::ctypes::c_uint = 132;
pub const ICMP_V6_ROUTER_SOLICIT: ::ctypes::c_uint = 133;
pub const ICMP_V6_ROUTER_ADVERTISE: ::ctypes::c_uint = 134;
pub const ICMP_V6_NEIGHBOR_SOLICIT: ::ctypes::c_uint = 135;
pub const ICMP_V6_NEIGHBOR_ADVERTISE: ::ctypes::c_uint = 136;
pub const ICMP_V6_REDIRECT: ::ctypes::c_uint = 137;
pub const ICMP_V6_LISTENER_REPORT_2: ::ctypes::c_uint = 143;
pub const ICMP_V6_NO_ROUTE_TO_DEST: ::ctypes::c_uint = 0;
pub const ICMP_V6_COMM_PROHIBITED: ::ctypes::c_uint = 1;
pub const ICMP_V6_BEYOND_SCOPE: ::ctypes::c_uint = 2;
pub const ICMP_V6_ADDR_UNREACHABLE: ::ctypes::c_uint = 3;
pub const ICMP_V6_PORT_UNREACHABLE: ::ctypes::c_uint = 4;
pub const ICMP_V6_SOURCE_ADDR_FAILED: ::ctypes::c_uint = 5;
pub const ICMP_V6_ROUTE_REJECTED: ::ctypes::c_uint = 6;
pub const ICMP_V6_TIMEOUT_HOP_LIMIT: ::ctypes::c_uint = 0;
pub const ICMP_V6_TIMEOUT_REASSEMBLE: ::ctypes::c_uint = 1;
pub const ICMP_V6_ERRONEOUS_HEADER: ::ctypes::c_uint = 0;
pub const ICMP_V6_UNRECOGNIZE_NEXT_HDR: ::ctypes::c_uint = 1;
pub const ICMP_V6_UNRECOGNIZE_OPTION: ::ctypes::c_uint = 2;
pub const EFI_ABSP_SupportsAltActive: ::ctypes::c_uint = 1;
pub const EFI_ABSP_SupportsPressureAsZ: ::ctypes::c_uint = 2;
pub const EFI_ABSP_TouchActive: ::ctypes::c_uint = 1;
pub const EFI_ABS_AltActive: ::ctypes::c_uint = 2;
pub type __u_char = ::ctypes::c_uchar;
pub type __u_short = ::ctypes::c_ushort;
pub type __u_int = ::ctypes::c_uint;
pub type __u_long = ::ctypes::c_ulong;
pub type __int8_t = ::ctypes::c_schar;
pub type __uint8_t = ::ctypes::c_uchar;
pub type __int16_t = ::ctypes::c_short;
pub type __uint16_t = ::ctypes::c_ushort;
pub type __int32_t = ::ctypes::c_int;
pub type __uint32_t = ::ctypes::c_uint;
pub type __int64_t = ::ctypes::c_long;
pub type __uint64_t = ::ctypes::c_ulong;
pub type __quad_t = ::ctypes::c_long;
pub type __u_quad_t = ::ctypes::c_ulong;
pub type __intmax_t = ::ctypes::c_long;
pub type __uintmax_t = ::ctypes::c_ulong;
pub type __dev_t = ::ctypes::c_ulong;
pub type __uid_t = ::ctypes::c_uint;
pub type __gid_t = ::ctypes::c_uint;
pub type __ino_t = ::ctypes::c_ulong;
pub type __ino64_t = ::ctypes::c_ulong;
pub type __mode_t = ::ctypes::c_uint;
pub type __nlink_t = ::ctypes::c_ulong;
pub type __off_t = ::ctypes::c_long;
pub type __off64_t = ::ctypes::c_long;
pub type __pid_t = ::ctypes::c_int;
#[repr(C)]

pub struct __fsid_t {
    pub __val: [::ctypes::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(::core::mem::size_of::<__fsid_t>() , 8usize , concat ! (
               "Size of: " , stringify ! ( __fsid_t ) ));
    assert_eq! (::core::mem::align_of::<__fsid_t>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( __fsid_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __fsid_t ) ) . __val as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __fsid_t ) , "::" ,
                stringify ! ( __val ) ));
}
impl Clone for __fsid_t {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type __clock_t = ::ctypes::c_long;
pub type __rlim_t = ::ctypes::c_ulong;
pub type __rlim64_t = ::ctypes::c_ulong;
pub type __id_t = ::ctypes::c_uint;
pub type __time_t = ::ctypes::c_long;
pub type __useconds_t = ::ctypes::c_uint;
pub type __suseconds_t = ::ctypes::c_long;
pub type __daddr_t = ::ctypes::c_int;
pub type __key_t = ::ctypes::c_int;
pub type __clockid_t = ::ctypes::c_int;
pub type __timer_t = *mut ::ctypes::c_void;
pub type __blksize_t = ::ctypes::c_long;
pub type __blkcnt_t = ::ctypes::c_long;
pub type __blkcnt64_t = ::ctypes::c_long;
pub type __fsblkcnt_t = ::ctypes::c_ulong;
pub type __fsblkcnt64_t = ::ctypes::c_ulong;
pub type __fsfilcnt_t = ::ctypes::c_ulong;
pub type __fsfilcnt64_t = ::ctypes::c_ulong;
pub type __fsword_t = ::ctypes::c_long;
pub type __ssize_t = ::ctypes::c_long;
pub type __syscall_slong_t = ::ctypes::c_long;
pub type __syscall_ulong_t = ::ctypes::c_ulong;
pub type __loff_t = __off64_t;
pub type __qaddr_t = *mut __quad_t;
pub type __caddr_t = *mut ::ctypes::c_char;
pub type __intptr_t = ::ctypes::c_long;
pub type __socklen_t = ::ctypes::c_uint;
pub type int_least8_t = ::ctypes::c_schar;
pub type int_least16_t = ::ctypes::c_short;
pub type int_least32_t = ::ctypes::c_int;
pub type int_least64_t = ::ctypes::c_long;
pub type uint_least8_t = ::ctypes::c_uchar;
pub type uint_least16_t = ::ctypes::c_ushort;
pub type uint_least32_t = ::ctypes::c_uint;
pub type uint_least64_t = ::ctypes::c_ulong;
pub type int_fast8_t = ::ctypes::c_schar;
pub type int_fast16_t = ::ctypes::c_long;
pub type int_fast32_t = ::ctypes::c_long;
pub type int_fast64_t = ::ctypes::c_long;
pub type uint_fast8_t = ::ctypes::c_uchar;
pub type uint_fast16_t = ::ctypes::c_ulong;
pub type uint_fast32_t = ::ctypes::c_ulong;
pub type uint_fast64_t = ::ctypes::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type UINT64 = u64;
pub type INT64 = i64;
pub type UINT32 = u32;
pub type INT32 = i32;
pub type UINT16 = u16;
pub type INT16 = i16;
pub type UINT8 = u8;
pub type INT8 = i8;
pub type WCHAR = ::ctypes::c_int;
pub type INTN = i64;
pub type UINTN = u64;
pub type CHAR16 = UINT16;
pub type CHAR8 = UINT8;
pub type BOOLEAN = UINT8;
pub type EFI_STATUS = UINTN;
pub type EFI_LBA = UINT64;
pub type EFI_TPL = UINTN;
pub type EFI_HANDLE = *mut ::ctypes::c_void;
pub type EFI_EVENT = *mut ::ctypes::c_void;
#[repr(C)]

pub struct EFI_GUID {
    pub Data1: UINT32,
    pub Data2: UINT16,
    pub Data3: UINT16,
    pub Data4: [UINT8; 8usize],
}
#[test]
fn bindgen_test_layout_EFI_GUID() {
    assert_eq!(::core::mem::size_of::<EFI_GUID>() , 16usize , concat ! (
               "Size of: " , stringify ! ( EFI_GUID ) ));
    assert_eq! (::core::mem::align_of::<EFI_GUID>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( EFI_GUID ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_GUID ) ) . Data1 as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_GUID ) , "::" ,
                stringify ! ( Data1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_GUID ) ) . Data2 as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_GUID ) , "::" ,
                stringify ! ( Data2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_GUID ) ) . Data3 as * const _ as
                usize } , 6usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_GUID ) , "::" ,
                stringify ! ( Data3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_GUID ) ) . Data4 as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_GUID ) , "::" ,
                stringify ! ( Data4 ) ));
}
impl Clone for EFI_GUID {
    fn clone(&self) -> Self { unimplemented!() }
}
#[repr(C)]

pub struct EFI_TIME {
    pub Year: UINT16,
    pub Month: UINT8,
    pub Day: UINT8,
    pub Hour: UINT8,
    pub Minute: UINT8,
    pub Second: UINT8,
    pub Pad1: UINT8,
    pub Nanosecond: UINT32,
    pub TimeZone: INT16,
    pub Daylight: UINT8,
    pub Pad2: UINT8,
}
#[test]
fn bindgen_test_layout_EFI_TIME() {
    assert_eq!(::core::mem::size_of::<EFI_TIME>() , 16usize , concat ! (
               "Size of: " , stringify ! ( EFI_TIME ) ));
    assert_eq! (::core::mem::align_of::<EFI_TIME>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( EFI_TIME ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_TIME ) ) . Year as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_TIME ) , "::" ,
                stringify ! ( Year ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_TIME ) ) . Month as * const _ as
                usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_TIME ) , "::" ,
                stringify ! ( Month ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_TIME ) ) . Day as * const _ as usize
                } , 3usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_TIME ) , "::" ,
                stringify ! ( Day ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_TIME ) ) . Hour as * const _ as usize
                } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_TIME ) , "::" ,
                stringify ! ( Hour ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_TIME ) ) . Minute as * const _ as
                usize } , 5usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_TIME ) , "::" ,
                stringify ! ( Minute ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_TIME ) ) . Second as * const _ as
                usize } , 6usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_TIME ) , "::" ,
                stringify ! ( Second ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_TIME ) ) . Pad1 as * const _ as usize
                } , 7usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_TIME ) , "::" ,
                stringify ! ( Pad1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_TIME ) ) . Nanosecond as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_TIME ) , "::" ,
                stringify ! ( Nanosecond ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_TIME ) ) . TimeZone as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_TIME ) , "::" ,
                stringify ! ( TimeZone ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_TIME ) ) . Daylight as * const _ as
                usize } , 14usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_TIME ) , "::" ,
                stringify ! ( Daylight ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_TIME ) ) . Pad2 as * const _ as usize
                } , 15usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_TIME ) , "::" ,
                stringify ! ( Pad2 ) ));
}
impl Clone for EFI_TIME {
    fn clone(&self) -> Self { unimplemented!() }
}
#[repr(C)]

pub struct EFI_IPv4_ADDRESS {
    pub Addr: [UINT8; 4usize],
}
#[test]
fn bindgen_test_layout_EFI_IPv4_ADDRESS() {
    assert_eq!(::core::mem::size_of::<EFI_IPv4_ADDRESS>() , 4usize , concat !
               ( "Size of: " , stringify ! ( EFI_IPv4_ADDRESS ) ));
    assert_eq! (::core::mem::align_of::<EFI_IPv4_ADDRESS>() , 1usize , concat
                ! ( "Alignment of " , stringify ! ( EFI_IPv4_ADDRESS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_IPv4_ADDRESS ) ) . Addr as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_IPv4_ADDRESS ) ,
                "::" , stringify ! ( Addr ) ));
}
impl Clone for EFI_IPv4_ADDRESS {
    fn clone(&self) -> Self { unimplemented!() }
}
#[repr(C)]

pub struct EFI_IPv6_ADDRESS {
    pub Addr: [UINT8; 16usize],
}
#[test]
fn bindgen_test_layout_EFI_IPv6_ADDRESS() {
    assert_eq!(::core::mem::size_of::<EFI_IPv6_ADDRESS>() , 16usize , concat !
               ( "Size of: " , stringify ! ( EFI_IPv6_ADDRESS ) ));
    assert_eq! (::core::mem::align_of::<EFI_IPv6_ADDRESS>() , 1usize , concat
                ! ( "Alignment of " , stringify ! ( EFI_IPv6_ADDRESS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_IPv6_ADDRESS ) ) . Addr as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_IPv6_ADDRESS ) ,
                "::" , stringify ! ( Addr ) ));
}
impl Clone for EFI_IPv6_ADDRESS {
    fn clone(&self) -> Self { unimplemented!() }
}
#[repr(C)]

pub struct EFI_MAC_ADDRESS {
    pub Addr: [UINT8; 32usize],
}
#[test]
fn bindgen_test_layout_EFI_MAC_ADDRESS() {
    assert_eq!(::core::mem::size_of::<EFI_MAC_ADDRESS>() , 32usize , concat !
               ( "Size of: " , stringify ! ( EFI_MAC_ADDRESS ) ));
    assert_eq! (::core::mem::align_of::<EFI_MAC_ADDRESS>() , 1usize , concat !
                ( "Alignment of " , stringify ! ( EFI_MAC_ADDRESS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_MAC_ADDRESS ) ) . Addr as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_MAC_ADDRESS ) ,
                "::" , stringify ! ( Addr ) ));
}
impl Clone for EFI_MAC_ADDRESS {
    fn clone(&self) -> Self { unimplemented!() }
}
#[repr(C)]

pub struct EFI_MANAGED_NETWORK_CONFIG_DATA {
    pub ReceivedQueueTimeoutValue: UINT32,
    pub TransmitQueueTimeoutValue: UINT32,
    pub ProtocolTypeFilter: UINT16,
    pub EnableUnicastReceive: BOOLEAN,
    pub EnableMulticastReceive: BOOLEAN,
    pub EnableBroadcastReceive: BOOLEAN,
    pub EnablePromiscuousReceive: BOOLEAN,
    pub FlushQueuesOnReset: BOOLEAN,
    pub EnableReceiveTimestamps: BOOLEAN,
    pub DisableBackgroundPolling: BOOLEAN,
}
#[test]
fn bindgen_test_layout_EFI_MANAGED_NETWORK_CONFIG_DATA() {
    assert_eq!(::core::mem::size_of::<EFI_MANAGED_NETWORK_CONFIG_DATA>() ,
               20usize , concat ! (
               "Size of: " , stringify ! ( EFI_MANAGED_NETWORK_CONFIG_DATA )
               ));
    assert_eq! (::core::mem::align_of::<EFI_MANAGED_NETWORK_CONFIG_DATA>() ,
                4usize , concat ! (
                "Alignment of " , stringify ! (
                EFI_MANAGED_NETWORK_CONFIG_DATA ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_MANAGED_NETWORK_CONFIG_DATA ) ) .
                ReceivedQueueTimeoutValue as * const _ as usize } , 0usize ,
                concat ! (
                "Alignment of field: " , stringify ! (
                EFI_MANAGED_NETWORK_CONFIG_DATA ) , "::" , stringify ! (
                ReceivedQueueTimeoutValue ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_MANAGED_NETWORK_CONFIG_DATA ) ) .
                TransmitQueueTimeoutValue as * const _ as usize } , 4usize ,
                concat ! (
                "Alignment of field: " , stringify ! (
                EFI_MANAGED_NETWORK_CONFIG_DATA ) , "::" , stringify ! (
                TransmitQueueTimeoutValue ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_MANAGED_NETWORK_CONFIG_DATA ) ) .
                ProtocolTypeFilter as * const _ as usize } , 8usize , concat !
                (
                "Alignment of field: " , stringify ! (
                EFI_MANAGED_NETWORK_CONFIG_DATA ) , "::" , stringify ! (
                ProtocolTypeFilter ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_MANAGED_NETWORK_CONFIG_DATA ) ) .
                EnableUnicastReceive as * const _ as usize } , 10usize ,
                concat ! (
                "Alignment of field: " , stringify ! (
                EFI_MANAGED_NETWORK_CONFIG_DATA ) , "::" , stringify ! (
                EnableUnicastReceive ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_MANAGED_NETWORK_CONFIG_DATA ) ) .
                EnableMulticastReceive as * const _ as usize } , 11usize ,
                concat ! (
                "Alignment of field: " , stringify ! (
                EFI_MANAGED_NETWORK_CONFIG_DATA ) , "::" , stringify ! (
                EnableMulticastReceive ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_MANAGED_NETWORK_CONFIG_DATA ) ) .
                EnableBroadcastReceive as * const _ as usize } , 12usize ,
                concat ! (
                "Alignment of field: " , stringify ! (
                EFI_MANAGED_NETWORK_CONFIG_DATA ) , "::" , stringify ! (
                EnableBroadcastReceive ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_MANAGED_NETWORK_CONFIG_DATA ) ) .
                EnablePromiscuousReceive as * const _ as usize } , 13usize ,
                concat ! (
                "Alignment of field: " , stringify ! (
                EFI_MANAGED_NETWORK_CONFIG_DATA ) , "::" , stringify ! (
                EnablePromiscuousReceive ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_MANAGED_NETWORK_CONFIG_DATA ) ) .
                FlushQueuesOnReset as * const _ as usize } , 14usize , concat
                ! (
                "Alignment of field: " , stringify ! (
                EFI_MANAGED_NETWORK_CONFIG_DATA ) , "::" , stringify ! (
                FlushQueuesOnReset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_MANAGED_NETWORK_CONFIG_DATA ) ) .
                EnableReceiveTimestamps as * const _ as usize } , 15usize ,
                concat ! (
                "Alignment of field: " , stringify ! (
                EFI_MANAGED_NETWORK_CONFIG_DATA ) , "::" , stringify ! (
                EnableReceiveTimestamps ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_MANAGED_NETWORK_CONFIG_DATA ) ) .
                DisableBackgroundPolling as * const _ as usize } , 16usize ,
                concat ! (
                "Alignment of field: " , stringify ! (
                EFI_MANAGED_NETWORK_CONFIG_DATA ) , "::" , stringify ! (
                DisableBackgroundPolling ) ));
}
impl Clone for EFI_MANAGED_NETWORK_CONFIG_DATA {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type EFI_PHYSICAL_ADDRESS = UINT64;
pub type EFI_VIRTUAL_ADDRESS = UINT64;
pub const EFI_ALLOCATE_TYPE_AllocateAnyPages: EFI_ALLOCATE_TYPE = 0;
pub const EFI_ALLOCATE_TYPE_AllocateMaxAddress: EFI_ALLOCATE_TYPE = 1;
pub const EFI_ALLOCATE_TYPE_AllocateAddress: EFI_ALLOCATE_TYPE = 2;
pub const EFI_ALLOCATE_TYPE_MaxAllocateType: EFI_ALLOCATE_TYPE = 3;
pub type EFI_ALLOCATE_TYPE = ::ctypes::c_uint;
pub const EFI_MEMORY_TYPE_EfiReservedMemoryType: EFI_MEMORY_TYPE = 0;
pub const EFI_MEMORY_TYPE_EfiLoaderCode: EFI_MEMORY_TYPE = 1;
pub const EFI_MEMORY_TYPE_EfiLoaderData: EFI_MEMORY_TYPE = 2;
pub const EFI_MEMORY_TYPE_EfiBootServicesCode: EFI_MEMORY_TYPE = 3;
pub const EFI_MEMORY_TYPE_EfiBootServicesData: EFI_MEMORY_TYPE = 4;
pub const EFI_MEMORY_TYPE_EfiRuntimeServicesCode: EFI_MEMORY_TYPE = 5;
pub const EFI_MEMORY_TYPE_EfiRuntimeServicesData: EFI_MEMORY_TYPE = 6;
pub const EFI_MEMORY_TYPE_EfiConventionalMemory: EFI_MEMORY_TYPE = 7;
pub const EFI_MEMORY_TYPE_EfiUnusableMemory: EFI_MEMORY_TYPE = 8;
pub const EFI_MEMORY_TYPE_EfiACPIReclaimMemory: EFI_MEMORY_TYPE = 9;
pub const EFI_MEMORY_TYPE_EfiACPIMemoryNVS: EFI_MEMORY_TYPE = 10;
pub const EFI_MEMORY_TYPE_EfiMemoryMappedIO: EFI_MEMORY_TYPE = 11;
pub const EFI_MEMORY_TYPE_EfiMemoryMappedIOPortSpace: EFI_MEMORY_TYPE = 12;
pub const EFI_MEMORY_TYPE_EfiPalCode: EFI_MEMORY_TYPE = 13;
pub const EFI_MEMORY_TYPE_EfiMaxMemoryType: EFI_MEMORY_TYPE = 14;
pub type EFI_MEMORY_TYPE = ::ctypes::c_uint;
#[repr(C)]

pub struct EFI_MEMORY_DESCRIPTOR {
    pub Type: UINT32,
    pub Pad: UINT32,
    pub PhysicalStart: EFI_PHYSICAL_ADDRESS,
    pub VirtualStart: EFI_VIRTUAL_ADDRESS,
    pub NumberOfPages: UINT64,
    pub Attribute: UINT64,
}
#[test]
fn bindgen_test_layout_EFI_MEMORY_DESCRIPTOR() {
    assert_eq!(::core::mem::size_of::<EFI_MEMORY_DESCRIPTOR>() , 40usize ,
               concat ! ( "Size of: " , stringify ! ( EFI_MEMORY_DESCRIPTOR )
               ));
    assert_eq! (::core::mem::align_of::<EFI_MEMORY_DESCRIPTOR>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( EFI_MEMORY_DESCRIPTOR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_MEMORY_DESCRIPTOR ) ) . Type as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_MEMORY_DESCRIPTOR )
                , "::" , stringify ! ( Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_MEMORY_DESCRIPTOR ) ) . Pad as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_MEMORY_DESCRIPTOR )
                , "::" , stringify ! ( Pad ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_MEMORY_DESCRIPTOR ) ) . PhysicalStart
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_MEMORY_DESCRIPTOR )
                , "::" , stringify ! ( PhysicalStart ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_MEMORY_DESCRIPTOR ) ) . VirtualStart
                as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_MEMORY_DESCRIPTOR )
                , "::" , stringify ! ( VirtualStart ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_MEMORY_DESCRIPTOR ) ) . NumberOfPages
                as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_MEMORY_DESCRIPTOR )
                , "::" , stringify ! ( NumberOfPages ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_MEMORY_DESCRIPTOR ) ) . Attribute as
                * const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_MEMORY_DESCRIPTOR )
                , "::" , stringify ! ( Attribute ) ));
}
impl Clone for EFI_MEMORY_DESCRIPTOR {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type ISO_639_2 = UINT8;
#[repr(C)]

pub struct _EFI_DEVICE_PATH {
    pub Type: UINT8,
    pub SubType: UINT8,
    pub Length: [UINT8; 2usize],
}
#[test]
fn bindgen_test_layout__EFI_DEVICE_PATH() {
    assert_eq!(::core::mem::size_of::<_EFI_DEVICE_PATH>() , 4usize , concat !
               ( "Size of: " , stringify ! ( _EFI_DEVICE_PATH ) ));
    assert_eq! (::core::mem::align_of::<_EFI_DEVICE_PATH>() , 1usize , concat
                ! ( "Alignment of " , stringify ! ( _EFI_DEVICE_PATH ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_DEVICE_PATH ) ) . Type as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_DEVICE_PATH ) ,
                "::" , stringify ! ( Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_DEVICE_PATH ) ) . SubType as * const
                _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_DEVICE_PATH ) ,
                "::" , stringify ! ( SubType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_DEVICE_PATH ) ) . Length as * const
                _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_DEVICE_PATH ) ,
                "::" , stringify ! ( Length ) ));
}
impl Clone for _EFI_DEVICE_PATH {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type EFI_DEVICE_PATH = _EFI_DEVICE_PATH;
#[repr(C)]

pub struct _PCI_DEVICE_PATH {
    pub Header: EFI_DEVICE_PATH,
    pub Function: UINT8,
    pub Device: UINT8,
}
#[test]
fn bindgen_test_layout__PCI_DEVICE_PATH() {
    assert_eq!(::core::mem::size_of::<_PCI_DEVICE_PATH>() , 6usize , concat !
               ( "Size of: " , stringify ! ( _PCI_DEVICE_PATH ) ));
    assert_eq! (::core::mem::align_of::<_PCI_DEVICE_PATH>() , 1usize , concat
                ! ( "Alignment of " , stringify ! ( _PCI_DEVICE_PATH ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _PCI_DEVICE_PATH ) ) . Header as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _PCI_DEVICE_PATH ) ,
                "::" , stringify ! ( Header ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _PCI_DEVICE_PATH ) ) . Function as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( _PCI_DEVICE_PATH ) ,
                "::" , stringify ! ( Function ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _PCI_DEVICE_PATH ) ) . Device as * const
                _ as usize } , 5usize , concat ! (
                "Alignment of field: " , stringify ! ( _PCI_DEVICE_PATH ) ,
                "::" , stringify ! ( Device ) ));
}
impl Clone for _PCI_DEVICE_PATH {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type PCI_DEVICE_PATH = _PCI_DEVICE_PATH;
#[repr(C)]

pub struct _PCCARD_DEVICE_PATH {
    pub Header: EFI_DEVICE_PATH,
    pub FunctionNumber: UINT8,
}
#[test]
fn bindgen_test_layout__PCCARD_DEVICE_PATH() {
    assert_eq!(::core::mem::size_of::<_PCCARD_DEVICE_PATH>() , 5usize , concat
               ! ( "Size of: " , stringify ! ( _PCCARD_DEVICE_PATH ) ));
    assert_eq! (::core::mem::align_of::<_PCCARD_DEVICE_PATH>() , 1usize ,
                concat ! (
                "Alignment of " , stringify ! ( _PCCARD_DEVICE_PATH ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _PCCARD_DEVICE_PATH ) ) . Header as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _PCCARD_DEVICE_PATH ) ,
                "::" , stringify ! ( Header ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _PCCARD_DEVICE_PATH ) ) . FunctionNumber
                as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( _PCCARD_DEVICE_PATH ) ,
                "::" , stringify ! ( FunctionNumber ) ));
}
impl Clone for _PCCARD_DEVICE_PATH {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type PCCARD_DEVICE_PATH = _PCCARD_DEVICE_PATH;
#[repr(C)]

pub struct _MEMMAP_DEVICE_PATH {
    pub Header: EFI_DEVICE_PATH,
    pub MemoryType: UINT32,
    pub StartingAddress: EFI_PHYSICAL_ADDRESS,
    pub EndingAddress: EFI_PHYSICAL_ADDRESS,
}
#[test]
fn bindgen_test_layout__MEMMAP_DEVICE_PATH() {
    assert_eq!(::core::mem::size_of::<_MEMMAP_DEVICE_PATH>() , 24usize ,
               concat ! ( "Size of: " , stringify ! ( _MEMMAP_DEVICE_PATH )
               ));
    assert_eq! (::core::mem::align_of::<_MEMMAP_DEVICE_PATH>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( _MEMMAP_DEVICE_PATH ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _MEMMAP_DEVICE_PATH ) ) . Header as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _MEMMAP_DEVICE_PATH ) ,
                "::" , stringify ! ( Header ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _MEMMAP_DEVICE_PATH ) ) . MemoryType as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( _MEMMAP_DEVICE_PATH ) ,
                "::" , stringify ! ( MemoryType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _MEMMAP_DEVICE_PATH ) ) . StartingAddress
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _MEMMAP_DEVICE_PATH ) ,
                "::" , stringify ! ( StartingAddress ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _MEMMAP_DEVICE_PATH ) ) . EndingAddress
                as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( _MEMMAP_DEVICE_PATH ) ,
                "::" , stringify ! ( EndingAddress ) ));
}
impl Clone for _MEMMAP_DEVICE_PATH {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type MEMMAP_DEVICE_PATH = _MEMMAP_DEVICE_PATH;
#[repr(C)]

pub struct _VENDOR_DEVICE_PATH {
    pub Header: EFI_DEVICE_PATH,
    pub Guid: EFI_GUID,
}
#[test]
fn bindgen_test_layout__VENDOR_DEVICE_PATH() {
    assert_eq!(::core::mem::size_of::<_VENDOR_DEVICE_PATH>() , 20usize ,
               concat ! ( "Size of: " , stringify ! ( _VENDOR_DEVICE_PATH )
               ));
    assert_eq! (::core::mem::align_of::<_VENDOR_DEVICE_PATH>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( _VENDOR_DEVICE_PATH ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _VENDOR_DEVICE_PATH ) ) . Header as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _VENDOR_DEVICE_PATH ) ,
                "::" , stringify ! ( Header ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _VENDOR_DEVICE_PATH ) ) . Guid as * const
                _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( _VENDOR_DEVICE_PATH ) ,
                "::" , stringify ! ( Guid ) ));
}
impl Clone for _VENDOR_DEVICE_PATH {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type VENDOR_DEVICE_PATH = _VENDOR_DEVICE_PATH;
#[repr(C)]

pub struct _UKNOWN_DEVICE_VENDOR_DP {
    pub DevicePath: VENDOR_DEVICE_PATH,
    pub LegacyDriveLetter: UINT8,
}
#[test]
fn bindgen_test_layout__UKNOWN_DEVICE_VENDOR_DP() {
    assert_eq!(::core::mem::size_of::<_UKNOWN_DEVICE_VENDOR_DP>() , 24usize ,
               concat ! (
               "Size of: " , stringify ! ( _UKNOWN_DEVICE_VENDOR_DP ) ));
    assert_eq! (::core::mem::align_of::<_UKNOWN_DEVICE_VENDOR_DP>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( _UKNOWN_DEVICE_VENDOR_DP ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _UKNOWN_DEVICE_VENDOR_DP ) ) . DevicePath
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                _UKNOWN_DEVICE_VENDOR_DP ) , "::" , stringify ! ( DevicePath )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _UKNOWN_DEVICE_VENDOR_DP ) ) .
                LegacyDriveLetter as * const _ as usize } , 20usize , concat !
                (
                "Alignment of field: " , stringify ! (
                _UKNOWN_DEVICE_VENDOR_DP ) , "::" , stringify ! (
                LegacyDriveLetter ) ));
}
impl Clone for _UKNOWN_DEVICE_VENDOR_DP {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type UNKNOWN_DEVICE_VENDOR_DEVICE_PATH = _UKNOWN_DEVICE_VENDOR_DP;
#[repr(C)]

pub struct _CONTROLLER_DEVICE_PATH {
    pub Header: EFI_DEVICE_PATH,
    pub Controller: UINT32,
}
#[test]
fn bindgen_test_layout__CONTROLLER_DEVICE_PATH() {
    assert_eq!(::core::mem::size_of::<_CONTROLLER_DEVICE_PATH>() , 8usize ,
               concat ! (
               "Size of: " , stringify ! ( _CONTROLLER_DEVICE_PATH ) ));
    assert_eq! (::core::mem::align_of::<_CONTROLLER_DEVICE_PATH>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( _CONTROLLER_DEVICE_PATH ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _CONTROLLER_DEVICE_PATH ) ) . Header as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _CONTROLLER_DEVICE_PATH
                ) , "::" , stringify ! ( Header ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _CONTROLLER_DEVICE_PATH ) ) . Controller
                as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( _CONTROLLER_DEVICE_PATH
                ) , "::" , stringify ! ( Controller ) ));
}
impl Clone for _CONTROLLER_DEVICE_PATH {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type CONTROLLER_DEVICE_PATH = _CONTROLLER_DEVICE_PATH;
#[repr(C)]

pub struct _ACPI_HID_DEVICE_PATH {
    pub Header: EFI_DEVICE_PATH,
    pub HID: UINT32,
    pub UID: UINT32,
}
#[test]
fn bindgen_test_layout__ACPI_HID_DEVICE_PATH() {
    assert_eq!(::core::mem::size_of::<_ACPI_HID_DEVICE_PATH>() , 12usize ,
               concat ! ( "Size of: " , stringify ! ( _ACPI_HID_DEVICE_PATH )
               ));
    assert_eq! (::core::mem::align_of::<_ACPI_HID_DEVICE_PATH>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( _ACPI_HID_DEVICE_PATH ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _ACPI_HID_DEVICE_PATH ) ) . Header as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _ACPI_HID_DEVICE_PATH )
                , "::" , stringify ! ( Header ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _ACPI_HID_DEVICE_PATH ) ) . HID as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( _ACPI_HID_DEVICE_PATH )
                , "::" , stringify ! ( HID ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _ACPI_HID_DEVICE_PATH ) ) . UID as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _ACPI_HID_DEVICE_PATH )
                , "::" , stringify ! ( UID ) ));
}
impl Clone for _ACPI_HID_DEVICE_PATH {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type ACPI_HID_DEVICE_PATH = _ACPI_HID_DEVICE_PATH;
#[repr(C)]

pub struct _EXPANDED_ACPI_HID_DEVICE_PATH {
    pub Header: EFI_DEVICE_PATH,
    pub HID: UINT32,
    pub UID: UINT32,
    pub CID: UINT32,
    pub HidStr: [UINT8; 1usize],
}
#[test]
fn bindgen_test_layout__EXPANDED_ACPI_HID_DEVICE_PATH() {
    assert_eq!(::core::mem::size_of::<_EXPANDED_ACPI_HID_DEVICE_PATH>() ,
               20usize , concat ! (
               "Size of: " , stringify ! ( _EXPANDED_ACPI_HID_DEVICE_PATH )
               ));
    assert_eq! (::core::mem::align_of::<_EXPANDED_ACPI_HID_DEVICE_PATH>() ,
                4usize , concat ! (
                "Alignment of " , stringify ! ( _EXPANDED_ACPI_HID_DEVICE_PATH
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EXPANDED_ACPI_HID_DEVICE_PATH ) ) .
                Header as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                _EXPANDED_ACPI_HID_DEVICE_PATH ) , "::" , stringify ! ( Header
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EXPANDED_ACPI_HID_DEVICE_PATH ) ) . HID
                as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                _EXPANDED_ACPI_HID_DEVICE_PATH ) , "::" , stringify ! ( HID )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EXPANDED_ACPI_HID_DEVICE_PATH ) ) . UID
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                _EXPANDED_ACPI_HID_DEVICE_PATH ) , "::" , stringify ! ( UID )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EXPANDED_ACPI_HID_DEVICE_PATH ) ) . CID
                as * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! (
                _EXPANDED_ACPI_HID_DEVICE_PATH ) , "::" , stringify ! ( CID )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EXPANDED_ACPI_HID_DEVICE_PATH ) ) .
                HidStr as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                _EXPANDED_ACPI_HID_DEVICE_PATH ) , "::" , stringify ! ( HidStr
                ) ));
}
impl Clone for _EXPANDED_ACPI_HID_DEVICE_PATH {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type EXPANDED_ACPI_HID_DEVICE_PATH = _EXPANDED_ACPI_HID_DEVICE_PATH;
#[repr(C)]

pub struct _ACPI_ADR_DEVICE_PATH {
    pub Header: EFI_DEVICE_PATH,
    pub ADR: UINT32,
}
#[test]
fn bindgen_test_layout__ACPI_ADR_DEVICE_PATH() {
    assert_eq!(::core::mem::size_of::<_ACPI_ADR_DEVICE_PATH>() , 8usize ,
               concat ! ( "Size of: " , stringify ! ( _ACPI_ADR_DEVICE_PATH )
               ));
    assert_eq! (::core::mem::align_of::<_ACPI_ADR_DEVICE_PATH>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( _ACPI_ADR_DEVICE_PATH ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _ACPI_ADR_DEVICE_PATH ) ) . Header as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _ACPI_ADR_DEVICE_PATH )
                , "::" , stringify ! ( Header ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _ACPI_ADR_DEVICE_PATH ) ) . ADR as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( _ACPI_ADR_DEVICE_PATH )
                , "::" , stringify ! ( ADR ) ));
}
impl Clone for _ACPI_ADR_DEVICE_PATH {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type ACPI_ADR_DEVICE_PATH = _ACPI_ADR_DEVICE_PATH;
#[repr(C)]

pub struct _ATAPI_DEVICE_PATH {
    pub Header: EFI_DEVICE_PATH,
    pub PrimarySecondary: UINT8,
    pub SlaveMaster: UINT8,
    pub Lun: UINT16,
}
#[test]
fn bindgen_test_layout__ATAPI_DEVICE_PATH() {
    assert_eq!(::core::mem::size_of::<_ATAPI_DEVICE_PATH>() , 8usize , concat
               ! ( "Size of: " , stringify ! ( _ATAPI_DEVICE_PATH ) ));
    assert_eq! (::core::mem::align_of::<_ATAPI_DEVICE_PATH>() , 2usize ,
                concat ! (
                "Alignment of " , stringify ! ( _ATAPI_DEVICE_PATH ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _ATAPI_DEVICE_PATH ) ) . Header as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _ATAPI_DEVICE_PATH ) ,
                "::" , stringify ! ( Header ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _ATAPI_DEVICE_PATH ) ) . PrimarySecondary
                as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( _ATAPI_DEVICE_PATH ) ,
                "::" , stringify ! ( PrimarySecondary ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _ATAPI_DEVICE_PATH ) ) . SlaveMaster as *
                const _ as usize } , 5usize , concat ! (
                "Alignment of field: " , stringify ! ( _ATAPI_DEVICE_PATH ) ,
                "::" , stringify ! ( SlaveMaster ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _ATAPI_DEVICE_PATH ) ) . Lun as * const _
                as usize } , 6usize , concat ! (
                "Alignment of field: " , stringify ! ( _ATAPI_DEVICE_PATH ) ,
                "::" , stringify ! ( Lun ) ));
}
impl Clone for _ATAPI_DEVICE_PATH {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type ATAPI_DEVICE_PATH = _ATAPI_DEVICE_PATH;
#[repr(C)]

pub struct _SCSI_DEVICE_PATH {
    pub Header: EFI_DEVICE_PATH,
    pub Pun: UINT16,
    pub Lun: UINT16,
}
#[test]
fn bindgen_test_layout__SCSI_DEVICE_PATH() {
    assert_eq!(::core::mem::size_of::<_SCSI_DEVICE_PATH>() , 8usize , concat !
               ( "Size of: " , stringify ! ( _SCSI_DEVICE_PATH ) ));
    assert_eq! (::core::mem::align_of::<_SCSI_DEVICE_PATH>() , 2usize , concat
                ! ( "Alignment of " , stringify ! ( _SCSI_DEVICE_PATH ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _SCSI_DEVICE_PATH ) ) . Header as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _SCSI_DEVICE_PATH ) ,
                "::" , stringify ! ( Header ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _SCSI_DEVICE_PATH ) ) . Pun as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( _SCSI_DEVICE_PATH ) ,
                "::" , stringify ! ( Pun ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _SCSI_DEVICE_PATH ) ) . Lun as * const _
                as usize } , 6usize , concat ! (
                "Alignment of field: " , stringify ! ( _SCSI_DEVICE_PATH ) ,
                "::" , stringify ! ( Lun ) ));
}
impl Clone for _SCSI_DEVICE_PATH {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type SCSI_DEVICE_PATH = _SCSI_DEVICE_PATH;
#[repr(C)]

pub struct _FIBRECHANNEL_DEVICE_PATH {
    pub Header: EFI_DEVICE_PATH,
    pub Reserved: UINT32,
    pub WWN: UINT64,
    pub Lun: UINT64,
}
#[test]
fn bindgen_test_layout__FIBRECHANNEL_DEVICE_PATH() {
    assert_eq!(::core::mem::size_of::<_FIBRECHANNEL_DEVICE_PATH>() , 24usize ,
               concat ! (
               "Size of: " , stringify ! ( _FIBRECHANNEL_DEVICE_PATH ) ));
    assert_eq! (::core::mem::align_of::<_FIBRECHANNEL_DEVICE_PATH>() , 8usize
                , concat ! (
                "Alignment of " , stringify ! ( _FIBRECHANNEL_DEVICE_PATH )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _FIBRECHANNEL_DEVICE_PATH ) ) . Header as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                _FIBRECHANNEL_DEVICE_PATH ) , "::" , stringify ! ( Header )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _FIBRECHANNEL_DEVICE_PATH ) ) . Reserved
                as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                _FIBRECHANNEL_DEVICE_PATH ) , "::" , stringify ! ( Reserved )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _FIBRECHANNEL_DEVICE_PATH ) ) . WWN as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                _FIBRECHANNEL_DEVICE_PATH ) , "::" , stringify ! ( WWN ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _FIBRECHANNEL_DEVICE_PATH ) ) . Lun as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                _FIBRECHANNEL_DEVICE_PATH ) , "::" , stringify ! ( Lun ) ));
}
impl Clone for _FIBRECHANNEL_DEVICE_PATH {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type FIBRECHANNEL_DEVICE_PATH = _FIBRECHANNEL_DEVICE_PATH;
#[repr(C)]

pub struct _FIBRECHANNELEX_DEVICE_PATH {
    pub Header: EFI_DEVICE_PATH,
    pub Reserved: UINT32,
    pub WWN: [UINT8; 8usize],
    pub Lun: [UINT8; 8usize],
}
#[test]
fn bindgen_test_layout__FIBRECHANNELEX_DEVICE_PATH() {
    assert_eq!(::core::mem::size_of::<_FIBRECHANNELEX_DEVICE_PATH>() , 24usize
               , concat ! (
               "Size of: " , stringify ! ( _FIBRECHANNELEX_DEVICE_PATH ) ));
    assert_eq! (::core::mem::align_of::<_FIBRECHANNELEX_DEVICE_PATH>() ,
                4usize , concat ! (
                "Alignment of " , stringify ! ( _FIBRECHANNELEX_DEVICE_PATH )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _FIBRECHANNELEX_DEVICE_PATH ) ) . Header
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                _FIBRECHANNELEX_DEVICE_PATH ) , "::" , stringify ! ( Header )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _FIBRECHANNELEX_DEVICE_PATH ) ) .
                Reserved as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                _FIBRECHANNELEX_DEVICE_PATH ) , "::" , stringify ! ( Reserved
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _FIBRECHANNELEX_DEVICE_PATH ) ) . WWN as
                * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                _FIBRECHANNELEX_DEVICE_PATH ) , "::" , stringify ! ( WWN ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _FIBRECHANNELEX_DEVICE_PATH ) ) . Lun as
                * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                _FIBRECHANNELEX_DEVICE_PATH ) , "::" , stringify ! ( Lun ) ));
}
impl Clone for _FIBRECHANNELEX_DEVICE_PATH {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type FIBRECHANNELEX_DEVICE_PATH = _FIBRECHANNELEX_DEVICE_PATH;
#[repr(C)]

pub struct _F1394_DEVICE_PATH {
    pub Header: EFI_DEVICE_PATH,
    pub Reserved: UINT32,
    pub Guid: UINT64,
}
#[test]
fn bindgen_test_layout__F1394_DEVICE_PATH() {
    assert_eq!(::core::mem::size_of::<_F1394_DEVICE_PATH>() , 16usize , concat
               ! ( "Size of: " , stringify ! ( _F1394_DEVICE_PATH ) ));
    assert_eq! (::core::mem::align_of::<_F1394_DEVICE_PATH>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( _F1394_DEVICE_PATH ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _F1394_DEVICE_PATH ) ) . Header as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _F1394_DEVICE_PATH ) ,
                "::" , stringify ! ( Header ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _F1394_DEVICE_PATH ) ) . Reserved as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( _F1394_DEVICE_PATH ) ,
                "::" , stringify ! ( Reserved ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _F1394_DEVICE_PATH ) ) . Guid as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _F1394_DEVICE_PATH ) ,
                "::" , stringify ! ( Guid ) ));
}
impl Clone for _F1394_DEVICE_PATH {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type F1394_DEVICE_PATH = _F1394_DEVICE_PATH;
#[repr(C)]

pub struct _USB_DEVICE_PATH {
    pub Header: EFI_DEVICE_PATH,
    pub Port: UINT8,
    pub Endpoint: UINT8,
}
#[test]
fn bindgen_test_layout__USB_DEVICE_PATH() {
    assert_eq!(::core::mem::size_of::<_USB_DEVICE_PATH>() , 6usize , concat !
               ( "Size of: " , stringify ! ( _USB_DEVICE_PATH ) ));
    assert_eq! (::core::mem::align_of::<_USB_DEVICE_PATH>() , 1usize , concat
                ! ( "Alignment of " , stringify ! ( _USB_DEVICE_PATH ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _USB_DEVICE_PATH ) ) . Header as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _USB_DEVICE_PATH ) ,
                "::" , stringify ! ( Header ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _USB_DEVICE_PATH ) ) . Port as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( _USB_DEVICE_PATH ) ,
                "::" , stringify ! ( Port ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _USB_DEVICE_PATH ) ) . Endpoint as *
                const _ as usize } , 5usize , concat ! (
                "Alignment of field: " , stringify ! ( _USB_DEVICE_PATH ) ,
                "::" , stringify ! ( Endpoint ) ));
}
impl Clone for _USB_DEVICE_PATH {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type USB_DEVICE_PATH = _USB_DEVICE_PATH;
#[repr(C)]

pub struct _SATA_DEVICE_PATH {
    pub Header: EFI_DEVICE_PATH,
    pub HBAPortNumber: UINT16,
    pub PortMultiplierPortNumber: UINT16,
    pub Lun: UINT16,
}
#[test]
fn bindgen_test_layout__SATA_DEVICE_PATH() {
    assert_eq!(::core::mem::size_of::<_SATA_DEVICE_PATH>() , 10usize , concat
               ! ( "Size of: " , stringify ! ( _SATA_DEVICE_PATH ) ));
    assert_eq! (::core::mem::align_of::<_SATA_DEVICE_PATH>() , 2usize , concat
                ! ( "Alignment of " , stringify ! ( _SATA_DEVICE_PATH ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _SATA_DEVICE_PATH ) ) . Header as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _SATA_DEVICE_PATH ) ,
                "::" , stringify ! ( Header ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _SATA_DEVICE_PATH ) ) . HBAPortNumber as
                * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( _SATA_DEVICE_PATH ) ,
                "::" , stringify ! ( HBAPortNumber ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _SATA_DEVICE_PATH ) ) .
                PortMultiplierPortNumber as * const _ as usize } , 6usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( _SATA_DEVICE_PATH ) ,
                "::" , stringify ! ( PortMultiplierPortNumber ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _SATA_DEVICE_PATH ) ) . Lun as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _SATA_DEVICE_PATH ) ,
                "::" , stringify ! ( Lun ) ));
}
impl Clone for _SATA_DEVICE_PATH {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type SATA_DEVICE_PATH = _SATA_DEVICE_PATH;
#[repr(C)]

pub struct _USB_WWID_DEVICE_PATH {
    pub Header: EFI_DEVICE_PATH,
    pub InterfaceNumber: UINT16,
    pub VendorId: UINT16,
    pub ProductId: UINT16,
    pub SerialNumber: [CHAR16; 1usize],
}
#[test]
fn bindgen_test_layout__USB_WWID_DEVICE_PATH() {
    assert_eq!(::core::mem::size_of::<_USB_WWID_DEVICE_PATH>() , 12usize ,
               concat ! ( "Size of: " , stringify ! ( _USB_WWID_DEVICE_PATH )
               ));
    assert_eq! (::core::mem::align_of::<_USB_WWID_DEVICE_PATH>() , 2usize ,
                concat ! (
                "Alignment of " , stringify ! ( _USB_WWID_DEVICE_PATH ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _USB_WWID_DEVICE_PATH ) ) . Header as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _USB_WWID_DEVICE_PATH )
                , "::" , stringify ! ( Header ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _USB_WWID_DEVICE_PATH ) ) .
                InterfaceNumber as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( _USB_WWID_DEVICE_PATH )
                , "::" , stringify ! ( InterfaceNumber ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _USB_WWID_DEVICE_PATH ) ) . VendorId as *
                const _ as usize } , 6usize , concat ! (
                "Alignment of field: " , stringify ! ( _USB_WWID_DEVICE_PATH )
                , "::" , stringify ! ( VendorId ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _USB_WWID_DEVICE_PATH ) ) . ProductId as
                * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _USB_WWID_DEVICE_PATH )
                , "::" , stringify ! ( ProductId ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _USB_WWID_DEVICE_PATH ) ) . SerialNumber
                as * const _ as usize } , 10usize , concat ! (
                "Alignment of field: " , stringify ! ( _USB_WWID_DEVICE_PATH )
                , "::" , stringify ! ( SerialNumber ) ));
}
impl Clone for _USB_WWID_DEVICE_PATH {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type USB_WWID_DEVICE_PATH = _USB_WWID_DEVICE_PATH;
#[repr(C)]

pub struct _DEVICE_LOGICAL_UNIT_DEVICE_PATH {
    pub Header: EFI_DEVICE_PATH,
    pub Lun: UINT8,
}
#[test]
fn bindgen_test_layout__DEVICE_LOGICAL_UNIT_DEVICE_PATH() {
    assert_eq!(::core::mem::size_of::<_DEVICE_LOGICAL_UNIT_DEVICE_PATH>() ,
               5usize , concat ! (
               "Size of: " , stringify ! ( _DEVICE_LOGICAL_UNIT_DEVICE_PATH )
               ));
    assert_eq! (::core::mem::align_of::<_DEVICE_LOGICAL_UNIT_DEVICE_PATH>() ,
                1usize , concat ! (
                "Alignment of " , stringify ! (
                _DEVICE_LOGICAL_UNIT_DEVICE_PATH ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _DEVICE_LOGICAL_UNIT_DEVICE_PATH ) ) .
                Header as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                _DEVICE_LOGICAL_UNIT_DEVICE_PATH ) , "::" , stringify ! (
                Header ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _DEVICE_LOGICAL_UNIT_DEVICE_PATH ) ) .
                Lun as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                _DEVICE_LOGICAL_UNIT_DEVICE_PATH ) , "::" , stringify ! ( Lun
                ) ));
}
impl Clone for _DEVICE_LOGICAL_UNIT_DEVICE_PATH {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type DEVICE_LOGICAL_UNIT_DEVICE_PATH = _DEVICE_LOGICAL_UNIT_DEVICE_PATH;
#[repr(C)]

pub struct _USB_CLASS_DEVICE_PATH {
    pub Header: EFI_DEVICE_PATH,
    pub VendorId: UINT16,
    pub ProductId: UINT16,
    pub DeviceClass: UINT8,
    pub DeviceSubclass: UINT8,
    pub DeviceProtocol: UINT8,
}
#[test]
fn bindgen_test_layout__USB_CLASS_DEVICE_PATH() {
    assert_eq!(::core::mem::size_of::<_USB_CLASS_DEVICE_PATH>() , 12usize ,
               concat ! ( "Size of: " , stringify ! ( _USB_CLASS_DEVICE_PATH )
               ));
    assert_eq! (::core::mem::align_of::<_USB_CLASS_DEVICE_PATH>() , 2usize ,
                concat ! (
                "Alignment of " , stringify ! ( _USB_CLASS_DEVICE_PATH ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _USB_CLASS_DEVICE_PATH ) ) . Header as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _USB_CLASS_DEVICE_PATH
                ) , "::" , stringify ! ( Header ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _USB_CLASS_DEVICE_PATH ) ) . VendorId as
                * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( _USB_CLASS_DEVICE_PATH
                ) , "::" , stringify ! ( VendorId ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _USB_CLASS_DEVICE_PATH ) ) . ProductId as
                * const _ as usize } , 6usize , concat ! (
                "Alignment of field: " , stringify ! ( _USB_CLASS_DEVICE_PATH
                ) , "::" , stringify ! ( ProductId ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _USB_CLASS_DEVICE_PATH ) ) . DeviceClass
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _USB_CLASS_DEVICE_PATH
                ) , "::" , stringify ! ( DeviceClass ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _USB_CLASS_DEVICE_PATH ) ) .
                DeviceSubclass as * const _ as usize } , 9usize , concat ! (
                "Alignment of field: " , stringify ! ( _USB_CLASS_DEVICE_PATH
                ) , "::" , stringify ! ( DeviceSubclass ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _USB_CLASS_DEVICE_PATH ) ) .
                DeviceProtocol as * const _ as usize } , 10usize , concat ! (
                "Alignment of field: " , stringify ! ( _USB_CLASS_DEVICE_PATH
                ) , "::" , stringify ! ( DeviceProtocol ) ));
}
impl Clone for _USB_CLASS_DEVICE_PATH {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type USB_CLASS_DEVICE_PATH = _USB_CLASS_DEVICE_PATH;
#[repr(C)]

pub struct _I2O_DEVICE_PATH {
    pub Header: EFI_DEVICE_PATH,
    pub Tid: UINT32,
}
#[test]
fn bindgen_test_layout__I2O_DEVICE_PATH() {
    assert_eq!(::core::mem::size_of::<_I2O_DEVICE_PATH>() , 8usize , concat !
               ( "Size of: " , stringify ! ( _I2O_DEVICE_PATH ) ));
    assert_eq! (::core::mem::align_of::<_I2O_DEVICE_PATH>() , 4usize , concat
                ! ( "Alignment of " , stringify ! ( _I2O_DEVICE_PATH ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _I2O_DEVICE_PATH ) ) . Header as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _I2O_DEVICE_PATH ) ,
                "::" , stringify ! ( Header ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _I2O_DEVICE_PATH ) ) . Tid as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( _I2O_DEVICE_PATH ) ,
                "::" , stringify ! ( Tid ) ));
}
impl Clone for _I2O_DEVICE_PATH {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type I2O_DEVICE_PATH = _I2O_DEVICE_PATH;
#[repr(C)]

pub struct _MAC_ADDR_DEVICE_PATH {
    pub Header: EFI_DEVICE_PATH,
    pub MacAddress: EFI_MAC_ADDRESS,
    pub IfType: UINT8,
}
#[test]
fn bindgen_test_layout__MAC_ADDR_DEVICE_PATH() {
    assert_eq!(::core::mem::size_of::<_MAC_ADDR_DEVICE_PATH>() , 37usize ,
               concat ! ( "Size of: " , stringify ! ( _MAC_ADDR_DEVICE_PATH )
               ));
    assert_eq! (::core::mem::align_of::<_MAC_ADDR_DEVICE_PATH>() , 1usize ,
                concat ! (
                "Alignment of " , stringify ! ( _MAC_ADDR_DEVICE_PATH ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _MAC_ADDR_DEVICE_PATH ) ) . Header as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _MAC_ADDR_DEVICE_PATH )
                , "::" , stringify ! ( Header ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _MAC_ADDR_DEVICE_PATH ) ) . MacAddress as
                * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( _MAC_ADDR_DEVICE_PATH )
                , "::" , stringify ! ( MacAddress ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _MAC_ADDR_DEVICE_PATH ) ) . IfType as *
                const _ as usize } , 36usize , concat ! (
                "Alignment of field: " , stringify ! ( _MAC_ADDR_DEVICE_PATH )
                , "::" , stringify ! ( IfType ) ));
}
impl Clone for _MAC_ADDR_DEVICE_PATH {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type MAC_ADDR_DEVICE_PATH = _MAC_ADDR_DEVICE_PATH;
#[repr(C)]

pub struct _IPv4_DEVICE_PATH {
    pub Header: EFI_DEVICE_PATH,
    pub LocalIpAddress: EFI_IPv4_ADDRESS,
    pub RemoteIpAddress: EFI_IPv4_ADDRESS,
    pub LocalPort: UINT16,
    pub RemotePort: UINT16,
    pub Protocol: UINT16,
    pub StaticIpAddress: BOOLEAN,
    pub GatewayIpAddress: EFI_IPv4_ADDRESS,
    pub SubnetMask: EFI_IPv4_ADDRESS,
}
#[test]
fn bindgen_test_layout__IPv4_DEVICE_PATH() {
    assert_eq!(::core::mem::size_of::<_IPv4_DEVICE_PATH>() , 28usize , concat
               ! ( "Size of: " , stringify ! ( _IPv4_DEVICE_PATH ) ));
    assert_eq! (::core::mem::align_of::<_IPv4_DEVICE_PATH>() , 2usize , concat
                ! ( "Alignment of " , stringify ! ( _IPv4_DEVICE_PATH ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IPv4_DEVICE_PATH ) ) . Header as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _IPv4_DEVICE_PATH ) ,
                "::" , stringify ! ( Header ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IPv4_DEVICE_PATH ) ) . LocalIpAddress as
                * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( _IPv4_DEVICE_PATH ) ,
                "::" , stringify ! ( LocalIpAddress ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IPv4_DEVICE_PATH ) ) . RemoteIpAddress
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _IPv4_DEVICE_PATH ) ,
                "::" , stringify ! ( RemoteIpAddress ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IPv4_DEVICE_PATH ) ) . LocalPort as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( _IPv4_DEVICE_PATH ) ,
                "::" , stringify ! ( LocalPort ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IPv4_DEVICE_PATH ) ) . RemotePort as *
                const _ as usize } , 14usize , concat ! (
                "Alignment of field: " , stringify ! ( _IPv4_DEVICE_PATH ) ,
                "::" , stringify ! ( RemotePort ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IPv4_DEVICE_PATH ) ) . Protocol as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( _IPv4_DEVICE_PATH ) ,
                "::" , stringify ! ( Protocol ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IPv4_DEVICE_PATH ) ) . StaticIpAddress
                as * const _ as usize } , 18usize , concat ! (
                "Alignment of field: " , stringify ! ( _IPv4_DEVICE_PATH ) ,
                "::" , stringify ! ( StaticIpAddress ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IPv4_DEVICE_PATH ) ) . GatewayIpAddress
                as * const _ as usize } , 19usize , concat ! (
                "Alignment of field: " , stringify ! ( _IPv4_DEVICE_PATH ) ,
                "::" , stringify ! ( GatewayIpAddress ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IPv4_DEVICE_PATH ) ) . SubnetMask as *
                const _ as usize } , 23usize , concat ! (
                "Alignment of field: " , stringify ! ( _IPv4_DEVICE_PATH ) ,
                "::" , stringify ! ( SubnetMask ) ));
}
impl Clone for _IPv4_DEVICE_PATH {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type IPv4_DEVICE_PATH = _IPv4_DEVICE_PATH;
#[repr(C)]

pub struct _IPv6_DEVICE_PATH {
    pub Header: EFI_DEVICE_PATH,
    pub LocalIpAddress: EFI_IPv6_ADDRESS,
    pub RemoteIpAddress: EFI_IPv6_ADDRESS,
    pub LocalPort: UINT16,
    pub RemotePort: UINT16,
    pub Protocol: UINT16,
    pub IPAddressOrigin: BOOLEAN,
    pub PrefixLength: UINT8,
    pub GatewayIpAddress: EFI_IPv6_ADDRESS,
}
#[test]
fn bindgen_test_layout__IPv6_DEVICE_PATH() {
    assert_eq!(::core::mem::size_of::<_IPv6_DEVICE_PATH>() , 60usize , concat
               ! ( "Size of: " , stringify ! ( _IPv6_DEVICE_PATH ) ));
    assert_eq! (::core::mem::align_of::<_IPv6_DEVICE_PATH>() , 2usize , concat
                ! ( "Alignment of " , stringify ! ( _IPv6_DEVICE_PATH ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IPv6_DEVICE_PATH ) ) . Header as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _IPv6_DEVICE_PATH ) ,
                "::" , stringify ! ( Header ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IPv6_DEVICE_PATH ) ) . LocalIpAddress as
                * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( _IPv6_DEVICE_PATH ) ,
                "::" , stringify ! ( LocalIpAddress ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IPv6_DEVICE_PATH ) ) . RemoteIpAddress
                as * const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( _IPv6_DEVICE_PATH ) ,
                "::" , stringify ! ( RemoteIpAddress ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IPv6_DEVICE_PATH ) ) . LocalPort as *
                const _ as usize } , 36usize , concat ! (
                "Alignment of field: " , stringify ! ( _IPv6_DEVICE_PATH ) ,
                "::" , stringify ! ( LocalPort ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IPv6_DEVICE_PATH ) ) . RemotePort as *
                const _ as usize } , 38usize , concat ! (
                "Alignment of field: " , stringify ! ( _IPv6_DEVICE_PATH ) ,
                "::" , stringify ! ( RemotePort ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IPv6_DEVICE_PATH ) ) . Protocol as *
                const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( _IPv6_DEVICE_PATH ) ,
                "::" , stringify ! ( Protocol ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IPv6_DEVICE_PATH ) ) . IPAddressOrigin
                as * const _ as usize } , 42usize , concat ! (
                "Alignment of field: " , stringify ! ( _IPv6_DEVICE_PATH ) ,
                "::" , stringify ! ( IPAddressOrigin ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IPv6_DEVICE_PATH ) ) . PrefixLength as *
                const _ as usize } , 43usize , concat ! (
                "Alignment of field: " , stringify ! ( _IPv6_DEVICE_PATH ) ,
                "::" , stringify ! ( PrefixLength ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IPv6_DEVICE_PATH ) ) . GatewayIpAddress
                as * const _ as usize } , 44usize , concat ! (
                "Alignment of field: " , stringify ! ( _IPv6_DEVICE_PATH ) ,
                "::" , stringify ! ( GatewayIpAddress ) ));
}
impl Clone for _IPv6_DEVICE_PATH {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type IPv6_DEVICE_PATH = _IPv6_DEVICE_PATH;
#[repr(C)]

pub struct _URI_DEVICE_PATH {
    pub Header: EFI_DEVICE_PATH,
    pub Uri: [CHAR8; 1usize],
}
#[test]
fn bindgen_test_layout__URI_DEVICE_PATH() {
    assert_eq!(::core::mem::size_of::<_URI_DEVICE_PATH>() , 5usize , concat !
               ( "Size of: " , stringify ! ( _URI_DEVICE_PATH ) ));
    assert_eq! (::core::mem::align_of::<_URI_DEVICE_PATH>() , 1usize , concat
                ! ( "Alignment of " , stringify ! ( _URI_DEVICE_PATH ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _URI_DEVICE_PATH ) ) . Header as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _URI_DEVICE_PATH ) ,
                "::" , stringify ! ( Header ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _URI_DEVICE_PATH ) ) . Uri as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( _URI_DEVICE_PATH ) ,
                "::" , stringify ! ( Uri ) ));
}
impl Clone for _URI_DEVICE_PATH {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type URI_DEVICE_PATH = _URI_DEVICE_PATH;
#[repr(C)]

pub struct _VLAN_DEVICE_PATH {
    pub Header: EFI_DEVICE_PATH,
    pub VlanId: UINT16,
}
#[test]
fn bindgen_test_layout__VLAN_DEVICE_PATH() {
    assert_eq!(::core::mem::size_of::<_VLAN_DEVICE_PATH>() , 6usize , concat !
               ( "Size of: " , stringify ! ( _VLAN_DEVICE_PATH ) ));
    assert_eq! (::core::mem::align_of::<_VLAN_DEVICE_PATH>() , 2usize , concat
                ! ( "Alignment of " , stringify ! ( _VLAN_DEVICE_PATH ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _VLAN_DEVICE_PATH ) ) . Header as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _VLAN_DEVICE_PATH ) ,
                "::" , stringify ! ( Header ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _VLAN_DEVICE_PATH ) ) . VlanId as * const
                _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( _VLAN_DEVICE_PATH ) ,
                "::" , stringify ! ( VlanId ) ));
}
impl Clone for _VLAN_DEVICE_PATH {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type VLAN_DEVICE_PATH = _VLAN_DEVICE_PATH;
#[repr(C)]

pub struct _INFINIBAND_DEVICE_PATH {
    pub Header: EFI_DEVICE_PATH,
    pub ResourceFlags: UINT32,
    pub PortGid: UINT64,
    pub ServiceId: UINT64,
    pub TargetPortId: UINT64,
    pub DeviceId: UINT64,
}
#[test]
fn bindgen_test_layout__INFINIBAND_DEVICE_PATH() {
    assert_eq!(::core::mem::size_of::<_INFINIBAND_DEVICE_PATH>() , 40usize ,
               concat ! (
               "Size of: " , stringify ! ( _INFINIBAND_DEVICE_PATH ) ));
    assert_eq! (::core::mem::align_of::<_INFINIBAND_DEVICE_PATH>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( _INFINIBAND_DEVICE_PATH ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _INFINIBAND_DEVICE_PATH ) ) . Header as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _INFINIBAND_DEVICE_PATH
                ) , "::" , stringify ! ( Header ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _INFINIBAND_DEVICE_PATH ) ) .
                ResourceFlags as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( _INFINIBAND_DEVICE_PATH
                ) , "::" , stringify ! ( ResourceFlags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _INFINIBAND_DEVICE_PATH ) ) . PortGid as
                * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _INFINIBAND_DEVICE_PATH
                ) , "::" , stringify ! ( PortGid ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _INFINIBAND_DEVICE_PATH ) ) . ServiceId
                as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( _INFINIBAND_DEVICE_PATH
                ) , "::" , stringify ! ( ServiceId ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _INFINIBAND_DEVICE_PATH ) ) .
                TargetPortId as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( _INFINIBAND_DEVICE_PATH
                ) , "::" , stringify ! ( TargetPortId ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _INFINIBAND_DEVICE_PATH ) ) . DeviceId as
                * const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( _INFINIBAND_DEVICE_PATH
                ) , "::" , stringify ! ( DeviceId ) ));
}
impl Clone for _INFINIBAND_DEVICE_PATH {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type INFINIBAND_DEVICE_PATH = _INFINIBAND_DEVICE_PATH;
#[repr(C)]

pub struct _UART_DEVICE_PATH {
    pub Header: EFI_DEVICE_PATH,
    pub Reserved: UINT32,
    pub BaudRate: UINT64,
    pub DataBits: UINT8,
    pub Parity: UINT8,
    pub StopBits: UINT8,
}
#[test]
fn bindgen_test_layout__UART_DEVICE_PATH() {
    assert_eq!(::core::mem::size_of::<_UART_DEVICE_PATH>() , 24usize , concat
               ! ( "Size of: " , stringify ! ( _UART_DEVICE_PATH ) ));
    assert_eq! (::core::mem::align_of::<_UART_DEVICE_PATH>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( _UART_DEVICE_PATH ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _UART_DEVICE_PATH ) ) . Header as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _UART_DEVICE_PATH ) ,
                "::" , stringify ! ( Header ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _UART_DEVICE_PATH ) ) . Reserved as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( _UART_DEVICE_PATH ) ,
                "::" , stringify ! ( Reserved ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _UART_DEVICE_PATH ) ) . BaudRate as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _UART_DEVICE_PATH ) ,
                "::" , stringify ! ( BaudRate ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _UART_DEVICE_PATH ) ) . DataBits as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( _UART_DEVICE_PATH ) ,
                "::" , stringify ! ( DataBits ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _UART_DEVICE_PATH ) ) . Parity as * const
                _ as usize } , 17usize , concat ! (
                "Alignment of field: " , stringify ! ( _UART_DEVICE_PATH ) ,
                "::" , stringify ! ( Parity ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _UART_DEVICE_PATH ) ) . StopBits as *
                const _ as usize } , 18usize , concat ! (
                "Alignment of field: " , stringify ! ( _UART_DEVICE_PATH ) ,
                "::" , stringify ! ( StopBits ) ));
}
impl Clone for _UART_DEVICE_PATH {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type UART_DEVICE_PATH = _UART_DEVICE_PATH;
#[repr(C)]

pub struct _HARDDRIVE_DEVICE_PATH {
    pub Header: EFI_DEVICE_PATH,
    pub PartitionNumber: UINT32,
    pub PartitionStart: UINT64,
    pub PartitionSize: UINT64,
    pub Signature: [UINT8; 16usize],
    pub MBRType: UINT8,
    pub SignatureType: UINT8,
}
#[test]
fn bindgen_test_layout__HARDDRIVE_DEVICE_PATH() {
    assert_eq!(::core::mem::size_of::<_HARDDRIVE_DEVICE_PATH>() , 48usize ,
               concat ! ( "Size of: " , stringify ! ( _HARDDRIVE_DEVICE_PATH )
               ));
    assert_eq! (::core::mem::align_of::<_HARDDRIVE_DEVICE_PATH>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( _HARDDRIVE_DEVICE_PATH ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _HARDDRIVE_DEVICE_PATH ) ) . Header as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _HARDDRIVE_DEVICE_PATH
                ) , "::" , stringify ! ( Header ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _HARDDRIVE_DEVICE_PATH ) ) .
                PartitionNumber as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( _HARDDRIVE_DEVICE_PATH
                ) , "::" , stringify ! ( PartitionNumber ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _HARDDRIVE_DEVICE_PATH ) ) .
                PartitionStart as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _HARDDRIVE_DEVICE_PATH
                ) , "::" , stringify ! ( PartitionStart ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _HARDDRIVE_DEVICE_PATH ) ) .
                PartitionSize as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( _HARDDRIVE_DEVICE_PATH
                ) , "::" , stringify ! ( PartitionSize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _HARDDRIVE_DEVICE_PATH ) ) . Signature as
                * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( _HARDDRIVE_DEVICE_PATH
                ) , "::" , stringify ! ( Signature ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _HARDDRIVE_DEVICE_PATH ) ) . MBRType as *
                const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( _HARDDRIVE_DEVICE_PATH
                ) , "::" , stringify ! ( MBRType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _HARDDRIVE_DEVICE_PATH ) ) .
                SignatureType as * const _ as usize } , 41usize , concat ! (
                "Alignment of field: " , stringify ! ( _HARDDRIVE_DEVICE_PATH
                ) , "::" , stringify ! ( SignatureType ) ));
}
impl Clone for _HARDDRIVE_DEVICE_PATH {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type HARDDRIVE_DEVICE_PATH = _HARDDRIVE_DEVICE_PATH;
#[repr(C)]

pub struct _CDROM_DEVICE_PATH {
    pub Header: EFI_DEVICE_PATH,
    pub BootEntry: UINT32,
    pub PartitionStart: UINT64,
    pub PartitionSize: UINT64,
}
#[test]
fn bindgen_test_layout__CDROM_DEVICE_PATH() {
    assert_eq!(::core::mem::size_of::<_CDROM_DEVICE_PATH>() , 24usize , concat
               ! ( "Size of: " , stringify ! ( _CDROM_DEVICE_PATH ) ));
    assert_eq! (::core::mem::align_of::<_CDROM_DEVICE_PATH>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( _CDROM_DEVICE_PATH ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _CDROM_DEVICE_PATH ) ) . Header as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _CDROM_DEVICE_PATH ) ,
                "::" , stringify ! ( Header ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _CDROM_DEVICE_PATH ) ) . BootEntry as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( _CDROM_DEVICE_PATH ) ,
                "::" , stringify ! ( BootEntry ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _CDROM_DEVICE_PATH ) ) . PartitionStart
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _CDROM_DEVICE_PATH ) ,
                "::" , stringify ! ( PartitionStart ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _CDROM_DEVICE_PATH ) ) . PartitionSize as
                * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( _CDROM_DEVICE_PATH ) ,
                "::" , stringify ! ( PartitionSize ) ));
}
impl Clone for _CDROM_DEVICE_PATH {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type CDROM_DEVICE_PATH = _CDROM_DEVICE_PATH;
#[repr(C)]

pub struct _FILEPATH_DEVICE_PATH {
    pub Header: EFI_DEVICE_PATH,
    pub PathName: [CHAR16; 1usize],
}
#[test]
fn bindgen_test_layout__FILEPATH_DEVICE_PATH() {
    assert_eq!(::core::mem::size_of::<_FILEPATH_DEVICE_PATH>() , 6usize ,
               concat ! ( "Size of: " , stringify ! ( _FILEPATH_DEVICE_PATH )
               ));
    assert_eq! (::core::mem::align_of::<_FILEPATH_DEVICE_PATH>() , 2usize ,
                concat ! (
                "Alignment of " , stringify ! ( _FILEPATH_DEVICE_PATH ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _FILEPATH_DEVICE_PATH ) ) . Header as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _FILEPATH_DEVICE_PATH )
                , "::" , stringify ! ( Header ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _FILEPATH_DEVICE_PATH ) ) . PathName as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( _FILEPATH_DEVICE_PATH )
                , "::" , stringify ! ( PathName ) ));
}
impl Clone for _FILEPATH_DEVICE_PATH {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type FILEPATH_DEVICE_PATH = _FILEPATH_DEVICE_PATH;
#[repr(C)]

pub struct _MEDIA_PROTOCOL_DEVICE_PATH {
    pub Header: EFI_DEVICE_PATH,
    pub Protocol: EFI_GUID,
}
#[test]
fn bindgen_test_layout__MEDIA_PROTOCOL_DEVICE_PATH() {
    assert_eq!(::core::mem::size_of::<_MEDIA_PROTOCOL_DEVICE_PATH>() , 20usize
               , concat ! (
               "Size of: " , stringify ! ( _MEDIA_PROTOCOL_DEVICE_PATH ) ));
    assert_eq! (::core::mem::align_of::<_MEDIA_PROTOCOL_DEVICE_PATH>() ,
                4usize , concat ! (
                "Alignment of " , stringify ! ( _MEDIA_PROTOCOL_DEVICE_PATH )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _MEDIA_PROTOCOL_DEVICE_PATH ) ) . Header
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                _MEDIA_PROTOCOL_DEVICE_PATH ) , "::" , stringify ! ( Header )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _MEDIA_PROTOCOL_DEVICE_PATH ) ) .
                Protocol as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                _MEDIA_PROTOCOL_DEVICE_PATH ) , "::" , stringify ! ( Protocol
                ) ));
}
impl Clone for _MEDIA_PROTOCOL_DEVICE_PATH {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type MEDIA_PROTOCOL_DEVICE_PATH = _MEDIA_PROTOCOL_DEVICE_PATH;
#[repr(C)]

pub struct _MEDIA_FW_VOL_FILEPATH_DEVICE_PATH {
    pub Header: EFI_DEVICE_PATH,
    pub FvFileName: EFI_GUID,
}
#[test]
fn bindgen_test_layout__MEDIA_FW_VOL_FILEPATH_DEVICE_PATH() {
    assert_eq!(::core::mem::size_of::<_MEDIA_FW_VOL_FILEPATH_DEVICE_PATH>() ,
               20usize , concat ! (
               "Size of: " , stringify ! ( _MEDIA_FW_VOL_FILEPATH_DEVICE_PATH
               ) ));
    assert_eq! (::core::mem::align_of::<_MEDIA_FW_VOL_FILEPATH_DEVICE_PATH>()
                , 4usize , concat ! (
                "Alignment of " , stringify ! (
                _MEDIA_FW_VOL_FILEPATH_DEVICE_PATH ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _MEDIA_FW_VOL_FILEPATH_DEVICE_PATH ) ) .
                Header as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                _MEDIA_FW_VOL_FILEPATH_DEVICE_PATH ) , "::" , stringify ! (
                Header ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _MEDIA_FW_VOL_FILEPATH_DEVICE_PATH ) ) .
                FvFileName as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                _MEDIA_FW_VOL_FILEPATH_DEVICE_PATH ) , "::" , stringify ! (
                FvFileName ) ));
}
impl Clone for _MEDIA_FW_VOL_FILEPATH_DEVICE_PATH {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type MEDIA_FW_VOL_FILEPATH_DEVICE_PATH =
    _MEDIA_FW_VOL_FILEPATH_DEVICE_PATH;
#[repr(C)]

pub struct _MEDIA_FW_VOL_DEVICE_PATH {
    pub Header: EFI_DEVICE_PATH,
    pub FvName: EFI_GUID,
}
#[test]
fn bindgen_test_layout__MEDIA_FW_VOL_DEVICE_PATH() {
    assert_eq!(::core::mem::size_of::<_MEDIA_FW_VOL_DEVICE_PATH>() , 20usize ,
               concat ! (
               "Size of: " , stringify ! ( _MEDIA_FW_VOL_DEVICE_PATH ) ));
    assert_eq! (::core::mem::align_of::<_MEDIA_FW_VOL_DEVICE_PATH>() , 4usize
                , concat ! (
                "Alignment of " , stringify ! ( _MEDIA_FW_VOL_DEVICE_PATH )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _MEDIA_FW_VOL_DEVICE_PATH ) ) . Header as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                _MEDIA_FW_VOL_DEVICE_PATH ) , "::" , stringify ! ( Header )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _MEDIA_FW_VOL_DEVICE_PATH ) ) . FvName as
                * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                _MEDIA_FW_VOL_DEVICE_PATH ) , "::" , stringify ! ( FvName )
                ));
}
impl Clone for _MEDIA_FW_VOL_DEVICE_PATH {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type MEDIA_FW_VOL_DEVICE_PATH = _MEDIA_FW_VOL_DEVICE_PATH;
#[repr(C)]

pub struct _MEDIA_RELATIVE_OFFSET_RANGE_DEVICE_PATH {
    pub Header: EFI_DEVICE_PATH,
    pub Reserved: UINT32,
    pub StartingOffset: UINT64,
    pub EndingOffset: UINT64,
}
#[test]
fn bindgen_test_layout__MEDIA_RELATIVE_OFFSET_RANGE_DEVICE_PATH() {
    assert_eq!(::core::mem::size_of::<_MEDIA_RELATIVE_OFFSET_RANGE_DEVICE_PATH>()
               , 24usize , concat ! (
               "Size of: " , stringify ! (
               _MEDIA_RELATIVE_OFFSET_RANGE_DEVICE_PATH ) ));
    assert_eq! (::core::mem::align_of::<_MEDIA_RELATIVE_OFFSET_RANGE_DEVICE_PATH>()
                , 8usize , concat ! (
                "Alignment of " , stringify ! (
                _MEDIA_RELATIVE_OFFSET_RANGE_DEVICE_PATH ) ));
    assert_eq! (unsafe {
                & (
                * ( 0 as * const _MEDIA_RELATIVE_OFFSET_RANGE_DEVICE_PATH ) )
                . Header as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                _MEDIA_RELATIVE_OFFSET_RANGE_DEVICE_PATH ) , "::" , stringify
                ! ( Header ) ));
    assert_eq! (unsafe {
                & (
                * ( 0 as * const _MEDIA_RELATIVE_OFFSET_RANGE_DEVICE_PATH ) )
                . Reserved as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                _MEDIA_RELATIVE_OFFSET_RANGE_DEVICE_PATH ) , "::" , stringify
                ! ( Reserved ) ));
    assert_eq! (unsafe {
                & (
                * ( 0 as * const _MEDIA_RELATIVE_OFFSET_RANGE_DEVICE_PATH ) )
                . StartingOffset as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                _MEDIA_RELATIVE_OFFSET_RANGE_DEVICE_PATH ) , "::" , stringify
                ! ( StartingOffset ) ));
    assert_eq! (unsafe {
                & (
                * ( 0 as * const _MEDIA_RELATIVE_OFFSET_RANGE_DEVICE_PATH ) )
                . EndingOffset as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                _MEDIA_RELATIVE_OFFSET_RANGE_DEVICE_PATH ) , "::" , stringify
                ! ( EndingOffset ) ));
}
impl Clone for _MEDIA_RELATIVE_OFFSET_RANGE_DEVICE_PATH {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type MEDIA_RELATIVE_OFFSET_RANGE_DEVICE_PATH =
    _MEDIA_RELATIVE_OFFSET_RANGE_DEVICE_PATH;
#[repr(C)]

pub struct _BBS_BBS_DEVICE_PATH {
    pub Header: EFI_DEVICE_PATH,
    pub DeviceType: UINT16,
    pub StatusFlag: UINT16,
    pub String: [CHAR8; 1usize],
}
#[test]
fn bindgen_test_layout__BBS_BBS_DEVICE_PATH() {
    assert_eq!(::core::mem::size_of::<_BBS_BBS_DEVICE_PATH>() , 10usize ,
               concat ! ( "Size of: " , stringify ! ( _BBS_BBS_DEVICE_PATH )
               ));
    assert_eq! (::core::mem::align_of::<_BBS_BBS_DEVICE_PATH>() , 2usize ,
                concat ! (
                "Alignment of " , stringify ! ( _BBS_BBS_DEVICE_PATH ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _BBS_BBS_DEVICE_PATH ) ) . Header as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _BBS_BBS_DEVICE_PATH )
                , "::" , stringify ! ( Header ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _BBS_BBS_DEVICE_PATH ) ) . DeviceType as
                * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( _BBS_BBS_DEVICE_PATH )
                , "::" , stringify ! ( DeviceType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _BBS_BBS_DEVICE_PATH ) ) . StatusFlag as
                * const _ as usize } , 6usize , concat ! (
                "Alignment of field: " , stringify ! ( _BBS_BBS_DEVICE_PATH )
                , "::" , stringify ! ( StatusFlag ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _BBS_BBS_DEVICE_PATH ) ) . String as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _BBS_BBS_DEVICE_PATH )
                , "::" , stringify ! ( String ) ));
}
impl Clone for _BBS_BBS_DEVICE_PATH {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type BBS_BBS_DEVICE_PATH = _BBS_BBS_DEVICE_PATH;
#[repr(C)]

pub union EFI_DEV_PATH {
    pub DevPath: EFI_DEVICE_PATH,
    pub Pci: PCI_DEVICE_PATH,
    pub PcCard: PCCARD_DEVICE_PATH,
    pub MemMap: MEMMAP_DEVICE_PATH,
    pub Vendor: VENDOR_DEVICE_PATH,
    pub UnknownVendor: UNKNOWN_DEVICE_VENDOR_DEVICE_PATH,
    pub Controller: CONTROLLER_DEVICE_PATH,
    pub Acpi: ACPI_HID_DEVICE_PATH,
    pub Atapi: ATAPI_DEVICE_PATH,
    pub Scsi: SCSI_DEVICE_PATH,
    pub FibreChannel: FIBRECHANNEL_DEVICE_PATH,
    pub F1394: F1394_DEVICE_PATH,
    pub Usb: USB_DEVICE_PATH,
    pub UsbClass: USB_CLASS_DEVICE_PATH,
    pub I2O: I2O_DEVICE_PATH,
    pub MacAddr: MAC_ADDR_DEVICE_PATH,
    pub Ipv4: IPv4_DEVICE_PATH,
    pub Ipv6: IPv6_DEVICE_PATH,
    pub InfiniBand: INFINIBAND_DEVICE_PATH,
    pub Uart: UART_DEVICE_PATH,
    pub HardDrive: HARDDRIVE_DEVICE_PATH,
    pub CD: CDROM_DEVICE_PATH,
    pub FilePath: FILEPATH_DEVICE_PATH,
    pub MediaProtocol: MEDIA_PROTOCOL_DEVICE_PATH,
    pub Bbs: BBS_BBS_DEVICE_PATH,
}
#[test]
fn bindgen_test_layout_EFI_DEV_PATH() {
    assert_eq!(::core::mem::size_of::<EFI_DEV_PATH>() , 64usize , concat ! (
               "Size of: " , stringify ! ( EFI_DEV_PATH ) ));
    assert_eq! (::core::mem::align_of::<EFI_DEV_PATH>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( EFI_DEV_PATH ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH ) ) . DevPath as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH ) , "::" ,
                stringify ! ( DevPath ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH ) ) . Pci as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH ) , "::" ,
                stringify ! ( Pci ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH ) ) . PcCard as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH ) , "::" ,
                stringify ! ( PcCard ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH ) ) . MemMap as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH ) , "::" ,
                stringify ! ( MemMap ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH ) ) . Vendor as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH ) , "::" ,
                stringify ! ( Vendor ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH ) ) . UnknownVendor as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH ) , "::" ,
                stringify ! ( UnknownVendor ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH ) ) . Controller as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH ) , "::" ,
                stringify ! ( Controller ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH ) ) . Acpi as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH ) , "::" ,
                stringify ! ( Acpi ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH ) ) . Atapi as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH ) , "::" ,
                stringify ! ( Atapi ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH ) ) . Scsi as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH ) , "::" ,
                stringify ! ( Scsi ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH ) ) . FibreChannel as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH ) , "::" ,
                stringify ! ( FibreChannel ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH ) ) . F1394 as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH ) , "::" ,
                stringify ! ( F1394 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH ) ) . Usb as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH ) , "::" ,
                stringify ! ( Usb ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH ) ) . UsbClass as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH ) , "::" ,
                stringify ! ( UsbClass ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH ) ) . I2O as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH ) , "::" ,
                stringify ! ( I2O ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH ) ) . MacAddr as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH ) , "::" ,
                stringify ! ( MacAddr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH ) ) . Ipv4 as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH ) , "::" ,
                stringify ! ( Ipv4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH ) ) . Ipv6 as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH ) , "::" ,
                stringify ! ( Ipv6 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH ) ) . InfiniBand as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH ) , "::" ,
                stringify ! ( InfiniBand ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH ) ) . Uart as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH ) , "::" ,
                stringify ! ( Uart ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH ) ) . HardDrive as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH ) , "::" ,
                stringify ! ( HardDrive ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH ) ) . CD as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH ) , "::" ,
                stringify ! ( CD ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH ) ) . FilePath as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH ) , "::" ,
                stringify ! ( FilePath ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH ) ) . MediaProtocol as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH ) , "::" ,
                stringify ! ( MediaProtocol ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH ) ) . Bbs as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH ) , "::" ,
                stringify ! ( Bbs ) ));
}
impl Clone for EFI_DEV_PATH {
    fn clone(&self) -> Self { unimplemented!() }
}
#[repr(C)]

pub union EFI_DEV_PATH_PTR {
    pub DevPath: *mut EFI_DEVICE_PATH,
    pub Pci: *mut PCI_DEVICE_PATH,
    pub PcCard: *mut PCCARD_DEVICE_PATH,
    pub MemMap: *mut MEMMAP_DEVICE_PATH,
    pub Vendor: *mut VENDOR_DEVICE_PATH,
    pub UnknownVendor: *mut UNKNOWN_DEVICE_VENDOR_DEVICE_PATH,
    pub Controller: *mut CONTROLLER_DEVICE_PATH,
    pub Acpi: *mut ACPI_HID_DEVICE_PATH,
    pub Atapi: *mut ATAPI_DEVICE_PATH,
    pub Scsi: *mut SCSI_DEVICE_PATH,
    pub FibreChannel: *mut FIBRECHANNEL_DEVICE_PATH,
    pub F1394: *mut F1394_DEVICE_PATH,
    pub Usb: *mut USB_DEVICE_PATH,
    pub UsbClass: *mut USB_CLASS_DEVICE_PATH,
    pub I2O: *mut I2O_DEVICE_PATH,
    pub MacAddr: *mut MAC_ADDR_DEVICE_PATH,
    pub Ipv4: *mut IPv4_DEVICE_PATH,
    pub Ipv6: *mut IPv6_DEVICE_PATH,
    pub InfiniBand: *mut INFINIBAND_DEVICE_PATH,
    pub Uart: *mut UART_DEVICE_PATH,
    pub HardDrive: *mut HARDDRIVE_DEVICE_PATH,
    pub FilePath: *mut FILEPATH_DEVICE_PATH,
    pub MediaProtocol: *mut MEDIA_PROTOCOL_DEVICE_PATH,
    pub CD: *mut CDROM_DEVICE_PATH,
    pub Bbs: *mut BBS_BBS_DEVICE_PATH,
}
#[test]
fn bindgen_test_layout_EFI_DEV_PATH_PTR() {
    assert_eq!(::core::mem::size_of::<EFI_DEV_PATH_PTR>() , 8usize , concat !
               ( "Size of: " , stringify ! ( EFI_DEV_PATH_PTR ) ));
    assert_eq! (::core::mem::align_of::<EFI_DEV_PATH_PTR>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( EFI_DEV_PATH_PTR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH_PTR ) ) . DevPath as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH_PTR ) ,
                "::" , stringify ! ( DevPath ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH_PTR ) ) . Pci as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH_PTR ) ,
                "::" , stringify ! ( Pci ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH_PTR ) ) . PcCard as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH_PTR ) ,
                "::" , stringify ! ( PcCard ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH_PTR ) ) . MemMap as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH_PTR ) ,
                "::" , stringify ! ( MemMap ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH_PTR ) ) . Vendor as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH_PTR ) ,
                "::" , stringify ! ( Vendor ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH_PTR ) ) . UnknownVendor as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH_PTR ) ,
                "::" , stringify ! ( UnknownVendor ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH_PTR ) ) . Controller as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH_PTR ) ,
                "::" , stringify ! ( Controller ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH_PTR ) ) . Acpi as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH_PTR ) ,
                "::" , stringify ! ( Acpi ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH_PTR ) ) . Atapi as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH_PTR ) ,
                "::" , stringify ! ( Atapi ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH_PTR ) ) . Scsi as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH_PTR ) ,
                "::" , stringify ! ( Scsi ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH_PTR ) ) . FibreChannel as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH_PTR ) ,
                "::" , stringify ! ( FibreChannel ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH_PTR ) ) . F1394 as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH_PTR ) ,
                "::" , stringify ! ( F1394 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH_PTR ) ) . Usb as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH_PTR ) ,
                "::" , stringify ! ( Usb ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH_PTR ) ) . UsbClass as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH_PTR ) ,
                "::" , stringify ! ( UsbClass ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH_PTR ) ) . I2O as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH_PTR ) ,
                "::" , stringify ! ( I2O ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH_PTR ) ) . MacAddr as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH_PTR ) ,
                "::" , stringify ! ( MacAddr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH_PTR ) ) . Ipv4 as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH_PTR ) ,
                "::" , stringify ! ( Ipv4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH_PTR ) ) . Ipv6 as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH_PTR ) ,
                "::" , stringify ! ( Ipv6 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH_PTR ) ) . InfiniBand as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH_PTR ) ,
                "::" , stringify ! ( InfiniBand ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH_PTR ) ) . Uart as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH_PTR ) ,
                "::" , stringify ! ( Uart ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH_PTR ) ) . HardDrive as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH_PTR ) ,
                "::" , stringify ! ( HardDrive ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH_PTR ) ) . FilePath as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH_PTR ) ,
                "::" , stringify ! ( FilePath ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH_PTR ) ) . MediaProtocol as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH_PTR ) ,
                "::" , stringify ! ( MediaProtocol ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH_PTR ) ) . CD as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH_PTR ) ,
                "::" , stringify ! ( CD ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_DEV_PATH_PTR ) ) . Bbs as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_DEV_PATH_PTR ) ,
                "::" , stringify ! ( Bbs ) ));
}
impl Clone for EFI_DEV_PATH_PTR {
    fn clone(&self) -> Self { unimplemented!() }
}
#[repr(C)]

pub struct _EFI_PCI_IO {
    pub PollMem: EFI_PCI_IO_PROTOCOL_POLL_IO_MEM,
    pub PollIo: EFI_PCI_IO_PROTOCOL_POLL_IO_MEM,
    pub Mem: EFI_PCI_IO_PROTOCOL_ACCESS,
    pub Io: EFI_PCI_IO_PROTOCOL_ACCESS,
    pub Pci: EFI_PCI_IO_PROTOCOL_CONFIG_ACCESS,
    pub CopyMem: EFI_PCI_IO_PROTOCOL_COPY_MEM,
    pub Map: EFI_PCI_IO_PROTOCOL_MAP,
    pub Unmap: EFI_PCI_IO_PROTOCOL_UNMAP,
    pub AllocateBuffer: EFI_PCI_IO_PROTOCOL_ALLOCATE_BUFFER,
    pub FreeBuffer: EFI_PCI_IO_PROTOCOL_FREE_BUFFER,
    pub Flush: EFI_PCI_IO_PROTOCOL_FLUSH,
    pub GetLocation: EFI_PCI_IO_PROTOCOL_GET_LOCATION,
    pub Attributes: EFI_PCI_IO_PROTOCOL_ATTRIBUTES,
    pub GetBarAttributes: EFI_PCI_IO_PROTOCOL_GET_BAR_ATTRIBUTES,
    pub SetBarAttributes: EFI_PCI_IO_PROTOCOL_SET_BAR_ATTRIBUTES,
    pub RomSize: UINT64,
    pub RomImage: *mut ::ctypes::c_void,
}
#[test]
fn bindgen_test_layout__EFI_PCI_IO() {
    assert_eq!(::core::mem::size_of::<_EFI_PCI_IO>() , 160usize , concat ! (
               "Size of: " , stringify ! ( _EFI_PCI_IO ) ));
    assert_eq! (::core::mem::align_of::<_EFI_PCI_IO>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( _EFI_PCI_IO ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_PCI_IO ) ) . PollMem as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_PCI_IO ) , "::" ,
                stringify ! ( PollMem ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_PCI_IO ) ) . PollIo as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_PCI_IO ) , "::" ,
                stringify ! ( PollIo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_PCI_IO ) ) . Mem as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_PCI_IO ) , "::" ,
                stringify ! ( Mem ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_PCI_IO ) ) . Io as * const _ as
                usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_PCI_IO ) , "::" ,
                stringify ! ( Io ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_PCI_IO ) ) . Pci as * const _ as
                usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_PCI_IO ) , "::" ,
                stringify ! ( Pci ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_PCI_IO ) ) . CopyMem as * const _ as
                usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_PCI_IO ) , "::" ,
                stringify ! ( CopyMem ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_PCI_IO ) ) . Map as * const _ as
                usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_PCI_IO ) , "::" ,
                stringify ! ( Map ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_PCI_IO ) ) . Unmap as * const _ as
                usize } , 80usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_PCI_IO ) , "::" ,
                stringify ! ( Unmap ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_PCI_IO ) ) . AllocateBuffer as *
                const _ as usize } , 88usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_PCI_IO ) , "::" ,
                stringify ! ( AllocateBuffer ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_PCI_IO ) ) . FreeBuffer as * const _
                as usize } , 96usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_PCI_IO ) , "::" ,
                stringify ! ( FreeBuffer ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_PCI_IO ) ) . Flush as * const _ as
                usize } , 104usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_PCI_IO ) , "::" ,
                stringify ! ( Flush ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_PCI_IO ) ) . GetLocation as * const
                _ as usize } , 112usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_PCI_IO ) , "::" ,
                stringify ! ( GetLocation ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_PCI_IO ) ) . Attributes as * const _
                as usize } , 120usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_PCI_IO ) , "::" ,
                stringify ! ( Attributes ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_PCI_IO ) ) . GetBarAttributes as *
                const _ as usize } , 128usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_PCI_IO ) , "::" ,
                stringify ! ( GetBarAttributes ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_PCI_IO ) ) . SetBarAttributes as *
                const _ as usize } , 136usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_PCI_IO ) , "::" ,
                stringify ! ( SetBarAttributes ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_PCI_IO ) ) . RomSize as * const _ as
                usize } , 144usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_PCI_IO ) , "::" ,
                stringify ! ( RomSize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_PCI_IO ) ) . RomImage as * const _
                as usize } , 152usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_PCI_IO ) , "::" ,
                stringify ! ( RomImage ) ));
}
impl Clone for _EFI_PCI_IO {
    fn clone(&self) -> Self { unimplemented!() }
}
pub const EFI_PCI_IO_PROTOCOL_WIDTH_EfiPciIoWidthUint8:
          EFI_PCI_IO_PROTOCOL_WIDTH =
    0;
pub const EFI_PCI_IO_PROTOCOL_WIDTH_EfiPciIoWidthUint16:
          EFI_PCI_IO_PROTOCOL_WIDTH =
    1;
pub const EFI_PCI_IO_PROTOCOL_WIDTH_EfiPciIoWidthUint32:
          EFI_PCI_IO_PROTOCOL_WIDTH =
    2;
pub const EFI_PCI_IO_PROTOCOL_WIDTH_EfiPciIoWidthUint64:
          EFI_PCI_IO_PROTOCOL_WIDTH =
    3;
pub const EFI_PCI_IO_PROTOCOL_WIDTH_EfiPciIoWidthFifoUint8:
          EFI_PCI_IO_PROTOCOL_WIDTH =
    4;
pub const EFI_PCI_IO_PROTOCOL_WIDTH_EfiPciIoWidthFifoUint16:
          EFI_PCI_IO_PROTOCOL_WIDTH =
    5;
pub const EFI_PCI_IO_PROTOCOL_WIDTH_EfiPciIoWidthFifoUint32:
          EFI_PCI_IO_PROTOCOL_WIDTH =
    6;
pub const EFI_PCI_IO_PROTOCOL_WIDTH_EfiPciIoWidthFifoUint64:
          EFI_PCI_IO_PROTOCOL_WIDTH =
    7;
pub const EFI_PCI_IO_PROTOCOL_WIDTH_EfiPciIoWidthFillUint8:
          EFI_PCI_IO_PROTOCOL_WIDTH =
    8;
pub const EFI_PCI_IO_PROTOCOL_WIDTH_EfiPciIoWidthFillUint16:
          EFI_PCI_IO_PROTOCOL_WIDTH =
    9;
pub const EFI_PCI_IO_PROTOCOL_WIDTH_EfiPciIoWidthFillUint32:
          EFI_PCI_IO_PROTOCOL_WIDTH =
    10;
pub const EFI_PCI_IO_PROTOCOL_WIDTH_EfiPciIoWidthFillUint64:
          EFI_PCI_IO_PROTOCOL_WIDTH =
    11;
pub const EFI_PCI_IO_PROTOCOL_WIDTH_EfiPciIoWidthMaximum:
          EFI_PCI_IO_PROTOCOL_WIDTH =
    12;
pub type EFI_PCI_IO_PROTOCOL_WIDTH = ::ctypes::c_uint;
pub type EFI_PCI_IO_PROTOCOL_POLL_IO_MEM =
    ::core::option::Option<unsafe extern "win64" fn(This: *mut _EFI_PCI_IO,
                                                Width:
                                                    EFI_PCI_IO_PROTOCOL_WIDTH,
                                                BarIndex: UINT8,
                                                Offset: UINT64, Mask: UINT64,
                                                Value: UINT64, Delay: UINT64,
                                                Result: *mut UINT64)
                               -> EFI_STATUS>;
pub type EFI_PCI_IO_PROTOCOL_IO_MEM =
    ::core::option::Option<unsafe extern "win64" fn(This: *mut _EFI_PCI_IO,
                                                Width:
                                                    EFI_PCI_IO_PROTOCOL_WIDTH,
                                                BarIndex: UINT8,
                                                Offset: UINT64, Count: UINTN,
                                                Buffer: *mut ::ctypes::c_void)
                               -> EFI_STATUS>;
#[repr(C)]

pub struct EFI_PCI_IO_PROTOCOL_ACCESS {
    pub Read: EFI_PCI_IO_PROTOCOL_IO_MEM,
    pub Write: EFI_PCI_IO_PROTOCOL_IO_MEM,
}
#[test]
fn bindgen_test_layout_EFI_PCI_IO_PROTOCOL_ACCESS() {
    assert_eq!(::core::mem::size_of::<EFI_PCI_IO_PROTOCOL_ACCESS>() , 16usize
               , concat ! (
               "Size of: " , stringify ! ( EFI_PCI_IO_PROTOCOL_ACCESS ) ));
    assert_eq! (::core::mem::align_of::<EFI_PCI_IO_PROTOCOL_ACCESS>() , 8usize
                , concat ! (
                "Alignment of " , stringify ! ( EFI_PCI_IO_PROTOCOL_ACCESS )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PCI_IO_PROTOCOL_ACCESS ) ) . Read as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PCI_IO_PROTOCOL_ACCESS ) , "::" , stringify ! ( Read ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PCI_IO_PROTOCOL_ACCESS ) ) . Write as
                * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PCI_IO_PROTOCOL_ACCESS ) , "::" , stringify ! ( Write )
                ));
}
impl Clone for EFI_PCI_IO_PROTOCOL_ACCESS {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type EFI_PCI_IO_PROTOCOL_CONFIG =
    ::core::option::Option<unsafe extern "win64" fn(This: *mut _EFI_PCI_IO,
                                                Width:
                                                    EFI_PCI_IO_PROTOCOL_WIDTH,
                                                Offset: UINT32, Count: UINTN,
                                                Buffer: *mut ::ctypes::c_void)
                               -> EFI_STATUS>;
#[repr(C)]

pub struct EFI_PCI_IO_PROTOCOL_CONFIG_ACCESS {
    pub Read: EFI_PCI_IO_PROTOCOL_CONFIG,
    pub Write: EFI_PCI_IO_PROTOCOL_CONFIG,
}
#[test]
fn bindgen_test_layout_EFI_PCI_IO_PROTOCOL_CONFIG_ACCESS() {
    assert_eq!(::core::mem::size_of::<EFI_PCI_IO_PROTOCOL_CONFIG_ACCESS>() ,
               16usize , concat ! (
               "Size of: " , stringify ! ( EFI_PCI_IO_PROTOCOL_CONFIG_ACCESS )
               ));
    assert_eq! (::core::mem::align_of::<EFI_PCI_IO_PROTOCOL_CONFIG_ACCESS>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! (
                EFI_PCI_IO_PROTOCOL_CONFIG_ACCESS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PCI_IO_PROTOCOL_CONFIG_ACCESS ) ) .
                Read as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PCI_IO_PROTOCOL_CONFIG_ACCESS ) , "::" , stringify ! (
                Read ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PCI_IO_PROTOCOL_CONFIG_ACCESS ) ) .
                Write as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PCI_IO_PROTOCOL_CONFIG_ACCESS ) , "::" , stringify ! (
                Write ) ));
}
impl Clone for EFI_PCI_IO_PROTOCOL_CONFIG_ACCESS {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type EFI_PCI_IO_PROTOCOL_COPY_MEM =
    ::core::option::Option<unsafe extern "win64" fn(This: *mut _EFI_PCI_IO,
                                                Width:
                                                    EFI_PCI_IO_PROTOCOL_WIDTH,
                                                DestBarIndex: UINT8,
                                                DestOffset: UINT64,
                                                SrcBarIndex: UINT8,
                                                SrcOffset: UINT64,
                                                Count: UINTN) -> EFI_STATUS>;
pub const EFI_PCI_IO_PROTOCOL_OPERATION_EfiPciIoOperationBusMasterRead:
          EFI_PCI_IO_PROTOCOL_OPERATION =
    0;
pub const EFI_PCI_IO_PROTOCOL_OPERATION_EfiPciIoOperationBusMasterWrite:
          EFI_PCI_IO_PROTOCOL_OPERATION =
    1;
pub const EFI_PCI_IO_PROTOCOL_OPERATION_EfiPciIoOperationBusMasterCommonBuffer:
          EFI_PCI_IO_PROTOCOL_OPERATION =
    2;
pub const EFI_PCI_IO_PROTOCOL_OPERATION_EfiPciIoOperationMaximum:
          EFI_PCI_IO_PROTOCOL_OPERATION =
    3;
pub type EFI_PCI_IO_PROTOCOL_OPERATION = ::ctypes::c_uint;
pub type EFI_PCI_IO_PROTOCOL_MAP =
    ::core::option::Option<unsafe extern "win64" fn(This: *mut _EFI_PCI_IO,
                                                Operation:
                                                    EFI_PCI_IO_PROTOCOL_OPERATION,
                                                HostAddress:
                                                    *mut ::ctypes::c_void,
                                                NumberOfBytes: *mut UINTN,
                                                DeviceAddress:
                                                    *mut EFI_PHYSICAL_ADDRESS,
                                                Mapping:
                                                    *mut *mut ::ctypes::c_void)
                               -> EFI_STATUS>;
pub type EFI_PCI_IO_PROTOCOL_UNMAP =
    ::core::option::Option<unsafe extern "win64" fn(This: *mut _EFI_PCI_IO,
                                                Mapping:
                                                    *mut ::ctypes::c_void)
                               -> EFI_STATUS>;
pub type EFI_PCI_IO_PROTOCOL_ALLOCATE_BUFFER =
    ::core::option::Option<unsafe extern "win64" fn(This: *mut _EFI_PCI_IO,
                                                Type: EFI_ALLOCATE_TYPE,
                                                MemoryType: EFI_MEMORY_TYPE,
                                                Pages: UINTN,
                                                HostAddress:
                                                    *mut *mut ::ctypes::c_void,
                                                Attributes: UINT64)
                               -> EFI_STATUS>;
pub type EFI_PCI_IO_PROTOCOL_FREE_BUFFER =
    ::core::option::Option<unsafe extern "win64" fn(This: *mut _EFI_PCI_IO,
                                                Pages: UINTN,
                                                HostAddress:
                                                    *mut ::ctypes::c_void)
                               -> EFI_STATUS>;
pub type EFI_PCI_IO_PROTOCOL_FLUSH =
    ::core::option::Option<unsafe extern "win64" fn(This: *mut _EFI_PCI_IO)
                               -> EFI_STATUS>;
pub type EFI_PCI_IO_PROTOCOL_GET_LOCATION =
    ::core::option::Option<unsafe extern "win64" fn(This: *mut _EFI_PCI_IO,
                                                SegmentNumber: *mut UINTN,
                                                BusNumber: *mut UINTN,
                                                DeviceNumber: *mut UINTN,
                                                FunctionNumber: *mut UINTN)
                               -> EFI_STATUS>;
pub const EFI_PCI_IO_PROTOCOL_ATTRIBUTE_OPERATION_EfiPciIoAttributeOperationGet:
          EFI_PCI_IO_PROTOCOL_ATTRIBUTE_OPERATION =
    0;
pub const EFI_PCI_IO_PROTOCOL_ATTRIBUTE_OPERATION_EfiPciIoAttributeOperationSet:
          EFI_PCI_IO_PROTOCOL_ATTRIBUTE_OPERATION =
    1;
pub const EFI_PCI_IO_PROTOCOL_ATTRIBUTE_OPERATION_EfiPciIoAttributeOperationEnable:
          EFI_PCI_IO_PROTOCOL_ATTRIBUTE_OPERATION =
    2;
pub const EFI_PCI_IO_PROTOCOL_ATTRIBUTE_OPERATION_EfiPciIoAttributeOperationDisable:
          EFI_PCI_IO_PROTOCOL_ATTRIBUTE_OPERATION =
    3;
pub const EFI_PCI_IO_PROTOCOL_ATTRIBUTE_OPERATION_EfiPciIoAttributeOperationSupported:
          EFI_PCI_IO_PROTOCOL_ATTRIBUTE_OPERATION =
    4;
pub const EFI_PCI_IO_PROTOCOL_ATTRIBUTE_OPERATION_EfiPciIoAttributeOperationMaximum:
          EFI_PCI_IO_PROTOCOL_ATTRIBUTE_OPERATION =
    5;
pub type EFI_PCI_IO_PROTOCOL_ATTRIBUTE_OPERATION = ::ctypes::c_uint;
pub type EFI_PCI_IO_PROTOCOL_ATTRIBUTES =
    ::core::option::Option<unsafe extern "win64" fn(This: *mut _EFI_PCI_IO,
                                                Operation:
                                                    EFI_PCI_IO_PROTOCOL_ATTRIBUTE_OPERATION,
                                                Attributes: UINT64,
                                                Result: *mut UINT64)
                               -> EFI_STATUS>;
pub type EFI_PCI_IO_PROTOCOL_GET_BAR_ATTRIBUTES =
    ::core::option::Option<unsafe extern "win64" fn(This: *mut _EFI_PCI_IO,
                                                BarIndex: UINT8,
                                                Supports: *mut UINT64,
                                                Resources:
                                                    *mut *mut ::ctypes::c_void)
                               -> EFI_STATUS>;
pub type EFI_PCI_IO_PROTOCOL_SET_BAR_ATTRIBUTES =
    ::core::option::Option<unsafe extern "win64" fn(This: *mut _EFI_PCI_IO,
                                                Attributes: UINT64,
                                                BarIndex: UINT8,
                                                Offset: *mut UINT64,
                                                Length: *mut UINT64)
                               -> EFI_STATUS>;
pub type EFI_PCI_IO = _EFI_PCI_IO;
#[repr(C)]

pub struct _EFI_BLOCK_IO {
    pub Revision: UINT64,
    pub Media: *mut EFI_BLOCK_IO_MEDIA,
    pub Reset: EFI_BLOCK_RESET,
    pub ReadBlocks: EFI_BLOCK_READ,
    pub WriteBlocks: EFI_BLOCK_WRITE,
    pub FlushBlocks: EFI_BLOCK_FLUSH,
}
#[test]
fn bindgen_test_layout__EFI_BLOCK_IO() {
    assert_eq!(::core::mem::size_of::<_EFI_BLOCK_IO>() , 48usize , concat ! (
               "Size of: " , stringify ! ( _EFI_BLOCK_IO ) ));
    assert_eq! (::core::mem::align_of::<_EFI_BLOCK_IO>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( _EFI_BLOCK_IO ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_BLOCK_IO ) ) . Revision as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_BLOCK_IO ) , "::"
                , stringify ! ( Revision ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_BLOCK_IO ) ) . Media as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_BLOCK_IO ) , "::"
                , stringify ! ( Media ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_BLOCK_IO ) ) . Reset as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_BLOCK_IO ) , "::"
                , stringify ! ( Reset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_BLOCK_IO ) ) . ReadBlocks as * const
                _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_BLOCK_IO ) , "::"
                , stringify ! ( ReadBlocks ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_BLOCK_IO ) ) . WriteBlocks as *
                const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_BLOCK_IO ) , "::"
                , stringify ! ( WriteBlocks ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_BLOCK_IO ) ) . FlushBlocks as *
                const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_BLOCK_IO ) , "::"
                , stringify ! ( FlushBlocks ) ));
}
impl Clone for _EFI_BLOCK_IO {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type EFI_BLOCK_RESET =
    ::core::option::Option<unsafe extern "win64" fn(This: *mut _EFI_BLOCK_IO,
                                                ExtendedVerification: BOOLEAN)
                               -> EFI_STATUS>;
pub type EFI_BLOCK_READ =
    ::core::option::Option<unsafe extern "win64" fn(This: *mut _EFI_BLOCK_IO,
                                                MediaId: UINT32, LBA: EFI_LBA,
                                                BufferSize: UINTN,
                                                Buffer: *mut ::ctypes::c_void)
                               -> EFI_STATUS>;
pub type EFI_BLOCK_WRITE =
    ::core::option::Option<unsafe extern "win64" fn(This: *mut _EFI_BLOCK_IO,
                                                MediaId: UINT32, LBA: EFI_LBA,
                                                BufferSize: UINTN,
                                                Buffer: *mut ::ctypes::c_void)
                               -> EFI_STATUS>;
pub type EFI_BLOCK_FLUSH =
    ::core::option::Option<unsafe extern "win64" fn(This: *mut _EFI_BLOCK_IO)
                               -> EFI_STATUS>;
#[repr(C)]

pub struct EFI_BLOCK_IO_MEDIA {
    pub MediaId: UINT32,
    pub RemovableMedia: BOOLEAN,
    pub MediaPresent: BOOLEAN,
    pub LogicalPartition: BOOLEAN,
    pub ReadOnly: BOOLEAN,
    pub WriteCaching: BOOLEAN,
    pub BlockSize: UINT32,
    pub IoAlign: UINT32,
    pub LastBlock: EFI_LBA,
    pub LowestAlignedLba: EFI_LBA,
    pub LogicalBlocksPerPhysicalBlock: UINT32,
    pub OptimalTransferLengthGranularity: UINT32,
}
#[test]
fn bindgen_test_layout_EFI_BLOCK_IO_MEDIA() {
    assert_eq!(::core::mem::size_of::<EFI_BLOCK_IO_MEDIA>() , 48usize , concat
               ! ( "Size of: " , stringify ! ( EFI_BLOCK_IO_MEDIA ) ));
    assert_eq! (::core::mem::align_of::<EFI_BLOCK_IO_MEDIA>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( EFI_BLOCK_IO_MEDIA ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_BLOCK_IO_MEDIA ) ) . MediaId as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_BLOCK_IO_MEDIA ) ,
                "::" , stringify ! ( MediaId ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_BLOCK_IO_MEDIA ) ) . RemovableMedia
                as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_BLOCK_IO_MEDIA ) ,
                "::" , stringify ! ( RemovableMedia ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_BLOCK_IO_MEDIA ) ) . MediaPresent as
                * const _ as usize } , 5usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_BLOCK_IO_MEDIA ) ,
                "::" , stringify ! ( MediaPresent ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_BLOCK_IO_MEDIA ) ) . LogicalPartition
                as * const _ as usize } , 6usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_BLOCK_IO_MEDIA ) ,
                "::" , stringify ! ( LogicalPartition ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_BLOCK_IO_MEDIA ) ) . ReadOnly as *
                const _ as usize } , 7usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_BLOCK_IO_MEDIA ) ,
                "::" , stringify ! ( ReadOnly ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_BLOCK_IO_MEDIA ) ) . WriteCaching as
                * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_BLOCK_IO_MEDIA ) ,
                "::" , stringify ! ( WriteCaching ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_BLOCK_IO_MEDIA ) ) . BlockSize as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_BLOCK_IO_MEDIA ) ,
                "::" , stringify ! ( BlockSize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_BLOCK_IO_MEDIA ) ) . IoAlign as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_BLOCK_IO_MEDIA ) ,
                "::" , stringify ! ( IoAlign ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_BLOCK_IO_MEDIA ) ) . LastBlock as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_BLOCK_IO_MEDIA ) ,
                "::" , stringify ! ( LastBlock ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_BLOCK_IO_MEDIA ) ) . LowestAlignedLba
                as * const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_BLOCK_IO_MEDIA ) ,
                "::" , stringify ! ( LowestAlignedLba ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_BLOCK_IO_MEDIA ) ) .
                LogicalBlocksPerPhysicalBlock as * const _ as usize } ,
                40usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_BLOCK_IO_MEDIA ) ,
                "::" , stringify ! ( LogicalBlocksPerPhysicalBlock ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_BLOCK_IO_MEDIA ) ) .
                OptimalTransferLengthGranularity as * const _ as usize } ,
                44usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_BLOCK_IO_MEDIA ) ,
                "::" , stringify ! ( OptimalTransferLengthGranularity ) ));
}
impl Clone for EFI_BLOCK_IO_MEDIA {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type EFI_BLOCK_IO = _EFI_BLOCK_IO;
#[repr(C)]

pub struct _EFI_DISK_IO {
    pub Revision: UINT64,
    pub ReadDisk: EFI_DISK_READ,
    pub WriteDisk: EFI_DISK_WRITE,
}
#[test]
fn bindgen_test_layout__EFI_DISK_IO() {
    assert_eq!(::core::mem::size_of::<_EFI_DISK_IO>() , 24usize , concat ! (
               "Size of: " , stringify ! ( _EFI_DISK_IO ) ));
    assert_eq! (::core::mem::align_of::<_EFI_DISK_IO>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( _EFI_DISK_IO ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_DISK_IO ) ) . Revision as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_DISK_IO ) , "::" ,
                stringify ! ( Revision ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_DISK_IO ) ) . ReadDisk as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_DISK_IO ) , "::" ,
                stringify ! ( ReadDisk ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_DISK_IO ) ) . WriteDisk as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_DISK_IO ) , "::" ,
                stringify ! ( WriteDisk ) ));
}
impl Clone for _EFI_DISK_IO {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type EFI_DISK_READ =
    ::core::option::Option<unsafe extern "win64" fn(This: *mut _EFI_DISK_IO,
                                                MediaId: UINT32,
                                                Offset: UINT64,
                                                BufferSize: UINTN,
                                                Buffer: *mut ::ctypes::c_void)
                               -> EFI_STATUS>;
pub type EFI_DISK_WRITE =
    ::core::option::Option<unsafe extern "win64" fn(This: *mut _EFI_DISK_IO,
                                                MediaId: UINT32,
                                                Offset: UINT64,
                                                BufferSize: UINTN,
                                                Buffer: *mut ::ctypes::c_void)
                               -> EFI_STATUS>;
pub type EFI_DISK_IO = _EFI_DISK_IO;
#[repr(C)]

pub struct _EFI_FILE_IO_INTERFACE {
    pub Revision: UINT64,
    pub OpenVolume: EFI_VOLUME_OPEN,
}
#[test]
fn bindgen_test_layout__EFI_FILE_IO_INTERFACE() {
    assert_eq!(::core::mem::size_of::<_EFI_FILE_IO_INTERFACE>() , 16usize ,
               concat ! ( "Size of: " , stringify ! ( _EFI_FILE_IO_INTERFACE )
               ));
    assert_eq! (::core::mem::align_of::<_EFI_FILE_IO_INTERFACE>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( _EFI_FILE_IO_INTERFACE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_FILE_IO_INTERFACE ) ) . Revision as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_FILE_IO_INTERFACE
                ) , "::" , stringify ! ( Revision ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_FILE_IO_INTERFACE ) ) . OpenVolume
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_FILE_IO_INTERFACE
                ) , "::" , stringify ! ( OpenVolume ) ));
}
impl Clone for _EFI_FILE_IO_INTERFACE {
    fn clone(&self) -> Self { unimplemented!() }
}
#[repr(C)]

pub struct _EFI_FILE_HANDLE {
    pub Revision: UINT64,
    pub Open: EFI_FILE_OPEN,
    pub Close: EFI_FILE_CLOSE,
    pub Delete: EFI_FILE_DELETE,
    pub Read: EFI_FILE_READ,
    pub Write: EFI_FILE_WRITE,
    pub GetPosition: EFI_FILE_GET_POSITION,
    pub SetPosition: EFI_FILE_SET_POSITION,
    pub GetInfo: EFI_FILE_GET_INFO,
    pub SetInfo: EFI_FILE_SET_INFO,
    pub Flush: EFI_FILE_FLUSH,
}
#[test]
fn bindgen_test_layout__EFI_FILE_HANDLE() {
    assert_eq!(::core::mem::size_of::<_EFI_FILE_HANDLE>() , 88usize , concat !
               ( "Size of: " , stringify ! ( _EFI_FILE_HANDLE ) ));
    assert_eq! (::core::mem::align_of::<_EFI_FILE_HANDLE>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( _EFI_FILE_HANDLE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_FILE_HANDLE ) ) . Revision as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_FILE_HANDLE ) ,
                "::" , stringify ! ( Revision ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_FILE_HANDLE ) ) . Open as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_FILE_HANDLE ) ,
                "::" , stringify ! ( Open ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_FILE_HANDLE ) ) . Close as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_FILE_HANDLE ) ,
                "::" , stringify ! ( Close ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_FILE_HANDLE ) ) . Delete as * const
                _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_FILE_HANDLE ) ,
                "::" , stringify ! ( Delete ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_FILE_HANDLE ) ) . Read as * const _
                as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_FILE_HANDLE ) ,
                "::" , stringify ! ( Read ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_FILE_HANDLE ) ) . Write as * const _
                as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_FILE_HANDLE ) ,
                "::" , stringify ! ( Write ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_FILE_HANDLE ) ) . GetPosition as *
                const _ as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_FILE_HANDLE ) ,
                "::" , stringify ! ( GetPosition ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_FILE_HANDLE ) ) . SetPosition as *
                const _ as usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_FILE_HANDLE ) ,
                "::" , stringify ! ( SetPosition ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_FILE_HANDLE ) ) . GetInfo as * const
                _ as usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_FILE_HANDLE ) ,
                "::" , stringify ! ( GetInfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_FILE_HANDLE ) ) . SetInfo as * const
                _ as usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_FILE_HANDLE ) ,
                "::" , stringify ! ( SetInfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_FILE_HANDLE ) ) . Flush as * const _
                as usize } , 80usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_FILE_HANDLE ) ,
                "::" , stringify ! ( Flush ) ));
}
impl Clone for _EFI_FILE_HANDLE {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type EFI_VOLUME_OPEN =
    ::core::option::Option<unsafe extern "win64" fn(This:
                                                    *mut _EFI_FILE_IO_INTERFACE,
                                                Root:
                                                    *mut *mut _EFI_FILE_HANDLE)
                               -> EFI_STATUS>;
pub type EFI_FILE_IO_INTERFACE = _EFI_FILE_IO_INTERFACE;
pub type EFI_FILE_OPEN =
    ::core::option::Option<unsafe extern "win64" fn(File: *mut _EFI_FILE_HANDLE,
                                                NewHandle:
                                                    *mut *mut _EFI_FILE_HANDLE,
                                                FileName: *mut CHAR16,
                                                OpenMode: UINT64,
                                                Attributes: UINT64)
                               -> EFI_STATUS>;
pub type EFI_FILE_CLOSE =
    ::core::option::Option<unsafe extern "win64" fn(File: *mut _EFI_FILE_HANDLE)
                               -> EFI_STATUS>;
pub type EFI_FILE_DELETE =
    ::core::option::Option<unsafe extern "win64" fn(File: *mut _EFI_FILE_HANDLE)
                               -> EFI_STATUS>;
pub type EFI_FILE_READ =
    ::core::option::Option<unsafe extern "win64" fn(File: *mut _EFI_FILE_HANDLE,
                                                BufferSize: *mut UINTN,
                                                Buffer: *mut ::ctypes::c_void)
                               -> EFI_STATUS>;
pub type EFI_FILE_WRITE =
    ::core::option::Option<unsafe extern "win64" fn(File: *mut _EFI_FILE_HANDLE,
                                                BufferSize: *mut UINTN,
                                                Buffer: *mut ::ctypes::c_void)
                               -> EFI_STATUS>;
pub type EFI_FILE_SET_POSITION =
    ::core::option::Option<unsafe extern "win64" fn(File: *mut _EFI_FILE_HANDLE,
                                                Position: UINT64)
                               -> EFI_STATUS>;
pub type EFI_FILE_GET_POSITION =
    ::core::option::Option<unsafe extern "win64" fn(File: *mut _EFI_FILE_HANDLE,
                                                Position: *mut UINT64)
                               -> EFI_STATUS>;
pub type EFI_FILE_GET_INFO =
    ::core::option::Option<unsafe extern "win64" fn(File: *mut _EFI_FILE_HANDLE,
                                                InformationType:
                                                    *mut EFI_GUID,
                                                BufferSize: *mut UINTN,
                                                Buffer: *mut ::ctypes::c_void)
                               -> EFI_STATUS>;
pub type EFI_FILE_SET_INFO =
    ::core::option::Option<unsafe extern "win64" fn(File: *mut _EFI_FILE_HANDLE,
                                                InformationType:
                                                    *mut EFI_GUID,
                                                BufferSize: UINTN,
                                                Buffer: *mut ::ctypes::c_void)
                               -> EFI_STATUS>;
pub type EFI_FILE_FLUSH =
    ::core::option::Option<unsafe extern "win64" fn(File: *mut _EFI_FILE_HANDLE)
                               -> EFI_STATUS>;
pub type EFI_FILE = _EFI_FILE_HANDLE;
pub type EFI_FILE_HANDLE = *mut _EFI_FILE_HANDLE;
#[repr(C)]

pub struct EFI_FILE_INFO {
    pub Size: UINT64,
    pub FileSize: UINT64,
    pub PhysicalSize: UINT64,
    pub CreateTime: EFI_TIME,
    pub LastAccessTime: EFI_TIME,
    pub ModificationTime: EFI_TIME,
    pub Attribute: UINT64,
    pub FileName: [CHAR16; 1usize],
}
#[test]
fn bindgen_test_layout_EFI_FILE_INFO() {
    assert_eq!(::core::mem::size_of::<EFI_FILE_INFO>() , 88usize , concat ! (
               "Size of: " , stringify ! ( EFI_FILE_INFO ) ));
    assert_eq! (::core::mem::align_of::<EFI_FILE_INFO>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( EFI_FILE_INFO ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_FILE_INFO ) ) . Size as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_FILE_INFO ) , "::"
                , stringify ! ( Size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_FILE_INFO ) ) . FileSize as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_FILE_INFO ) , "::"
                , stringify ! ( FileSize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_FILE_INFO ) ) . PhysicalSize as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_FILE_INFO ) , "::"
                , stringify ! ( PhysicalSize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_FILE_INFO ) ) . CreateTime as * const
                _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_FILE_INFO ) , "::"
                , stringify ! ( CreateTime ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_FILE_INFO ) ) . LastAccessTime as *
                const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_FILE_INFO ) , "::"
                , stringify ! ( LastAccessTime ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_FILE_INFO ) ) . ModificationTime as *
                const _ as usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_FILE_INFO ) , "::"
                , stringify ! ( ModificationTime ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_FILE_INFO ) ) . Attribute as * const
                _ as usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_FILE_INFO ) , "::"
                , stringify ! ( Attribute ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_FILE_INFO ) ) . FileName as * const _
                as usize } , 80usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_FILE_INFO ) , "::"
                , stringify ! ( FileName ) ));
}
impl Clone for EFI_FILE_INFO {
    fn clone(&self) -> Self { unimplemented!() }
}
#[repr(C)]

pub struct EFI_FILE_SYSTEM_INFO {
    pub Size: UINT64,
    pub ReadOnly: BOOLEAN,
    pub VolumeSize: UINT64,
    pub FreeSpace: UINT64,
    pub BlockSize: UINT32,
    pub VolumeLabel: [CHAR16; 1usize],
}
#[test]
fn bindgen_test_layout_EFI_FILE_SYSTEM_INFO() {
    assert_eq!(::core::mem::size_of::<EFI_FILE_SYSTEM_INFO>() , 40usize ,
               concat ! ( "Size of: " , stringify ! ( EFI_FILE_SYSTEM_INFO )
               ));
    assert_eq! (::core::mem::align_of::<EFI_FILE_SYSTEM_INFO>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( EFI_FILE_SYSTEM_INFO ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_FILE_SYSTEM_INFO ) ) . Size as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_FILE_SYSTEM_INFO )
                , "::" , stringify ! ( Size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_FILE_SYSTEM_INFO ) ) . ReadOnly as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_FILE_SYSTEM_INFO )
                , "::" , stringify ! ( ReadOnly ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_FILE_SYSTEM_INFO ) ) . VolumeSize as
                * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_FILE_SYSTEM_INFO )
                , "::" , stringify ! ( VolumeSize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_FILE_SYSTEM_INFO ) ) . FreeSpace as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_FILE_SYSTEM_INFO )
                , "::" , stringify ! ( FreeSpace ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_FILE_SYSTEM_INFO ) ) . BlockSize as *
                const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_FILE_SYSTEM_INFO )
                , "::" , stringify ! ( BlockSize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_FILE_SYSTEM_INFO ) ) . VolumeLabel as
                * const _ as usize } , 36usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_FILE_SYSTEM_INFO )
                , "::" , stringify ! ( VolumeLabel ) ));
}
impl Clone for EFI_FILE_SYSTEM_INFO {
    fn clone(&self) -> Self { unimplemented!() }
}
#[repr(C)]

pub struct EFI_FILE_SYSTEM_VOLUME_LABEL_INFO {
    pub VolumeLabel: [CHAR16; 1usize],
}
#[test]
fn bindgen_test_layout_EFI_FILE_SYSTEM_VOLUME_LABEL_INFO() {
    assert_eq!(::core::mem::size_of::<EFI_FILE_SYSTEM_VOLUME_LABEL_INFO>() ,
               2usize , concat ! (
               "Size of: " , stringify ! ( EFI_FILE_SYSTEM_VOLUME_LABEL_INFO )
               ));
    assert_eq! (::core::mem::align_of::<EFI_FILE_SYSTEM_VOLUME_LABEL_INFO>() ,
                2usize , concat ! (
                "Alignment of " , stringify ! (
                EFI_FILE_SYSTEM_VOLUME_LABEL_INFO ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_FILE_SYSTEM_VOLUME_LABEL_INFO ) ) .
                VolumeLabel as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_FILE_SYSTEM_VOLUME_LABEL_INFO ) , "::" , stringify ! (
                VolumeLabel ) ));
}
impl Clone for EFI_FILE_SYSTEM_VOLUME_LABEL_INFO {
    fn clone(&self) -> Self { unimplemented!() }
}
#[repr(C)]

pub struct _EFI_LOAD_FILE_INTERFACE {
    pub LoadFile: EFI_LOAD_FILE,
}
#[test]
fn bindgen_test_layout__EFI_LOAD_FILE_INTERFACE() {
    assert_eq!(::core::mem::size_of::<_EFI_LOAD_FILE_INTERFACE>() , 8usize ,
               concat ! (
               "Size of: " , stringify ! ( _EFI_LOAD_FILE_INTERFACE ) ));
    assert_eq! (::core::mem::align_of::<_EFI_LOAD_FILE_INTERFACE>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( _EFI_LOAD_FILE_INTERFACE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_LOAD_FILE_INTERFACE ) ) . LoadFile
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                _EFI_LOAD_FILE_INTERFACE ) , "::" , stringify ! ( LoadFile )
                ));
}
impl Clone for _EFI_LOAD_FILE_INTERFACE {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type EFI_LOAD_FILE =
    ::core::option::Option<unsafe extern "win64" fn(This:
                                                    *mut _EFI_LOAD_FILE_INTERFACE,
                                                FilePath:
                                                    *mut EFI_DEVICE_PATH,
                                                BootPolicy: BOOLEAN,
                                                BufferSize: *mut UINTN,
                                                Buffer: *mut ::ctypes::c_void)
                               -> EFI_STATUS>;
pub type EFI_LOAD_FILE_INTERFACE = _EFI_LOAD_FILE_INTERFACE;
#[repr(C)]

pub struct _EFI_DEVICE_IO_INTERFACE {
    pub Mem: EFI_IO_ACCESS,
    pub Io: EFI_IO_ACCESS,
    pub Pci: EFI_IO_ACCESS,
    pub Map: EFI_IO_MAP,
    pub PciDevicePath: EFI_PCI_DEVICE_PATH,
    pub Unmap: EFI_IO_UNMAP,
    pub AllocateBuffer: EFI_IO_ALLOCATE_BUFFER,
    pub Flush: EFI_IO_FLUSH,
    pub FreeBuffer: EFI_IO_FREE_BUFFER,
}
#[test]
fn bindgen_test_layout__EFI_DEVICE_IO_INTERFACE() {
    assert_eq!(::core::mem::size_of::<_EFI_DEVICE_IO_INTERFACE>() , 96usize ,
               concat ! (
               "Size of: " , stringify ! ( _EFI_DEVICE_IO_INTERFACE ) ));
    assert_eq! (::core::mem::align_of::<_EFI_DEVICE_IO_INTERFACE>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( _EFI_DEVICE_IO_INTERFACE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_DEVICE_IO_INTERFACE ) ) . Mem as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                _EFI_DEVICE_IO_INTERFACE ) , "::" , stringify ! ( Mem ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_DEVICE_IO_INTERFACE ) ) . Io as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                _EFI_DEVICE_IO_INTERFACE ) , "::" , stringify ! ( Io ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_DEVICE_IO_INTERFACE ) ) . Pci as *
                const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! (
                _EFI_DEVICE_IO_INTERFACE ) , "::" , stringify ! ( Pci ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_DEVICE_IO_INTERFACE ) ) . Map as *
                const _ as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! (
                _EFI_DEVICE_IO_INTERFACE ) , "::" , stringify ! ( Map ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_DEVICE_IO_INTERFACE ) ) .
                PciDevicePath as * const _ as usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! (
                _EFI_DEVICE_IO_INTERFACE ) , "::" , stringify ! (
                PciDevicePath ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_DEVICE_IO_INTERFACE ) ) . Unmap as *
                const _ as usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! (
                _EFI_DEVICE_IO_INTERFACE ) , "::" , stringify ! ( Unmap ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_DEVICE_IO_INTERFACE ) ) .
                AllocateBuffer as * const _ as usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! (
                _EFI_DEVICE_IO_INTERFACE ) , "::" , stringify ! (
                AllocateBuffer ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_DEVICE_IO_INTERFACE ) ) . Flush as *
                const _ as usize } , 80usize , concat ! (
                "Alignment of field: " , stringify ! (
                _EFI_DEVICE_IO_INTERFACE ) , "::" , stringify ! ( Flush ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_DEVICE_IO_INTERFACE ) ) . FreeBuffer
                as * const _ as usize } , 88usize , concat ! (
                "Alignment of field: " , stringify ! (
                _EFI_DEVICE_IO_INTERFACE ) , "::" , stringify ! ( FreeBuffer )
                ));
}
impl Clone for _EFI_DEVICE_IO_INTERFACE {
    fn clone(&self) -> Self { unimplemented!() }
}
pub const EFI_IO_WIDTH_IO_UINT8: EFI_IO_WIDTH = 0;
pub const EFI_IO_WIDTH_IO_UINT16: EFI_IO_WIDTH = 1;
pub const EFI_IO_WIDTH_IO_UINT32: EFI_IO_WIDTH = 2;
pub const EFI_IO_WIDTH_IO_UINT64: EFI_IO_WIDTH = 3;
pub const EFI_IO_WIDTH_MMIO_COPY_UINT8: EFI_IO_WIDTH = 4;
pub const EFI_IO_WIDTH_MMIO_COPY_UINT16: EFI_IO_WIDTH = 5;
pub const EFI_IO_WIDTH_MMIO_COPY_UINT32: EFI_IO_WIDTH = 6;
pub const EFI_IO_WIDTH_MMIO_COPY_UINT64: EFI_IO_WIDTH = 7;
pub type EFI_IO_WIDTH = ::ctypes::c_uint;
pub type EFI_DEVICE_IO =
    ::core::option::Option<unsafe extern "win64" fn(This:
                                                    *mut _EFI_DEVICE_IO_INTERFACE,
                                                Width: EFI_IO_WIDTH,
                                                Address: UINT64, Count: UINTN,
                                                Buffer: *mut ::ctypes::c_void)
                               -> EFI_STATUS>;
#[repr(C)]

pub struct EFI_IO_ACCESS {
    pub Read: EFI_DEVICE_IO,
    pub Write: EFI_DEVICE_IO,
}
#[test]
fn bindgen_test_layout_EFI_IO_ACCESS() {
    assert_eq!(::core::mem::size_of::<EFI_IO_ACCESS>() , 16usize , concat ! (
               "Size of: " , stringify ! ( EFI_IO_ACCESS ) ));
    assert_eq! (::core::mem::align_of::<EFI_IO_ACCESS>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( EFI_IO_ACCESS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_IO_ACCESS ) ) . Read as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_IO_ACCESS ) , "::"
                , stringify ! ( Read ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_IO_ACCESS ) ) . Write as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_IO_ACCESS ) , "::"
                , stringify ! ( Write ) ));
}
impl Clone for EFI_IO_ACCESS {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type EFI_PCI_DEVICE_PATH =
    ::core::option::Option<unsafe extern "win64" fn(This:
                                                    *mut _EFI_DEVICE_IO_INTERFACE,
                                                Address: UINT64,
                                                PciDevicePath:
                                                    *mut *mut EFI_DEVICE_PATH)
                               -> EFI_STATUS>;
pub const EFI_IO_OPERATION_TYPE_EfiBusMasterRead: EFI_IO_OPERATION_TYPE = 0;
pub const EFI_IO_OPERATION_TYPE_EfiBusMasterWrite: EFI_IO_OPERATION_TYPE = 1;
pub const EFI_IO_OPERATION_TYPE_EfiBusMasterCommonBuffer:
          EFI_IO_OPERATION_TYPE =
    2;
pub type EFI_IO_OPERATION_TYPE = ::ctypes::c_uint;
pub type EFI_IO_MAP =
    ::core::option::Option<unsafe extern "win64" fn(This:
                                                    *mut _EFI_DEVICE_IO_INTERFACE,
                                                Operation:
                                                    EFI_IO_OPERATION_TYPE,
                                                HostAddress:
                                                    *mut EFI_PHYSICAL_ADDRESS,
                                                NumberOfBytes: *mut UINTN,
                                                DeviceAddress:
                                                    *mut EFI_PHYSICAL_ADDRESS,
                                                Mapping:
                                                    *mut *mut ::ctypes::c_void)
                               -> EFI_STATUS>;
pub type EFI_IO_UNMAP =
    ::core::option::Option<unsafe extern "win64" fn(This:
                                                    *mut _EFI_DEVICE_IO_INTERFACE,
                                                Mapping:
                                                    *mut ::ctypes::c_void)
                               -> EFI_STATUS>;
pub type EFI_IO_ALLOCATE_BUFFER =
    ::core::option::Option<unsafe extern "win64" fn(This:
                                                    *mut _EFI_DEVICE_IO_INTERFACE,
                                                Type: EFI_ALLOCATE_TYPE,
                                                MemoryType: EFI_MEMORY_TYPE,
                                                Pages: UINTN,
                                                HostAddress:
                                                    *mut EFI_PHYSICAL_ADDRESS)
                               -> EFI_STATUS>;
pub type EFI_IO_FLUSH =
    ::core::option::Option<unsafe extern "win64" fn(This:
                                                    *mut _EFI_DEVICE_IO_INTERFACE)
                               -> EFI_STATUS>;
pub type EFI_IO_FREE_BUFFER =
    ::core::option::Option<unsafe extern "win64" fn(This:
                                                    *mut _EFI_DEVICE_IO_INTERFACE,
                                                Pages: UINTN,
                                                HostAddress:
                                                    EFI_PHYSICAL_ADDRESS)
                               -> EFI_STATUS>;
pub type EFI_DEVICE_IO_INTERFACE = _EFI_DEVICE_IO_INTERFACE;
#[repr(C)]

pub struct _EFI_UNICODE_COLLATION_INTERFACE {
    pub StriColl: EFI_UNICODE_STRICOLL,
    pub MetaiMatch: EFI_UNICODE_METAIMATCH,
    pub StrLwr: EFI_UNICODE_STRLWR,
    pub StrUpr: EFI_UNICODE_STRUPR,
    pub FatToStr: EFI_UNICODE_FATTOSTR,
    pub StrToFat: EFI_UNICODE_STRTOFAT,
    pub SupportedLanguages: *mut CHAR8,
}
#[test]
fn bindgen_test_layout__EFI_UNICODE_COLLATION_INTERFACE() {
    assert_eq!(::core::mem::size_of::<_EFI_UNICODE_COLLATION_INTERFACE>() ,
               56usize , concat ! (
               "Size of: " , stringify ! ( _EFI_UNICODE_COLLATION_INTERFACE )
               ));
    assert_eq! (::core::mem::align_of::<_EFI_UNICODE_COLLATION_INTERFACE>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! (
                _EFI_UNICODE_COLLATION_INTERFACE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_UNICODE_COLLATION_INTERFACE ) ) .
                StriColl as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                _EFI_UNICODE_COLLATION_INTERFACE ) , "::" , stringify ! (
                StriColl ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_UNICODE_COLLATION_INTERFACE ) ) .
                MetaiMatch as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                _EFI_UNICODE_COLLATION_INTERFACE ) , "::" , stringify ! (
                MetaiMatch ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_UNICODE_COLLATION_INTERFACE ) ) .
                StrLwr as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                _EFI_UNICODE_COLLATION_INTERFACE ) , "::" , stringify ! (
                StrLwr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_UNICODE_COLLATION_INTERFACE ) ) .
                StrUpr as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! (
                _EFI_UNICODE_COLLATION_INTERFACE ) , "::" , stringify ! (
                StrUpr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_UNICODE_COLLATION_INTERFACE ) ) .
                FatToStr as * const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! (
                _EFI_UNICODE_COLLATION_INTERFACE ) , "::" , stringify ! (
                FatToStr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_UNICODE_COLLATION_INTERFACE ) ) .
                StrToFat as * const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! (
                _EFI_UNICODE_COLLATION_INTERFACE ) , "::" , stringify ! (
                StrToFat ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_UNICODE_COLLATION_INTERFACE ) ) .
                SupportedLanguages as * const _ as usize } , 48usize , concat
                ! (
                "Alignment of field: " , stringify ! (
                _EFI_UNICODE_COLLATION_INTERFACE ) , "::" , stringify ! (
                SupportedLanguages ) ));
}
impl Clone for _EFI_UNICODE_COLLATION_INTERFACE {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type EFI_UNICODE_STRICOLL =
    ::core::option::Option<unsafe extern "win64" fn(This:
                                                    *mut _EFI_UNICODE_COLLATION_INTERFACE,
                                                s1: *mut CHAR16,
                                                s2: *mut CHAR16) -> INTN>;
pub type EFI_UNICODE_METAIMATCH =
    ::core::option::Option<unsafe extern "win64" fn(This:
                                                    *mut _EFI_UNICODE_COLLATION_INTERFACE,
                                                String: *mut CHAR16,
                                                Pattern: *mut CHAR16)
                               -> BOOLEAN>;
pub type EFI_UNICODE_STRLWR =
    ::core::option::Option<unsafe extern "win64" fn(This:
                                                    *mut _EFI_UNICODE_COLLATION_INTERFACE,
                                                Str: *mut CHAR16)>;
pub type EFI_UNICODE_STRUPR =
    ::core::option::Option<unsafe extern "win64" fn(This:
                                                    *mut _EFI_UNICODE_COLLATION_INTERFACE,
                                                Str: *mut CHAR16)>;
pub type EFI_UNICODE_FATTOSTR =
    ::core::option::Option<unsafe extern "win64" fn(This:
                                                    *mut _EFI_UNICODE_COLLATION_INTERFACE,
                                                FatSize: UINTN,
                                                Fat: *mut CHAR8,
                                                String: *mut CHAR16)>;
pub type EFI_UNICODE_STRTOFAT =
    ::core::option::Option<unsafe extern "win64" fn(This:
                                                    *mut _EFI_UNICODE_COLLATION_INTERFACE,
                                                String: *mut CHAR16,
                                                FatSize: UINTN,
                                                Fat: *mut CHAR8) -> BOOLEAN>;
pub type EFI_UNICODE_COLLATION_INTERFACE = _EFI_UNICODE_COLLATION_INTERFACE;
#[repr(C)]

pub struct _EFI_GRAPHICS_OUTPUT_PROTOCOL {
    pub QueryMode: EFI_GRAPHICS_OUTPUT_PROTOCOL_QUERY_MODE,
    pub SetMode: EFI_GRAPHICS_OUTPUT_PROTOCOL_SET_MODE,
    pub Blt: EFI_GRAPHICS_OUTPUT_PROTOCOL_BLT,
    pub Mode: *mut EFI_GRAPHICS_OUTPUT_PROTOCOL_MODE,
}
#[test]
fn bindgen_test_layout__EFI_GRAPHICS_OUTPUT_PROTOCOL() {
    assert_eq!(::core::mem::size_of::<_EFI_GRAPHICS_OUTPUT_PROTOCOL>() ,
               32usize , concat ! (
               "Size of: " , stringify ! ( _EFI_GRAPHICS_OUTPUT_PROTOCOL ) ));
    assert_eq! (::core::mem::align_of::<_EFI_GRAPHICS_OUTPUT_PROTOCOL>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! ( _EFI_GRAPHICS_OUTPUT_PROTOCOL
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_GRAPHICS_OUTPUT_PROTOCOL ) ) .
                QueryMode as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                _EFI_GRAPHICS_OUTPUT_PROTOCOL ) , "::" , stringify ! (
                QueryMode ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_GRAPHICS_OUTPUT_PROTOCOL ) ) .
                SetMode as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                _EFI_GRAPHICS_OUTPUT_PROTOCOL ) , "::" , stringify ! ( SetMode
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_GRAPHICS_OUTPUT_PROTOCOL ) ) . Blt
                as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                _EFI_GRAPHICS_OUTPUT_PROTOCOL ) , "::" , stringify ! ( Blt )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_GRAPHICS_OUTPUT_PROTOCOL ) ) . Mode
                as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! (
                _EFI_GRAPHICS_OUTPUT_PROTOCOL ) , "::" , stringify ! ( Mode )
                ));
}
impl Clone for _EFI_GRAPHICS_OUTPUT_PROTOCOL {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type EFI_GRAPHICS_OUTPUT_PROTOCOL = _EFI_GRAPHICS_OUTPUT_PROTOCOL;
#[repr(C)]

pub struct EFI_PIXEL_BITMASK {
    pub RedMask: UINT32,
    pub GreenMask: UINT32,
    pub BlueMask: UINT32,
    pub ReservedMask: UINT32,
}
#[test]
fn bindgen_test_layout_EFI_PIXEL_BITMASK() {
    assert_eq!(::core::mem::size_of::<EFI_PIXEL_BITMASK>() , 16usize , concat
               ! ( "Size of: " , stringify ! ( EFI_PIXEL_BITMASK ) ));
    assert_eq! (::core::mem::align_of::<EFI_PIXEL_BITMASK>() , 4usize , concat
                ! ( "Alignment of " , stringify ! ( EFI_PIXEL_BITMASK ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PIXEL_BITMASK ) ) . RedMask as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_PIXEL_BITMASK ) ,
                "::" , stringify ! ( RedMask ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PIXEL_BITMASK ) ) . GreenMask as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_PIXEL_BITMASK ) ,
                "::" , stringify ! ( GreenMask ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PIXEL_BITMASK ) ) . BlueMask as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_PIXEL_BITMASK ) ,
                "::" , stringify ! ( BlueMask ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PIXEL_BITMASK ) ) . ReservedMask as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_PIXEL_BITMASK ) ,
                "::" , stringify ! ( ReservedMask ) ));
}
impl Clone for EFI_PIXEL_BITMASK {
    fn clone(&self) -> Self { unimplemented!() }
}
pub const EFI_GRAPHICS_PIXEL_FORMAT_PixelRedGreenBlueReserved8BitPerColor:
          EFI_GRAPHICS_PIXEL_FORMAT =
    0;
pub const EFI_GRAPHICS_PIXEL_FORMAT_PixelBlueGreenRedReserved8BitPerColor:
          EFI_GRAPHICS_PIXEL_FORMAT =
    1;
pub const EFI_GRAPHICS_PIXEL_FORMAT_PixelBitMask: EFI_GRAPHICS_PIXEL_FORMAT =
    2;
pub const EFI_GRAPHICS_PIXEL_FORMAT_PixelBltOnly: EFI_GRAPHICS_PIXEL_FORMAT =
    3;
pub const EFI_GRAPHICS_PIXEL_FORMAT_PixelFormatMax: EFI_GRAPHICS_PIXEL_FORMAT
          =
    4;
pub type EFI_GRAPHICS_PIXEL_FORMAT = ::ctypes::c_uint;
#[repr(C)]

pub struct EFI_GRAPHICS_OUTPUT_MODE_INFORMATION {
    pub Version: UINT32,
    pub HorizontalResolution: UINT32,
    pub VerticalResolution: UINT32,
    pub PixelFormat: EFI_GRAPHICS_PIXEL_FORMAT,
    pub PixelInformation: EFI_PIXEL_BITMASK,
    pub PixelsPerScanLine: UINT32,
}
#[test]
fn bindgen_test_layout_EFI_GRAPHICS_OUTPUT_MODE_INFORMATION() {
    assert_eq!(::core::mem::size_of::<EFI_GRAPHICS_OUTPUT_MODE_INFORMATION>()
               , 36usize , concat ! (
               "Size of: " , stringify ! (
               EFI_GRAPHICS_OUTPUT_MODE_INFORMATION ) ));
    assert_eq! (::core::mem::align_of::<EFI_GRAPHICS_OUTPUT_MODE_INFORMATION>()
                , 4usize , concat ! (
                "Alignment of " , stringify ! (
                EFI_GRAPHICS_OUTPUT_MODE_INFORMATION ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_GRAPHICS_OUTPUT_MODE_INFORMATION ) )
                . Version as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_GRAPHICS_OUTPUT_MODE_INFORMATION ) , "::" , stringify ! (
                Version ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_GRAPHICS_OUTPUT_MODE_INFORMATION ) )
                . HorizontalResolution as * const _ as usize } , 4usize ,
                concat ! (
                "Alignment of field: " , stringify ! (
                EFI_GRAPHICS_OUTPUT_MODE_INFORMATION ) , "::" , stringify ! (
                HorizontalResolution ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_GRAPHICS_OUTPUT_MODE_INFORMATION ) )
                . VerticalResolution as * const _ as usize } , 8usize , concat
                ! (
                "Alignment of field: " , stringify ! (
                EFI_GRAPHICS_OUTPUT_MODE_INFORMATION ) , "::" , stringify ! (
                VerticalResolution ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_GRAPHICS_OUTPUT_MODE_INFORMATION ) )
                . PixelFormat as * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_GRAPHICS_OUTPUT_MODE_INFORMATION ) , "::" , stringify ! (
                PixelFormat ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_GRAPHICS_OUTPUT_MODE_INFORMATION ) )
                . PixelInformation as * const _ as usize } , 16usize , concat
                ! (
                "Alignment of field: " , stringify ! (
                EFI_GRAPHICS_OUTPUT_MODE_INFORMATION ) , "::" , stringify ! (
                PixelInformation ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_GRAPHICS_OUTPUT_MODE_INFORMATION ) )
                . PixelsPerScanLine as * const _ as usize } , 32usize , concat
                ! (
                "Alignment of field: " , stringify ! (
                EFI_GRAPHICS_OUTPUT_MODE_INFORMATION ) , "::" , stringify ! (
                PixelsPerScanLine ) ));
}
impl Clone for EFI_GRAPHICS_OUTPUT_MODE_INFORMATION {
    fn clone(&self) -> Self { unimplemented!() }
}
/**
  Return the current video mode information.

  @param  This       Protocol instance pointer.
  @param  ModeNumber The mode number to return information on.
  @param  SizeOfInfo A pointer to the size, in bytes, of the Info buffer.
  @param  Info       A pointer to callee allocated buffer that returns information about ModeNumber.

  @retval EFI_SUCCESS           Mode information returned.
  @retval EFI_BUFFER_TOO_SMALL  The Info buffer was too small.
  @retval EFI_DEVICE_ERROR      A hardware error occurred trying to retrieve the video mode.
  @retval EFI_NOT_STARTED       Video display is not initialized. Call SetMode ()
  @retval EFI_INVALID_PARAMETER One of the input args was NULL.

**/
pub type EFI_GRAPHICS_OUTPUT_PROTOCOL_QUERY_MODE =
    ::core::option::Option<unsafe extern "win64" fn(This:
                                                    *mut EFI_GRAPHICS_OUTPUT_PROTOCOL,
                                                ModeNumber: UINT32,
                                                SizeOfInfo: *mut UINTN,
                                                Info:
                                                    *mut *mut EFI_GRAPHICS_OUTPUT_MODE_INFORMATION)
                               -> EFI_STATUS>;
/**
  Return the current video mode information.

  @param  This              Protocol instance pointer.
  @param  ModeNumber        The mode number to be set.

  @retval EFI_SUCCESS       Graphics mode was changed.
  @retval EFI_DEVICE_ERROR  The device had an error and could not complete the request.
  @retval EFI_UNSUPPORTED   ModeNumber is not supported by this device.

**/
pub type EFI_GRAPHICS_OUTPUT_PROTOCOL_SET_MODE =
    ::core::option::Option<unsafe extern "win64" fn(This:
                                                    *mut EFI_GRAPHICS_OUTPUT_PROTOCOL,
                                                ModeNumber: UINT32)
                               -> EFI_STATUS>;
#[repr(C)]

pub struct EFI_GRAPHICS_OUTPUT_BLT_PIXEL {
    pub Blue: UINT8,
    pub Green: UINT8,
    pub Red: UINT8,
    pub Reserved: UINT8,
}
#[test]
fn bindgen_test_layout_EFI_GRAPHICS_OUTPUT_BLT_PIXEL() {
    assert_eq!(::core::mem::size_of::<EFI_GRAPHICS_OUTPUT_BLT_PIXEL>() ,
               4usize , concat ! (
               "Size of: " , stringify ! ( EFI_GRAPHICS_OUTPUT_BLT_PIXEL ) ));
    assert_eq! (::core::mem::align_of::<EFI_GRAPHICS_OUTPUT_BLT_PIXEL>() ,
                1usize , concat ! (
                "Alignment of " , stringify ! ( EFI_GRAPHICS_OUTPUT_BLT_PIXEL
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_GRAPHICS_OUTPUT_BLT_PIXEL ) ) . Blue
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_GRAPHICS_OUTPUT_BLT_PIXEL ) , "::" , stringify ! ( Blue )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_GRAPHICS_OUTPUT_BLT_PIXEL ) ) . Green
                as * const _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_GRAPHICS_OUTPUT_BLT_PIXEL ) , "::" , stringify ! ( Green )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_GRAPHICS_OUTPUT_BLT_PIXEL ) ) . Red
                as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_GRAPHICS_OUTPUT_BLT_PIXEL ) , "::" , stringify ! ( Red )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_GRAPHICS_OUTPUT_BLT_PIXEL ) ) .
                Reserved as * const _ as usize } , 3usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_GRAPHICS_OUTPUT_BLT_PIXEL ) , "::" , stringify ! (
                Reserved ) ));
}
impl Clone for EFI_GRAPHICS_OUTPUT_BLT_PIXEL {
    fn clone(&self) -> Self { unimplemented!() }
}
#[repr(C)]

pub union EFI_GRAPHICS_OUTPUT_BLT_PIXEL_UNION {
    pub Pixel: EFI_GRAPHICS_OUTPUT_BLT_PIXEL,
    pub Raw: UINT32,
}
#[test]
fn bindgen_test_layout_EFI_GRAPHICS_OUTPUT_BLT_PIXEL_UNION() {
    assert_eq!(::core::mem::size_of::<EFI_GRAPHICS_OUTPUT_BLT_PIXEL_UNION>() ,
               4usize , concat ! (
               "Size of: " , stringify ! ( EFI_GRAPHICS_OUTPUT_BLT_PIXEL_UNION
               ) ));
    assert_eq! (::core::mem::align_of::<EFI_GRAPHICS_OUTPUT_BLT_PIXEL_UNION>()
                , 4usize , concat ! (
                "Alignment of " , stringify ! (
                EFI_GRAPHICS_OUTPUT_BLT_PIXEL_UNION ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_GRAPHICS_OUTPUT_BLT_PIXEL_UNION ) ) .
                Pixel as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_GRAPHICS_OUTPUT_BLT_PIXEL_UNION ) , "::" , stringify ! (
                Pixel ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_GRAPHICS_OUTPUT_BLT_PIXEL_UNION ) ) .
                Raw as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_GRAPHICS_OUTPUT_BLT_PIXEL_UNION ) , "::" , stringify ! (
                Raw ) ));
}
impl Clone for EFI_GRAPHICS_OUTPUT_BLT_PIXEL_UNION {
    fn clone(&self) -> Self { unimplemented!() }
}
pub const EFI_GRAPHICS_OUTPUT_BLT_OPERATION_EfiBltVideoFill:
          EFI_GRAPHICS_OUTPUT_BLT_OPERATION =
    0;
pub const EFI_GRAPHICS_OUTPUT_BLT_OPERATION_EfiBltVideoToBltBuffer:
          EFI_GRAPHICS_OUTPUT_BLT_OPERATION =
    1;
pub const EFI_GRAPHICS_OUTPUT_BLT_OPERATION_EfiBltBufferToVideo:
          EFI_GRAPHICS_OUTPUT_BLT_OPERATION =
    2;
pub const EFI_GRAPHICS_OUTPUT_BLT_OPERATION_EfiBltVideoToVideo:
          EFI_GRAPHICS_OUTPUT_BLT_OPERATION =
    3;
pub const EFI_GRAPHICS_OUTPUT_BLT_OPERATION_EfiGraphicsOutputBltOperationMax:
          EFI_GRAPHICS_OUTPUT_BLT_OPERATION =
    4;
pub type EFI_GRAPHICS_OUTPUT_BLT_OPERATION = ::ctypes::c_uint;
/**
  The following table defines actions for BltOperations:

  <B>EfiBltVideoFill</B> - Write data from the  BltBuffer pixel (SourceX, SourceY) 
  directly to every pixel of the video display rectangle 
  (DestinationX, DestinationY) (DestinationX + Width, DestinationY + Height). 
  Only one pixel will be used from the BltBuffer. Delta is NOT used.

  <B>EfiBltVideoToBltBuffer</B> - Read data from the video display rectangle 
  (SourceX, SourceY) (SourceX + Width, SourceY + Height) and place it in 
  the BltBuffer rectangle (DestinationX, DestinationY ) 
  (DestinationX + Width, DestinationY + Height). If DestinationX or 
  DestinationY is not zero then Delta must be set to the length in bytes 
  of a row in the BltBuffer.

  <B>EfiBltBufferToVideo</B> - Write data from the  BltBuffer rectangle 
  (SourceX, SourceY) (SourceX + Width, SourceY + Height) directly to the 
  video display rectangle (DestinationX, DestinationY) 
  (DestinationX + Width, DestinationY + Height). If SourceX or SourceY is 
  not zero then Delta must be set to the length in bytes of a row in the 
  BltBuffer.

  <B>EfiBltVideoToVideo</B> - Copy from the video display rectangle (SourceX, SourceY)
  (SourceX + Width, SourceY + Height) .to the video display rectangle 
  (DestinationX, DestinationY) (DestinationX + Width, DestinationY + Height). 
  The BltBuffer and Delta  are not used in this mode.

  @param  This         Protocol instance pointer.
  @param  BltBuffer    Buffer containing data to blit into video buffer. This
                       buffer has a size of Width*Height*sizeof(EFI_GRAPHICS_OUTPUT_BLT_PIXEL)
  @param  BltOperation Operation to perform on BlitBuffer and video memory
  @param  SourceX      X coordinate of source for the BltBuffer.
  @param  SourceY      Y coordinate of source for the BltBuffer.
  @param  DestinationX X coordinate of destination for the BltBuffer.
  @param  DestinationY Y coordinate of destination for the BltBuffer.
  @param  Width        Width of rectangle in BltBuffer in pixels.
  @param  Height       Hight of rectangle in BltBuffer in pixels.
  @param  Delta        OPTIONAL

  @retval EFI_SUCCESS           The Blt operation completed.
  @retval EFI_INVALID_PARAMETER BltOperation is not valid.
  @retval EFI_DEVICE_ERROR      A hardware error occured writting to the video buffer.

**/
pub type EFI_GRAPHICS_OUTPUT_PROTOCOL_BLT =
    ::core::option::Option<unsafe extern "win64" fn(This:
                                                    *mut EFI_GRAPHICS_OUTPUT_PROTOCOL,
                                                BltBuffer:
                                                    *mut EFI_GRAPHICS_OUTPUT_BLT_PIXEL,
                                                BltOperation:
                                                    EFI_GRAPHICS_OUTPUT_BLT_OPERATION,
                                                SourceX: UINTN,
                                                SourceY: UINTN,
                                                DestinationX: UINTN,
                                                DestinationY: UINTN,
                                                Width: UINTN, Height: UINTN,
                                                Delta: UINTN) -> EFI_STATUS>;
#[repr(C)]

pub struct EFI_GRAPHICS_OUTPUT_PROTOCOL_MODE {
    pub MaxMode: UINT32,
    pub Mode: UINT32,
    pub Info: *mut EFI_GRAPHICS_OUTPUT_MODE_INFORMATION,
    pub SizeOfInfo: UINTN,
    pub FrameBufferBase: EFI_PHYSICAL_ADDRESS,
    pub FrameBufferSize: UINTN,
}
#[test]
fn bindgen_test_layout_EFI_GRAPHICS_OUTPUT_PROTOCOL_MODE() {
    assert_eq!(::core::mem::size_of::<EFI_GRAPHICS_OUTPUT_PROTOCOL_MODE>() ,
               40usize , concat ! (
               "Size of: " , stringify ! ( EFI_GRAPHICS_OUTPUT_PROTOCOL_MODE )
               ));
    assert_eq! (::core::mem::align_of::<EFI_GRAPHICS_OUTPUT_PROTOCOL_MODE>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! (
                EFI_GRAPHICS_OUTPUT_PROTOCOL_MODE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_GRAPHICS_OUTPUT_PROTOCOL_MODE ) ) .
                MaxMode as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_GRAPHICS_OUTPUT_PROTOCOL_MODE ) , "::" , stringify ! (
                MaxMode ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_GRAPHICS_OUTPUT_PROTOCOL_MODE ) ) .
                Mode as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_GRAPHICS_OUTPUT_PROTOCOL_MODE ) , "::" , stringify ! (
                Mode ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_GRAPHICS_OUTPUT_PROTOCOL_MODE ) ) .
                Info as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_GRAPHICS_OUTPUT_PROTOCOL_MODE ) , "::" , stringify ! (
                Info ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_GRAPHICS_OUTPUT_PROTOCOL_MODE ) ) .
                SizeOfInfo as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_GRAPHICS_OUTPUT_PROTOCOL_MODE ) , "::" , stringify ! (
                SizeOfInfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_GRAPHICS_OUTPUT_PROTOCOL_MODE ) ) .
                FrameBufferBase as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_GRAPHICS_OUTPUT_PROTOCOL_MODE ) , "::" , stringify ! (
                FrameBufferBase ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_GRAPHICS_OUTPUT_PROTOCOL_MODE ) ) .
                FrameBufferSize as * const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_GRAPHICS_OUTPUT_PROTOCOL_MODE ) , "::" , stringify ! (
                FrameBufferSize ) ));
}
impl Clone for EFI_GRAPHICS_OUTPUT_PROTOCOL_MODE {
    fn clone(&self) -> Self { unimplemented!() }
}
#[repr(C)]

pub struct _EFI_SERVICE_BINDING {
    pub CreateChild: EFI_SERVICE_BINDING_CREATE_CHILD,
    pub DestroyChild: EFI_SERVICE_BINDING_DESTROY_CHILD,
}
#[test]
fn bindgen_test_layout__EFI_SERVICE_BINDING() {
    assert_eq!(::core::mem::size_of::<_EFI_SERVICE_BINDING>() , 16usize ,
               concat ! ( "Size of: " , stringify ! ( _EFI_SERVICE_BINDING )
               ));
    assert_eq! (::core::mem::align_of::<_EFI_SERVICE_BINDING>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( _EFI_SERVICE_BINDING ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_SERVICE_BINDING ) ) . CreateChild as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_SERVICE_BINDING )
                , "::" , stringify ! ( CreateChild ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_SERVICE_BINDING ) ) . DestroyChild
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_SERVICE_BINDING )
                , "::" , stringify ! ( DestroyChild ) ));
}
impl Clone for _EFI_SERVICE_BINDING {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type EFI_SERVICE_BINDING_CREATE_CHILD =
    ::core::option::Option<unsafe extern "win64" fn(This:
                                                    *mut _EFI_SERVICE_BINDING,
                                                ChildHandle: *mut EFI_HANDLE)
                               -> EFI_STATUS>;
pub type EFI_SERVICE_BINDING_DESTROY_CHILD =
    ::core::option::Option<unsafe extern "win64" fn(This:
                                                    *mut _EFI_SERVICE_BINDING,
                                                ChildHandle: EFI_HANDLE)
                               -> EFI_STATUS>;
pub type EFI_SERVICE_BINDING = _EFI_SERVICE_BINDING;
#[repr(C)]

pub struct _SIMPLE_TEXT_OUTPUT_INTERFACE {
    pub Reset: EFI_TEXT_RESET,
    pub OutputString: EFI_TEXT_OUTPUT_STRING,
    pub TestString: EFI_TEXT_TEST_STRING,
    pub QueryMode: EFI_TEXT_QUERY_MODE,
    pub SetMode: EFI_TEXT_SET_MODE,
    pub SetAttribute: EFI_TEXT_SET_ATTRIBUTE,
    pub ClearScreen: EFI_TEXT_CLEAR_SCREEN,
    pub SetCursorPosition: EFI_TEXT_SET_CURSOR_POSITION,
    pub EnableCursor: EFI_TEXT_ENABLE_CURSOR,
    pub Mode: *mut SIMPLE_TEXT_OUTPUT_MODE,
}
#[test]
fn bindgen_test_layout__SIMPLE_TEXT_OUTPUT_INTERFACE() {
    assert_eq!(::core::mem::size_of::<_SIMPLE_TEXT_OUTPUT_INTERFACE>() ,
               80usize , concat ! (
               "Size of: " , stringify ! ( _SIMPLE_TEXT_OUTPUT_INTERFACE ) ));
    assert_eq! (::core::mem::align_of::<_SIMPLE_TEXT_OUTPUT_INTERFACE>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! ( _SIMPLE_TEXT_OUTPUT_INTERFACE
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _SIMPLE_TEXT_OUTPUT_INTERFACE ) ) . Reset
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                _SIMPLE_TEXT_OUTPUT_INTERFACE ) , "::" , stringify ! ( Reset )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _SIMPLE_TEXT_OUTPUT_INTERFACE ) ) .
                OutputString as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                _SIMPLE_TEXT_OUTPUT_INTERFACE ) , "::" , stringify ! (
                OutputString ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _SIMPLE_TEXT_OUTPUT_INTERFACE ) ) .
                TestString as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                _SIMPLE_TEXT_OUTPUT_INTERFACE ) , "::" , stringify ! (
                TestString ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _SIMPLE_TEXT_OUTPUT_INTERFACE ) ) .
                QueryMode as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! (
                _SIMPLE_TEXT_OUTPUT_INTERFACE ) , "::" , stringify ! (
                QueryMode ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _SIMPLE_TEXT_OUTPUT_INTERFACE ) ) .
                SetMode as * const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! (
                _SIMPLE_TEXT_OUTPUT_INTERFACE ) , "::" , stringify ! ( SetMode
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _SIMPLE_TEXT_OUTPUT_INTERFACE ) ) .
                SetAttribute as * const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! (
                _SIMPLE_TEXT_OUTPUT_INTERFACE ) , "::" , stringify ! (
                SetAttribute ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _SIMPLE_TEXT_OUTPUT_INTERFACE ) ) .
                ClearScreen as * const _ as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! (
                _SIMPLE_TEXT_OUTPUT_INTERFACE ) , "::" , stringify ! (
                ClearScreen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _SIMPLE_TEXT_OUTPUT_INTERFACE ) ) .
                SetCursorPosition as * const _ as usize } , 56usize , concat !
                (
                "Alignment of field: " , stringify ! (
                _SIMPLE_TEXT_OUTPUT_INTERFACE ) , "::" , stringify ! (
                SetCursorPosition ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _SIMPLE_TEXT_OUTPUT_INTERFACE ) ) .
                EnableCursor as * const _ as usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! (
                _SIMPLE_TEXT_OUTPUT_INTERFACE ) , "::" , stringify ! (
                EnableCursor ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _SIMPLE_TEXT_OUTPUT_INTERFACE ) ) . Mode
                as * const _ as usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! (
                _SIMPLE_TEXT_OUTPUT_INTERFACE ) , "::" , stringify ! ( Mode )
                ));
}
impl Clone for _SIMPLE_TEXT_OUTPUT_INTERFACE {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type EFI_TEXT_RESET =
    ::core::option::Option<unsafe extern "win64" fn(This:
                                                    *mut _SIMPLE_TEXT_OUTPUT_INTERFACE,
                                                ExtendedVerification: BOOLEAN)
                               -> EFI_STATUS>;
pub type EFI_TEXT_OUTPUT_STRING =
    ::core::option::Option<unsafe extern "win64" fn(This:
                                                    *mut _SIMPLE_TEXT_OUTPUT_INTERFACE,
                                                String: *mut CHAR16)
                               -> EFI_STATUS>;
pub type EFI_TEXT_TEST_STRING =
    ::core::option::Option<unsafe extern "win64" fn(This:
                                                    *mut _SIMPLE_TEXT_OUTPUT_INTERFACE,
                                                String: *mut CHAR16)
                               -> EFI_STATUS>;
pub type EFI_TEXT_QUERY_MODE =
    ::core::option::Option<unsafe extern "win64" fn(This:
                                                    *mut _SIMPLE_TEXT_OUTPUT_INTERFACE,
                                                ModeNumber: UINTN,
                                                Columns: *mut UINTN,
                                                Rows: *mut UINTN)
                               -> EFI_STATUS>;
pub type EFI_TEXT_SET_MODE =
    ::core::option::Option<unsafe extern "win64" fn(This:
                                                    *mut _SIMPLE_TEXT_OUTPUT_INTERFACE,
                                                ModeNumber: UINTN)
                               -> EFI_STATUS>;
pub type EFI_TEXT_SET_ATTRIBUTE =
    ::core::option::Option<unsafe extern "win64" fn(This:
                                                    *mut _SIMPLE_TEXT_OUTPUT_INTERFACE,
                                                Attribute: UINTN)
                               -> EFI_STATUS>;
pub type EFI_TEXT_CLEAR_SCREEN =
    ::core::option::Option<unsafe extern "win64" fn(This:
                                                    *mut _SIMPLE_TEXT_OUTPUT_INTERFACE)
                               -> EFI_STATUS>;
pub type EFI_TEXT_SET_CURSOR_POSITION =
    ::core::option::Option<unsafe extern "win64" fn(This:
                                                    *mut _SIMPLE_TEXT_OUTPUT_INTERFACE,
                                                Column: UINTN, Row: UINTN)
                               -> EFI_STATUS>;
pub type EFI_TEXT_ENABLE_CURSOR =
    ::core::option::Option<unsafe extern "win64" fn(This:
                                                    *mut _SIMPLE_TEXT_OUTPUT_INTERFACE,
                                                Enable: BOOLEAN)
                               -> EFI_STATUS>;
#[repr(C)]

pub struct SIMPLE_TEXT_OUTPUT_MODE {
    pub MaxMode: INT32,
    pub Mode: INT32,
    pub Attribute: INT32,
    pub CursorColumn: INT32,
    pub CursorRow: INT32,
    pub CursorVisible: BOOLEAN,
}
#[test]
fn bindgen_test_layout_SIMPLE_TEXT_OUTPUT_MODE() {
    assert_eq!(::core::mem::size_of::<SIMPLE_TEXT_OUTPUT_MODE>() , 24usize ,
               concat ! (
               "Size of: " , stringify ! ( SIMPLE_TEXT_OUTPUT_MODE ) ));
    assert_eq! (::core::mem::align_of::<SIMPLE_TEXT_OUTPUT_MODE>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( SIMPLE_TEXT_OUTPUT_MODE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SIMPLE_TEXT_OUTPUT_MODE ) ) . MaxMode as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( SIMPLE_TEXT_OUTPUT_MODE
                ) , "::" , stringify ! ( MaxMode ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SIMPLE_TEXT_OUTPUT_MODE ) ) . Mode as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( SIMPLE_TEXT_OUTPUT_MODE
                ) , "::" , stringify ! ( Mode ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SIMPLE_TEXT_OUTPUT_MODE ) ) . Attribute
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( SIMPLE_TEXT_OUTPUT_MODE
                ) , "::" , stringify ! ( Attribute ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SIMPLE_TEXT_OUTPUT_MODE ) ) .
                CursorColumn as * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( SIMPLE_TEXT_OUTPUT_MODE
                ) , "::" , stringify ! ( CursorColumn ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SIMPLE_TEXT_OUTPUT_MODE ) ) . CursorRow
                as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( SIMPLE_TEXT_OUTPUT_MODE
                ) , "::" , stringify ! ( CursorRow ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SIMPLE_TEXT_OUTPUT_MODE ) ) .
                CursorVisible as * const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( SIMPLE_TEXT_OUTPUT_MODE
                ) , "::" , stringify ! ( CursorVisible ) ));
}
impl Clone for SIMPLE_TEXT_OUTPUT_MODE {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type SIMPLE_TEXT_OUTPUT_INTERFACE = _SIMPLE_TEXT_OUTPUT_INTERFACE;
#[repr(C)]

pub struct _SIMPLE_INPUT_INTERFACE {
    pub Reset: EFI_INPUT_RESET,
    pub ReadKeyStroke: EFI_INPUT_READ_KEY,
    pub WaitForKey: EFI_EVENT,
}
#[test]
fn bindgen_test_layout__SIMPLE_INPUT_INTERFACE() {
    assert_eq!(::core::mem::size_of::<_SIMPLE_INPUT_INTERFACE>() , 24usize ,
               concat ! (
               "Size of: " , stringify ! ( _SIMPLE_INPUT_INTERFACE ) ));
    assert_eq! (::core::mem::align_of::<_SIMPLE_INPUT_INTERFACE>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( _SIMPLE_INPUT_INTERFACE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _SIMPLE_INPUT_INTERFACE ) ) . Reset as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _SIMPLE_INPUT_INTERFACE
                ) , "::" , stringify ! ( Reset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _SIMPLE_INPUT_INTERFACE ) ) .
                ReadKeyStroke as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _SIMPLE_INPUT_INTERFACE
                ) , "::" , stringify ! ( ReadKeyStroke ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _SIMPLE_INPUT_INTERFACE ) ) . WaitForKey
                as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( _SIMPLE_INPUT_INTERFACE
                ) , "::" , stringify ! ( WaitForKey ) ));
}
impl Clone for _SIMPLE_INPUT_INTERFACE {
    fn clone(&self) -> Self { unimplemented!() }
}
#[repr(C)]

pub struct EFI_INPUT_KEY {
    pub ScanCode: UINT16,
    pub UnicodeChar: CHAR16,
}
#[test]
fn bindgen_test_layout_EFI_INPUT_KEY() {
    assert_eq!(::core::mem::size_of::<EFI_INPUT_KEY>() , 4usize , concat ! (
               "Size of: " , stringify ! ( EFI_INPUT_KEY ) ));
    assert_eq! (::core::mem::align_of::<EFI_INPUT_KEY>() , 2usize , concat ! (
                "Alignment of " , stringify ! ( EFI_INPUT_KEY ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_INPUT_KEY ) ) . ScanCode as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_INPUT_KEY ) , "::"
                , stringify ! ( ScanCode ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_INPUT_KEY ) ) . UnicodeChar as *
                const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_INPUT_KEY ) , "::"
                , stringify ! ( UnicodeChar ) ));
}
impl Clone for EFI_INPUT_KEY {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type EFI_INPUT_RESET =
    ::core::option::Option<unsafe extern "win64" fn(This:
                                                    *mut _SIMPLE_INPUT_INTERFACE,
                                                ExtendedVerification: BOOLEAN)
                               -> EFI_STATUS>;
pub type EFI_INPUT_READ_KEY =
    ::core::option::Option<unsafe extern "win64" fn(This:
                                                    *mut _SIMPLE_INPUT_INTERFACE,
                                                Key: *mut EFI_INPUT_KEY)
                               -> EFI_STATUS>;
pub type SIMPLE_INPUT_INTERFACE = _SIMPLE_INPUT_INTERFACE;
#[repr(C)]

pub struct _SERIAL_IO_INTERFACE {
    pub Revision: UINT32,
    pub Reset: EFI_SERIAL_RESET,
    pub SetAttributes: EFI_SERIAL_SET_ATTRIBUTES,
    pub SetControl: EFI_SERIAL_SET_CONTROL_BITS,
    pub GetControl: EFI_SERIAL_GET_CONTROL_BITS,
    pub Write: EFI_SERIAL_WRITE,
    pub Read: EFI_SERIAL_READ,
    pub Mode: *mut SERIAL_IO_MODE,
}
#[test]
fn bindgen_test_layout__SERIAL_IO_INTERFACE() {
    assert_eq!(::core::mem::size_of::<_SERIAL_IO_INTERFACE>() , 64usize ,
               concat ! ( "Size of: " , stringify ! ( _SERIAL_IO_INTERFACE )
               ));
    assert_eq! (::core::mem::align_of::<_SERIAL_IO_INTERFACE>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( _SERIAL_IO_INTERFACE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _SERIAL_IO_INTERFACE ) ) . Revision as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _SERIAL_IO_INTERFACE )
                , "::" , stringify ! ( Revision ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _SERIAL_IO_INTERFACE ) ) . Reset as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _SERIAL_IO_INTERFACE )
                , "::" , stringify ! ( Reset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _SERIAL_IO_INTERFACE ) ) . SetAttributes
                as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( _SERIAL_IO_INTERFACE )
                , "::" , stringify ! ( SetAttributes ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _SERIAL_IO_INTERFACE ) ) . SetControl as
                * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( _SERIAL_IO_INTERFACE )
                , "::" , stringify ! ( SetControl ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _SERIAL_IO_INTERFACE ) ) . GetControl as
                * const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( _SERIAL_IO_INTERFACE )
                , "::" , stringify ! ( GetControl ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _SERIAL_IO_INTERFACE ) ) . Write as *
                const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( _SERIAL_IO_INTERFACE )
                , "::" , stringify ! ( Write ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _SERIAL_IO_INTERFACE ) ) . Read as *
                const _ as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( _SERIAL_IO_INTERFACE )
                , "::" , stringify ! ( Read ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _SERIAL_IO_INTERFACE ) ) . Mode as *
                const _ as usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( _SERIAL_IO_INTERFACE )
                , "::" , stringify ! ( Mode ) ));
}
impl Clone for _SERIAL_IO_INTERFACE {
    fn clone(&self) -> Self { unimplemented!() }
}
pub const EFI_PARITY_TYPE_DefaultParity: EFI_PARITY_TYPE = 0;
pub const EFI_PARITY_TYPE_NoParity: EFI_PARITY_TYPE = 1;
pub const EFI_PARITY_TYPE_EvenParity: EFI_PARITY_TYPE = 2;
pub const EFI_PARITY_TYPE_OddParity: EFI_PARITY_TYPE = 3;
pub const EFI_PARITY_TYPE_MarkParity: EFI_PARITY_TYPE = 4;
pub const EFI_PARITY_TYPE_SpaceParity: EFI_PARITY_TYPE = 5;
pub type EFI_PARITY_TYPE = ::ctypes::c_uint;
pub const EFI_STOP_BITS_TYPE_DefaultStopBits: EFI_STOP_BITS_TYPE = 0;
pub const EFI_STOP_BITS_TYPE_OneStopBit: EFI_STOP_BITS_TYPE = 1;
pub const EFI_STOP_BITS_TYPE_OneFiveStopBits: EFI_STOP_BITS_TYPE = 2;
pub const EFI_STOP_BITS_TYPE_TwoStopBits: EFI_STOP_BITS_TYPE = 3;
pub type EFI_STOP_BITS_TYPE = ::ctypes::c_uint;
pub type EFI_SERIAL_RESET =
    ::core::option::Option<unsafe extern "win64" fn(This:
                                                    *mut _SERIAL_IO_INTERFACE)
                               -> EFI_STATUS>;
pub type EFI_SERIAL_SET_ATTRIBUTES =
    ::core::option::Option<unsafe extern "win64" fn(This:
                                                    *mut _SERIAL_IO_INTERFACE,
                                                BaudRate: UINT64,
                                                ReceiveFifoDepth: UINT32,
                                                Timeout: UINT32,
                                                Parity: EFI_PARITY_TYPE,
                                                DataBits: UINT8,
                                                StopBits: EFI_STOP_BITS_TYPE)
                               -> EFI_STATUS>;
pub type EFI_SERIAL_SET_CONTROL_BITS =
    ::core::option::Option<unsafe extern "win64" fn(This:
                                                    *mut _SERIAL_IO_INTERFACE,
                                                Control: UINT32)
                               -> EFI_STATUS>;
pub type EFI_SERIAL_GET_CONTROL_BITS =
    ::core::option::Option<unsafe extern "win64" fn(This:
                                                    *mut _SERIAL_IO_INTERFACE,
                                                Control: *mut UINT32)
                               -> EFI_STATUS>;
pub type EFI_SERIAL_WRITE =
    ::core::option::Option<unsafe extern "win64" fn(This:
                                                    *mut _SERIAL_IO_INTERFACE,
                                                BufferSize: *mut UINTN,
                                                Buffer: *mut ::ctypes::c_void)
                               -> EFI_STATUS>;
pub type EFI_SERIAL_READ =
    ::core::option::Option<unsafe extern "win64" fn(This:
                                                    *mut _SERIAL_IO_INTERFACE,
                                                BufferSize: *mut UINTN,
                                                Buffer: *mut ::ctypes::c_void)
                               -> EFI_STATUS>;
#[repr(C)]

pub struct SERIAL_IO_MODE {
    pub ControlMask: UINT32,
    pub Timeout: UINT32,
    pub BaudRate: UINT64,
    pub ReceiveFifoDepth: UINT32,
    pub DataBits: UINT32,
    pub Parity: UINT32,
    pub StopBits: UINT32,
}
#[test]
fn bindgen_test_layout_SERIAL_IO_MODE() {
    assert_eq!(::core::mem::size_of::<SERIAL_IO_MODE>() , 32usize , concat ! (
               "Size of: " , stringify ! ( SERIAL_IO_MODE ) ));
    assert_eq! (::core::mem::align_of::<SERIAL_IO_MODE>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( SERIAL_IO_MODE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SERIAL_IO_MODE ) ) . ControlMask as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( SERIAL_IO_MODE ) , "::"
                , stringify ! ( ControlMask ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SERIAL_IO_MODE ) ) . Timeout as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( SERIAL_IO_MODE ) , "::"
                , stringify ! ( Timeout ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SERIAL_IO_MODE ) ) . BaudRate as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( SERIAL_IO_MODE ) , "::"
                , stringify ! ( BaudRate ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SERIAL_IO_MODE ) ) . ReceiveFifoDepth as
                * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( SERIAL_IO_MODE ) , "::"
                , stringify ! ( ReceiveFifoDepth ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SERIAL_IO_MODE ) ) . DataBits as * const
                _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( SERIAL_IO_MODE ) , "::"
                , stringify ! ( DataBits ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SERIAL_IO_MODE ) ) . Parity as * const _
                as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( SERIAL_IO_MODE ) , "::"
                , stringify ! ( Parity ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SERIAL_IO_MODE ) ) . StopBits as * const
                _ as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( SERIAL_IO_MODE ) , "::"
                , stringify ! ( StopBits ) ));
}
impl Clone for SERIAL_IO_MODE {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type SERIAL_IO_INTERFACE = _SERIAL_IO_INTERFACE;
pub const EFI_NETWORK_INTERFACE_TYPE_EfiNetworkInterfaceUndi:
          EFI_NETWORK_INTERFACE_TYPE =
    1;
pub type EFI_NETWORK_INTERFACE_TYPE = ::ctypes::c_uint;
#[repr(C)]

pub struct EFI_NETWORK_INTERFACE_IDENTIFIER_INTERFACE {
    pub Revision: UINT64,
    pub ID: UINT64,
    pub ImageAddr: UINT64,
    pub ImageSize: UINT32,
    pub StringId: [CHAR8; 4usize],
    pub Type: UINT8,
    pub MajorVer: UINT8,
    pub MinorVer: UINT8,
    pub Ipv6Supported: BOOLEAN,
    pub IfNum: UINT8,
}
#[test]
fn bindgen_test_layout_EFI_NETWORK_INTERFACE_IDENTIFIER_INTERFACE() {
    assert_eq!(::core::mem::size_of::<EFI_NETWORK_INTERFACE_IDENTIFIER_INTERFACE>()
               , 40usize , concat ! (
               "Size of: " , stringify ! (
               EFI_NETWORK_INTERFACE_IDENTIFIER_INTERFACE ) ));
    assert_eq! (::core::mem::align_of::<EFI_NETWORK_INTERFACE_IDENTIFIER_INTERFACE>()
                , 8usize , concat ! (
                "Alignment of " , stringify ! (
                EFI_NETWORK_INTERFACE_IDENTIFIER_INTERFACE ) ));
    assert_eq! (unsafe {
                & (
                * ( 0 as * const EFI_NETWORK_INTERFACE_IDENTIFIER_INTERFACE )
                ) . Revision as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_NETWORK_INTERFACE_IDENTIFIER_INTERFACE ) , "::" ,
                stringify ! ( Revision ) ));
    assert_eq! (unsafe {
                & (
                * ( 0 as * const EFI_NETWORK_INTERFACE_IDENTIFIER_INTERFACE )
                ) . ID as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_NETWORK_INTERFACE_IDENTIFIER_INTERFACE ) , "::" ,
                stringify ! ( ID ) ));
    assert_eq! (unsafe {
                & (
                * ( 0 as * const EFI_NETWORK_INTERFACE_IDENTIFIER_INTERFACE )
                ) . ImageAddr as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_NETWORK_INTERFACE_IDENTIFIER_INTERFACE ) , "::" ,
                stringify ! ( ImageAddr ) ));
    assert_eq! (unsafe {
                & (
                * ( 0 as * const EFI_NETWORK_INTERFACE_IDENTIFIER_INTERFACE )
                ) . ImageSize as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_NETWORK_INTERFACE_IDENTIFIER_INTERFACE ) , "::" ,
                stringify ! ( ImageSize ) ));
    assert_eq! (unsafe {
                & (
                * ( 0 as * const EFI_NETWORK_INTERFACE_IDENTIFIER_INTERFACE )
                ) . StringId as * const _ as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_NETWORK_INTERFACE_IDENTIFIER_INTERFACE ) , "::" ,
                stringify ! ( StringId ) ));
    assert_eq! (unsafe {
                & (
                * ( 0 as * const EFI_NETWORK_INTERFACE_IDENTIFIER_INTERFACE )
                ) . Type as * const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_NETWORK_INTERFACE_IDENTIFIER_INTERFACE ) , "::" ,
                stringify ! ( Type ) ));
    assert_eq! (unsafe {
                & (
                * ( 0 as * const EFI_NETWORK_INTERFACE_IDENTIFIER_INTERFACE )
                ) . MajorVer as * const _ as usize } , 33usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_NETWORK_INTERFACE_IDENTIFIER_INTERFACE ) , "::" ,
                stringify ! ( MajorVer ) ));
    assert_eq! (unsafe {
                & (
                * ( 0 as * const EFI_NETWORK_INTERFACE_IDENTIFIER_INTERFACE )
                ) . MinorVer as * const _ as usize } , 34usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_NETWORK_INTERFACE_IDENTIFIER_INTERFACE ) , "::" ,
                stringify ! ( MinorVer ) ));
    assert_eq! (unsafe {
                & (
                * ( 0 as * const EFI_NETWORK_INTERFACE_IDENTIFIER_INTERFACE )
                ) . Ipv6Supported as * const _ as usize } , 35usize , concat !
                (
                "Alignment of field: " , stringify ! (
                EFI_NETWORK_INTERFACE_IDENTIFIER_INTERFACE ) , "::" ,
                stringify ! ( Ipv6Supported ) ));
    assert_eq! (unsafe {
                & (
                * ( 0 as * const EFI_NETWORK_INTERFACE_IDENTIFIER_INTERFACE )
                ) . IfNum as * const _ as usize } , 36usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_NETWORK_INTERFACE_IDENTIFIER_INTERFACE ) , "::" ,
                stringify ! ( IfNum ) ));
}
impl Clone for EFI_NETWORK_INTERFACE_IDENTIFIER_INTERFACE {
    fn clone(&self) -> Self { unimplemented!() }
}
extern "win64" {
    #[link_name = "NetworkInterfaceIdentifierProtocol"]
    pub static mut NetworkInterfaceIdentifierProtocol: EFI_GUID;
}
#[repr(C)]

pub struct _EFI_PXE_BASE_CODE {
    pub Revision: UINT64,
    pub Start: EFI_PXE_BASE_CODE_START,
    pub Stop: EFI_PXE_BASE_CODE_STOP,
    pub Dhcp: EFI_PXE_BASE_CODE_DHCP,
    pub Discover: EFI_PXE_BASE_CODE_DISCOVER,
    pub Mtftp: EFI_PXE_BASE_CODE_MTFTP,
    pub UdpWrite: EFI_PXE_BASE_CODE_UDP_WRITE,
    pub UdpRead: EFI_PXE_BASE_CODE_UDP_READ,
    pub SetIpFilter: EFI_PXE_BASE_CODE_SET_IP_FILTER,
    pub Arp: EFI_PXE_BASE_CODE_ARP,
    pub SetParameters: EFI_PXE_BASE_CODE_SET_PARAMETERS,
    pub SetStationIp: EFI_PXE_BASE_CODE_SET_STATION_IP,
    pub SetPackets: EFI_PXE_BASE_CODE_SET_PACKETS,
    pub Mode: *mut EFI_PXE_BASE_CODE_MODE,
}
#[test]
fn bindgen_test_layout__EFI_PXE_BASE_CODE() {
    assert_eq!(::core::mem::size_of::<_EFI_PXE_BASE_CODE>() , 112usize ,
               concat ! ( "Size of: " , stringify ! ( _EFI_PXE_BASE_CODE ) ));
    assert_eq! (::core::mem::align_of::<_EFI_PXE_BASE_CODE>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( _EFI_PXE_BASE_CODE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_PXE_BASE_CODE ) ) . Revision as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_PXE_BASE_CODE ) ,
                "::" , stringify ! ( Revision ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_PXE_BASE_CODE ) ) . Start as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_PXE_BASE_CODE ) ,
                "::" , stringify ! ( Start ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_PXE_BASE_CODE ) ) . Stop as * const
                _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_PXE_BASE_CODE ) ,
                "::" , stringify ! ( Stop ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_PXE_BASE_CODE ) ) . Dhcp as * const
                _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_PXE_BASE_CODE ) ,
                "::" , stringify ! ( Dhcp ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_PXE_BASE_CODE ) ) . Discover as *
                const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_PXE_BASE_CODE ) ,
                "::" , stringify ! ( Discover ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_PXE_BASE_CODE ) ) . Mtftp as * const
                _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_PXE_BASE_CODE ) ,
                "::" , stringify ! ( Mtftp ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_PXE_BASE_CODE ) ) . UdpWrite as *
                const _ as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_PXE_BASE_CODE ) ,
                "::" , stringify ! ( UdpWrite ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_PXE_BASE_CODE ) ) . UdpRead as *
                const _ as usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_PXE_BASE_CODE ) ,
                "::" , stringify ! ( UdpRead ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_PXE_BASE_CODE ) ) . SetIpFilter as *
                const _ as usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_PXE_BASE_CODE ) ,
                "::" , stringify ! ( SetIpFilter ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_PXE_BASE_CODE ) ) . Arp as * const _
                as usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_PXE_BASE_CODE ) ,
                "::" , stringify ! ( Arp ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_PXE_BASE_CODE ) ) . SetParameters as
                * const _ as usize } , 80usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_PXE_BASE_CODE ) ,
                "::" , stringify ! ( SetParameters ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_PXE_BASE_CODE ) ) . SetStationIp as
                * const _ as usize } , 88usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_PXE_BASE_CODE ) ,
                "::" , stringify ! ( SetStationIp ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_PXE_BASE_CODE ) ) . SetPackets as *
                const _ as usize } , 96usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_PXE_BASE_CODE ) ,
                "::" , stringify ! ( SetPackets ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_PXE_BASE_CODE ) ) . Mode as * const
                _ as usize } , 104usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_PXE_BASE_CODE ) ,
                "::" , stringify ! ( Mode ) ));
}
impl Clone for _EFI_PXE_BASE_CODE {
    fn clone(&self) -> Self { unimplemented!() }
}
#[repr(C)]

pub union EFI_IP_ADDRESS {
    pub Addr: [UINT32; 4usize],
    pub v4: EFI_IPv4_ADDRESS,
    pub v6: EFI_IPv6_ADDRESS,
}
#[test]
fn bindgen_test_layout_EFI_IP_ADDRESS() {
    assert_eq!(::core::mem::size_of::<EFI_IP_ADDRESS>() , 16usize , concat ! (
               "Size of: " , stringify ! ( EFI_IP_ADDRESS ) ));
    assert_eq! (::core::mem::align_of::<EFI_IP_ADDRESS>() , 4usize , concat !
                ( "Alignment of " , stringify ! ( EFI_IP_ADDRESS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_IP_ADDRESS ) ) . Addr as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_IP_ADDRESS ) , "::"
                , stringify ! ( Addr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_IP_ADDRESS ) ) . v4 as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_IP_ADDRESS ) , "::"
                , stringify ! ( v4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_IP_ADDRESS ) ) . v6 as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_IP_ADDRESS ) , "::"
                , stringify ! ( v6 ) ));
}
impl Clone for EFI_IP_ADDRESS {
    fn clone(&self) -> Self { unimplemented!() }
}
pub type EFI_PXE_BASE_CODE_UDP_PORT = UINT16;
#[repr(C)]
pub struct EFI_PXE_BASE_CODE_DHCPV4_PACKET {
    pub BootpOpcode: UINT8,
    pub BootpHwType: UINT8,
    pub BootpHwAddrLen: UINT8,
    pub BootpGateHops: UINT8,
    pub BootpIdent: UINT32,
    pub BootpSeconds: UINT16,
    pub BootpFlags: UINT16,
    pub BootpCiAddr: [UINT8; 4usize],
    pub BootpYiAddr: [UINT8; 4usize],
    pub BootpSiAddr: [UINT8; 4usize],
    pub BootpGiAddr: [UINT8; 4usize],
    pub BootpHwAddr: [UINT8; 16usize],
    pub BootpSrvName: [UINT8; 64usize],
    pub BootpBootFile: [UINT8; 128usize],
    pub DhcpMagik: UINT32,
    pub DhcpOptions: [UINT8; 56usize],
}
#[test]
fn bindgen_test_layout_EFI_PXE_BASE_CODE_DHCPV4_PACKET() {
    assert_eq!(::core::mem::size_of::<EFI_PXE_BASE_CODE_DHCPV4_PACKET>() ,
               296usize , concat ! (
               "Size of: " , stringify ! ( EFI_PXE_BASE_CODE_DHCPV4_PACKET )
               ));
    assert_eq! (::core::mem::align_of::<EFI_PXE_BASE_CODE_DHCPV4_PACKET>() ,
                4usize , concat ! (
                "Alignment of " , stringify ! (
                EFI_PXE_BASE_CODE_DHCPV4_PACKET ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_DHCPV4_PACKET ) ) .
                BootpOpcode as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_DHCPV4_PACKET ) , "::" , stringify ! (
                BootpOpcode ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_DHCPV4_PACKET ) ) .
                BootpHwType as * const _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_DHCPV4_PACKET ) , "::" , stringify ! (
                BootpHwType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_DHCPV4_PACKET ) ) .
                BootpHwAddrLen as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_DHCPV4_PACKET ) , "::" , stringify ! (
                BootpHwAddrLen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_DHCPV4_PACKET ) ) .
                BootpGateHops as * const _ as usize } , 3usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_DHCPV4_PACKET ) , "::" , stringify ! (
                BootpGateHops ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_DHCPV4_PACKET ) ) .
                BootpIdent as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_DHCPV4_PACKET ) , "::" , stringify ! (
                BootpIdent ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_DHCPV4_PACKET ) ) .
                BootpSeconds as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_DHCPV4_PACKET ) , "::" , stringify ! (
                BootpSeconds ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_DHCPV4_PACKET ) ) .
                BootpFlags as * const _ as usize } , 10usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_DHCPV4_PACKET ) , "::" , stringify ! (
                BootpFlags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_DHCPV4_PACKET ) ) .
                BootpCiAddr as * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_DHCPV4_PACKET ) , "::" , stringify ! (
                BootpCiAddr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_DHCPV4_PACKET ) ) .
                BootpYiAddr as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_DHCPV4_PACKET ) , "::" , stringify ! (
                BootpYiAddr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_DHCPV4_PACKET ) ) .
                BootpSiAddr as * const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_DHCPV4_PACKET ) , "::" , stringify ! (
                BootpSiAddr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_DHCPV4_PACKET ) ) .
                BootpGiAddr as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_DHCPV4_PACKET ) , "::" , stringify ! (
                BootpGiAddr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_DHCPV4_PACKET ) ) .
                BootpHwAddr as * const _ as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_DHCPV4_PACKET ) , "::" , stringify ! (
                BootpHwAddr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_DHCPV4_PACKET ) ) .
                BootpSrvName as * const _ as usize } , 44usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_DHCPV4_PACKET ) , "::" , stringify ! (
                BootpSrvName ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_DHCPV4_PACKET ) ) .
                BootpBootFile as * const _ as usize } , 108usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_DHCPV4_PACKET ) , "::" , stringify ! (
                BootpBootFile ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_DHCPV4_PACKET ) ) .
                DhcpMagik as * const _ as usize } , 236usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_DHCPV4_PACKET ) , "::" , stringify ! (
                DhcpMagik ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_DHCPV4_PACKET ) ) .
                DhcpOptions as * const _ as usize } , 240usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_DHCPV4_PACKET ) , "::" , stringify ! (
                DhcpOptions ) ));
}
#[repr(C)]
pub struct EFI_PXE_BASE_CODE_DHCPV6_PACKET {
    pub _bitfield_1: u32,
    pub DhcpOptions: [UINT8; 1024usize],
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_EFI_PXE_BASE_CODE_DHCPV6_PACKET() {
    assert_eq!(::core::mem::size_of::<EFI_PXE_BASE_CODE_DHCPV6_PACKET>() ,
               1028usize , concat ! (
               "Size of: " , stringify ! ( EFI_PXE_BASE_CODE_DHCPV6_PACKET )
               ));
    assert_eq! (::core::mem::align_of::<EFI_PXE_BASE_CODE_DHCPV6_PACKET>() ,
                4usize , concat ! (
                "Alignment of " , stringify ! (
                EFI_PXE_BASE_CODE_DHCPV6_PACKET ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_DHCPV6_PACKET ) ) .
                DhcpOptions as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_DHCPV6_PACKET ) , "::" , stringify ! (
                DhcpOptions ) ));
}
impl EFI_PXE_BASE_CODE_DHCPV6_PACKET {
    #[inline]
    pub fn MessageType(&self) -> UINT32 {
        let mut unit_field_val: u32 = unsafe { ::core::mem::uninitialized() };
        unsafe {
            ::core::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                 *const u8,
                                             &mut unit_field_val as *mut u32
                                                 as *mut u8,
                                             ::core::mem::size_of::<u32>())
        };
        let mask = 255u64 as u32;
        let val = (unit_field_val & mask) >> 0usize;
        unsafe { ::core::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_MessageType(&mut self, val: UINT32) {
        let mask = 255u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::core::mem::uninitialized() };
        unsafe {
            ::core::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                 *const u8,
                                             &mut unit_field_val as *mut u32
                                                 as *mut u8,
                                             ::core::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 0usize) & mask;
        unsafe {
            ::core::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                 *const u8,
                                             &mut self._bitfield_1 as *mut _
                                                 as *mut u8,
                                             ::core::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn TransactionId(&self) -> UINT32 {
        let mut unit_field_val: u32 = unsafe { ::core::mem::uninitialized() };
        unsafe {
            ::core::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                 *const u8,
                                             &mut unit_field_val as *mut u32
                                                 as *mut u8,
                                             ::core::mem::size_of::<u32>())
        };
        let mask = 4294967040u64 as u32;
        let val = (unit_field_val & mask) >> 8usize;
        unsafe { ::core::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_TransactionId(&mut self, val: UINT32) {
        let mask = 4294967040u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::core::mem::uninitialized() };
        unsafe {
            ::core::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                 *const u8,
                                             &mut unit_field_val as *mut u32
                                                 as *mut u8,
                                             ::core::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 8usize) & mask;
        unsafe {
            ::core::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                 *const u8,
                                             &mut self._bitfield_1 as *mut _
                                                 as *mut u8,
                                             ::core::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub const fn new_bitfield_1(MessageType: UINT32, TransactionId: UINT32)
     -> u32 {
        ({
             ({ 0 } |
                  ((MessageType as u32 as u32) << 0usize) & (255u64 as u32))
         } |
             ((TransactionId as u32 as u32) << 8usize) &
                 (4294967040u64 as u32))
    }
}
#[repr(C)]
pub union EFI_PXE_BASE_CODE_PACKET {
    pub Raw: [UINT8; 1472usize],
    pub Dhcpv4: EFI_PXE_BASE_CODE_DHCPV4_PACKET,
    pub Dhcpv6: EFI_PXE_BASE_CODE_DHCPV6_PACKET,
}
#[test]
fn bindgen_test_layout_EFI_PXE_BASE_CODE_PACKET() {
    assert_eq!(::core::mem::size_of::<EFI_PXE_BASE_CODE_PACKET>() , 1472usize
               , concat ! (
               "Size of: " , stringify ! ( EFI_PXE_BASE_CODE_PACKET ) ));
    assert_eq! (::core::mem::align_of::<EFI_PXE_BASE_CODE_PACKET>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( EFI_PXE_BASE_CODE_PACKET ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_PACKET ) ) . Raw as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_PACKET ) , "::" , stringify ! ( Raw ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_PACKET ) ) . Dhcpv4 as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_PACKET ) , "::" , stringify ! ( Dhcpv4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_PACKET ) ) . Dhcpv6 as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_PACKET ) , "::" , stringify ! ( Dhcpv6 ) ));
}
#[repr(C)]
pub struct EFI_PXE_BASE_CODE_ICMP_ERROR {
    pub Type: UINT8,
    pub Code: UINT8,
    pub Checksum: UINT16,
    pub u: EFI_PXE_BASE_CODE_ICMP_ERROR__bindgen_ty_1,
    pub Data: [UINT8; 494usize],
}
#[repr(C)]

pub union EFI_PXE_BASE_CODE_ICMP_ERROR__bindgen_ty_1 {
    pub reserved: UINT32,
    pub Mtu: UINT32,
    pub Pointer: UINT32,
    pub Echo: EFI_PXE_BASE_CODE_ICMP_ERROR__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]

pub struct EFI_PXE_BASE_CODE_ICMP_ERROR__bindgen_ty_1__bindgen_ty_1 {
    pub Identifier: UINT16,
    pub Sequence: UINT16,
}
#[test]
fn bindgen_test_layout_EFI_PXE_BASE_CODE_ICMP_ERROR__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(::core::mem::size_of::<EFI_PXE_BASE_CODE_ICMP_ERROR__bindgen_ty_1__bindgen_ty_1>()
               , 4usize , concat ! (
               "Size of: " , stringify ! (
               EFI_PXE_BASE_CODE_ICMP_ERROR__bindgen_ty_1__bindgen_ty_1 ) ));
    assert_eq! (::core::mem::align_of::<EFI_PXE_BASE_CODE_ICMP_ERROR__bindgen_ty_1__bindgen_ty_1>()
                , 2usize , concat ! (
                "Alignment of " , stringify ! (
                EFI_PXE_BASE_CODE_ICMP_ERROR__bindgen_ty_1__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & (
                * (
                0 as * const
                EFI_PXE_BASE_CODE_ICMP_ERROR__bindgen_ty_1__bindgen_ty_1 ) ) .
                Identifier as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_ICMP_ERROR__bindgen_ty_1__bindgen_ty_1 ) ,
                "::" , stringify ! ( Identifier ) ));
    assert_eq! (unsafe {
                & (
                * (
                0 as * const
                EFI_PXE_BASE_CODE_ICMP_ERROR__bindgen_ty_1__bindgen_ty_1 ) ) .
                Sequence as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_ICMP_ERROR__bindgen_ty_1__bindgen_ty_1 ) ,
                "::" , stringify ! ( Sequence ) ));
}
impl Clone for EFI_PXE_BASE_CODE_ICMP_ERROR__bindgen_ty_1__bindgen_ty_1 {
    fn clone(&self) -> Self { unimplemented!() }
}
#[test]
fn bindgen_test_layout_EFI_PXE_BASE_CODE_ICMP_ERROR__bindgen_ty_1() {
    assert_eq!(::core::mem::size_of::<EFI_PXE_BASE_CODE_ICMP_ERROR__bindgen_ty_1>()
               , 4usize , concat ! (
               "Size of: " , stringify ! (
               EFI_PXE_BASE_CODE_ICMP_ERROR__bindgen_ty_1 ) ));
    assert_eq! (::core::mem::align_of::<EFI_PXE_BASE_CODE_ICMP_ERROR__bindgen_ty_1>()
                , 4usize , concat ! (
                "Alignment of " , stringify ! (
                EFI_PXE_BASE_CODE_ICMP_ERROR__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & (
                * ( 0 as * const EFI_PXE_BASE_CODE_ICMP_ERROR__bindgen_ty_1 )
                ) . reserved as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_ICMP_ERROR__bindgen_ty_1 ) , "::" ,
                stringify ! ( reserved ) ));
    assert_eq! (unsafe {
                & (
                * ( 0 as * const EFI_PXE_BASE_CODE_ICMP_ERROR__bindgen_ty_1 )
                ) . Mtu as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_ICMP_ERROR__bindgen_ty_1 ) , "::" ,
                stringify ! ( Mtu ) ));
    assert_eq! (unsafe {
                & (
                * ( 0 as * const EFI_PXE_BASE_CODE_ICMP_ERROR__bindgen_ty_1 )
                ) . Pointer as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_ICMP_ERROR__bindgen_ty_1 ) , "::" ,
                stringify ! ( Pointer ) ));
    assert_eq! (unsafe {
                & (
                * ( 0 as * const EFI_PXE_BASE_CODE_ICMP_ERROR__bindgen_ty_1 )
                ) . Echo as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_ICMP_ERROR__bindgen_ty_1 ) , "::" ,
                stringify ! ( Echo ) ));
}
impl Clone for EFI_PXE_BASE_CODE_ICMP_ERROR__bindgen_ty_1 {
    fn clone(&self) -> Self { unimplemented!() }
}
#[test]
fn bindgen_test_layout_EFI_PXE_BASE_CODE_ICMP_ERROR() {
    assert_eq!(::core::mem::size_of::<EFI_PXE_BASE_CODE_ICMP_ERROR>() ,
               504usize , concat ! (
               "Size of: " , stringify ! ( EFI_PXE_BASE_CODE_ICMP_ERROR ) ));
    assert_eq! (::core::mem::align_of::<EFI_PXE_BASE_CODE_ICMP_ERROR>() ,
                4usize , concat ! (
                "Alignment of " , stringify ! ( EFI_PXE_BASE_CODE_ICMP_ERROR )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_ICMP_ERROR ) ) . Type
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_ICMP_ERROR ) , "::" , stringify ! ( Type )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_ICMP_ERROR ) ) . Code
                as * const _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_ICMP_ERROR ) , "::" , stringify ! ( Code )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_ICMP_ERROR ) ) .
                Checksum as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_ICMP_ERROR ) , "::" , stringify ! ( Checksum
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_ICMP_ERROR ) ) . u as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_ICMP_ERROR ) , "::" , stringify ! ( u ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_ICMP_ERROR ) ) . Data
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_ICMP_ERROR ) , "::" , stringify ! ( Data )
                ));
}
#[repr(C)]
pub struct EFI_PXE_BASE_CODE_TFTP_ERROR {
    pub ErrorCode: UINT8,
    pub ErrorString: [CHAR8; 127usize],
}
#[test]
fn bindgen_test_layout_EFI_PXE_BASE_CODE_TFTP_ERROR() {
    assert_eq!(::core::mem::size_of::<EFI_PXE_BASE_CODE_TFTP_ERROR>() ,
               128usize , concat ! (
               "Size of: " , stringify ! ( EFI_PXE_BASE_CODE_TFTP_ERROR ) ));
    assert_eq! (::core::mem::align_of::<EFI_PXE_BASE_CODE_TFTP_ERROR>() ,
                1usize , concat ! (
                "Alignment of " , stringify ! ( EFI_PXE_BASE_CODE_TFTP_ERROR )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_TFTP_ERROR ) ) .
                ErrorCode as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_TFTP_ERROR ) , "::" , stringify ! (
                ErrorCode ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_TFTP_ERROR ) ) .
                ErrorString as * const _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_TFTP_ERROR ) , "::" , stringify ! (
                ErrorString ) ));
}
#[repr(C)]

pub struct EFI_PXE_BASE_CODE_IP_FILTER {
    pub Filters: UINT8,
    pub IpCnt: UINT8,
    pub reserved: UINT16,
    pub IpList: [EFI_IP_ADDRESS; 8usize],
}
#[test]
fn bindgen_test_layout_EFI_PXE_BASE_CODE_IP_FILTER() {
    assert_eq!(::core::mem::size_of::<EFI_PXE_BASE_CODE_IP_FILTER>() ,
               132usize , concat ! (
               "Size of: " , stringify ! ( EFI_PXE_BASE_CODE_IP_FILTER ) ));
    assert_eq! (::core::mem::align_of::<EFI_PXE_BASE_CODE_IP_FILTER>() ,
                4usize , concat ! (
                "Alignment of " , stringify ! ( EFI_PXE_BASE_CODE_IP_FILTER )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_IP_FILTER ) ) . Filters
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_IP_FILTER ) , "::" , stringify ! ( Filters )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_IP_FILTER ) ) . IpCnt
                as * const _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_IP_FILTER ) , "::" , stringify ! ( IpCnt )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_IP_FILTER ) ) .
                reserved as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_IP_FILTER ) , "::" , stringify ! ( reserved
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_IP_FILTER ) ) . IpList
                as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_IP_FILTER ) , "::" , stringify ! ( IpList )
                ));
}
impl Clone for EFI_PXE_BASE_CODE_IP_FILTER {
    fn clone(&self) -> Self { unimplemented!() }
}
#[repr(C)]

pub struct EFI_PXE_BASE_CODE_ARP_ENTRY {
    pub IpAddr: EFI_IP_ADDRESS,
    pub MacAddr: EFI_MAC_ADDRESS,
}
#[test]
fn bindgen_test_layout_EFI_PXE_BASE_CODE_ARP_ENTRY() {
    assert_eq!(::core::mem::size_of::<EFI_PXE_BASE_CODE_ARP_ENTRY>() , 48usize
               , concat ! (
               "Size of: " , stringify ! ( EFI_PXE_BASE_CODE_ARP_ENTRY ) ));
    assert_eq! (::core::mem::align_of::<EFI_PXE_BASE_CODE_ARP_ENTRY>() ,
                4usize , concat ! (
                "Alignment of " , stringify ! ( EFI_PXE_BASE_CODE_ARP_ENTRY )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_ARP_ENTRY ) ) . IpAddr
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_ARP_ENTRY ) , "::" , stringify ! ( IpAddr )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_ARP_ENTRY ) ) . MacAddr
                as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_ARP_ENTRY ) , "::" , stringify ! ( MacAddr )
                ));
}
impl Clone for EFI_PXE_BASE_CODE_ARP_ENTRY {
    fn clone(&self) -> Self { unimplemented!() }
}
#[repr(C)]

pub struct EFI_PXE_BASE_CODE_ROUTE_ENTRY {
    pub IpAddr: EFI_IP_ADDRESS,
    pub SubnetMask: EFI_IP_ADDRESS,
    pub GwAddr: EFI_IP_ADDRESS,
}
#[test]
fn bindgen_test_layout_EFI_PXE_BASE_CODE_ROUTE_ENTRY() {
    assert_eq!(::core::mem::size_of::<EFI_PXE_BASE_CODE_ROUTE_ENTRY>() ,
               48usize , concat ! (
               "Size of: " , stringify ! ( EFI_PXE_BASE_CODE_ROUTE_ENTRY ) ));
    assert_eq! (::core::mem::align_of::<EFI_PXE_BASE_CODE_ROUTE_ENTRY>() ,
                4usize , concat ! (
                "Alignment of " , stringify ! ( EFI_PXE_BASE_CODE_ROUTE_ENTRY
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_ROUTE_ENTRY ) ) .
                IpAddr as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_ROUTE_ENTRY ) , "::" , stringify ! ( IpAddr
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_ROUTE_ENTRY ) ) .
                SubnetMask as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_ROUTE_ENTRY ) , "::" , stringify ! (
                SubnetMask ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_ROUTE_ENTRY ) ) .
                GwAddr as * const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_ROUTE_ENTRY ) , "::" , stringify ! ( GwAddr
                ) ));
}
impl Clone for EFI_PXE_BASE_CODE_ROUTE_ENTRY {
    fn clone(&self) -> Self { unimplemented!() }
}
#[repr(C)]

pub struct EFI_PXE_BASE_CODE_SRVLIST {
    pub Type: UINT16,
    pub AcceptAnyResponse: BOOLEAN,
    pub Reserved: UINT8,
    pub IpAddr: EFI_IP_ADDRESS,
}
#[test]
fn bindgen_test_layout_EFI_PXE_BASE_CODE_SRVLIST() {
    assert_eq!(::core::mem::size_of::<EFI_PXE_BASE_CODE_SRVLIST>() , 20usize ,
               concat ! (
               "Size of: " , stringify ! ( EFI_PXE_BASE_CODE_SRVLIST ) ));
    assert_eq! (::core::mem::align_of::<EFI_PXE_BASE_CODE_SRVLIST>() , 4usize
                , concat ! (
                "Alignment of " , stringify ! ( EFI_PXE_BASE_CODE_SRVLIST )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_SRVLIST ) ) . Type as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_SRVLIST ) , "::" , stringify ! ( Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_SRVLIST ) ) .
                AcceptAnyResponse as * const _ as usize } , 2usize , concat !
                (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_SRVLIST ) , "::" , stringify ! (
                AcceptAnyResponse ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_SRVLIST ) ) . Reserved
                as * const _ as usize } , 3usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_SRVLIST ) , "::" , stringify ! ( Reserved )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_SRVLIST ) ) . IpAddr as
                * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_SRVLIST ) , "::" , stringify ! ( IpAddr )
                ));
}
impl Clone for EFI_PXE_BASE_CODE_SRVLIST {
    fn clone(&self) -> Self { unimplemented!() }
}
#[repr(C)]

pub struct EFI_PXE_BASE_CODE_DISCOVER_INFO {
    pub UseMCast: BOOLEAN,
    pub UseBCast: BOOLEAN,
    pub UseUCast: BOOLEAN,
    pub MustUseList: BOOLEAN,
    pub ServerMCastIp: EFI_IP_ADDRESS,
    pub IpCnt: UINT16,
    pub SrvList: [EFI_PXE_BASE_CODE_SRVLIST; 1usize],
}
#[test]
fn bindgen_test_layout_EFI_PXE_BASE_CODE_DISCOVER_INFO() {
    assert_eq!(::core::mem::size_of::<EFI_PXE_BASE_CODE_DISCOVER_INFO>() ,
               44usize , concat ! (
               "Size of: " , stringify ! ( EFI_PXE_BASE_CODE_DISCOVER_INFO )
               ));
    assert_eq! (::core::mem::align_of::<EFI_PXE_BASE_CODE_DISCOVER_INFO>() ,
                4usize , concat ! (
                "Alignment of " , stringify ! (
                EFI_PXE_BASE_CODE_DISCOVER_INFO ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_DISCOVER_INFO ) ) .
                UseMCast as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_DISCOVER_INFO ) , "::" , stringify ! (
                UseMCast ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_DISCOVER_INFO ) ) .
                UseBCast as * const _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_DISCOVER_INFO ) , "::" , stringify ! (
                UseBCast ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_DISCOVER_INFO ) ) .
                UseUCast as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_DISCOVER_INFO ) , "::" , stringify ! (
                UseUCast ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_DISCOVER_INFO ) ) .
                MustUseList as * const _ as usize } , 3usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_DISCOVER_INFO ) , "::" , stringify ! (
                MustUseList ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_DISCOVER_INFO ) ) .
                ServerMCastIp as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_DISCOVER_INFO ) , "::" , stringify ! (
                ServerMCastIp ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_DISCOVER_INFO ) ) .
                IpCnt as * const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_DISCOVER_INFO ) , "::" , stringify ! ( IpCnt
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_DISCOVER_INFO ) ) .
                SrvList as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_DISCOVER_INFO ) , "::" , stringify ! (
                SrvList ) ));
}
impl Clone for EFI_PXE_BASE_CODE_DISCOVER_INFO {
    fn clone(&self) -> Self { unimplemented!() }
}
pub const EFI_PXE_BASE_CODE_TFTP_OPCODE_EFI_PXE_BASE_CODE_TFTP_FIRST:
          EFI_PXE_BASE_CODE_TFTP_OPCODE =
    0;
pub const EFI_PXE_BASE_CODE_TFTP_OPCODE_EFI_PXE_BASE_CODE_TFTP_GET_FILE_SIZE:
          EFI_PXE_BASE_CODE_TFTP_OPCODE =
    1;
pub const EFI_PXE_BASE_CODE_TFTP_OPCODE_EFI_PXE_BASE_CODE_TFTP_READ_FILE:
          EFI_PXE_BASE_CODE_TFTP_OPCODE =
    2;
pub const EFI_PXE_BASE_CODE_TFTP_OPCODE_EFI_PXE_BASE_CODE_TFTP_WRITE_FILE:
          EFI_PXE_BASE_CODE_TFTP_OPCODE =
    3;
pub const EFI_PXE_BASE_CODE_TFTP_OPCODE_EFI_PXE_BASE_CODE_TFTP_READ_DIRECTORY:
          EFI_PXE_BASE_CODE_TFTP_OPCODE =
    4;
pub const EFI_PXE_BASE_CODE_TFTP_OPCODE_EFI_PXE_BASE_CODE_MTFTP_GET_FILE_SIZE:
          EFI_PXE_BASE_CODE_TFTP_OPCODE =
    5;
pub const EFI_PXE_BASE_CODE_TFTP_OPCODE_EFI_PXE_BASE_CODE_MTFTP_READ_FILE:
          EFI_PXE_BASE_CODE_TFTP_OPCODE =
    6;
pub const EFI_PXE_BASE_CODE_TFTP_OPCODE_EFI_PXE_BASE_CODE_MTFTP_READ_DIRECTORY:
          EFI_PXE_BASE_CODE_TFTP_OPCODE =
    7;
pub const EFI_PXE_BASE_CODE_TFTP_OPCODE_EFI_PXE_BASE_CODE_MTFTP_LAST:
          EFI_PXE_BASE_CODE_TFTP_OPCODE =
    8;
pub type EFI_PXE_BASE_CODE_TFTP_OPCODE = ::ctypes::c_uint;
#[repr(C)]

pub struct EFI_PXE_BASE_CODE_MTFTP_INFO {
    pub MCastIp: EFI_IP_ADDRESS,
    pub CPort: EFI_PXE_BASE_CODE_UDP_PORT,
    pub SPort: EFI_PXE_BASE_CODE_UDP_PORT,
    pub ListenTimeout: UINT16,
    pub TransmitTimeout: UINT16,
}
#[test]
fn bindgen_test_layout_EFI_PXE_BASE_CODE_MTFTP_INFO() {
    assert_eq!(::core::mem::size_of::<EFI_PXE_BASE_CODE_MTFTP_INFO>() ,
               24usize , concat ! (
               "Size of: " , stringify ! ( EFI_PXE_BASE_CODE_MTFTP_INFO ) ));
    assert_eq! (::core::mem::align_of::<EFI_PXE_BASE_CODE_MTFTP_INFO>() ,
                4usize , concat ! (
                "Alignment of " , stringify ! ( EFI_PXE_BASE_CODE_MTFTP_INFO )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_MTFTP_INFO ) ) .
                MCastIp as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_MTFTP_INFO ) , "::" , stringify ! ( MCastIp
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_MTFTP_INFO ) ) . CPort
                as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_MTFTP_INFO ) , "::" , stringify ! ( CPort )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_MTFTP_INFO ) ) . SPort
                as * const _ as usize } , 18usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_MTFTP_INFO ) , "::" , stringify ! ( SPort )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_MTFTP_INFO ) ) .
                ListenTimeout as * const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_MTFTP_INFO ) , "::" , stringify ! (
                ListenTimeout ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_MTFTP_INFO ) ) .
                TransmitTimeout as * const _ as usize } , 22usize , concat ! (
                "Alignment of field: " , stringify ! (
                EFI_PXE_BASE_CODE_MTFTP_INFO ) , "::" , stringify ! (
                TransmitTimeout ) ));
}
impl Clone for EFI_PXE_BASE_CODE_MTFTP_INFO {
    fn clone(&self) -> Self { unimplemented!() }
}
#[repr(C)]
pub struct EFI_PXE_BASE_CODE_MODE {
    pub Started: BOOLEAN,
    pub Ipv6Available: BOOLEAN,
    pub Ipv6Supported: BOOLEAN,
    pub UsingIpv6: BOOLEAN,
    pub BisSupported: BOOLEAN,
    pub BisDetected: BOOLEAN,
    pub AutoArp: BOOLEAN,
    pub SendGUID: BOOLEAN,
    pub DhcpDiscoverValid: BOOLEAN,
    pub DhcpAckReceived: BOOLEAN,
    pub ProxyOfferReceived: BOOLEAN,
    pub PxeDiscoverValid: BOOLEAN,
    pub PxeReplyReceived: BOOLEAN,
    pub PxeBisReplyReceived: BOOLEAN,
    pub IcmpErrorReceived: BOOLEAN,
    pub TftpErrorReceived: BOOLEAN,
    pub MakeCallbacks: BOOLEAN,
    pub TTL: UINT8,
    pub ToS: UINT8,
    pub StationIp: EFI_IP_ADDRESS,
    pub SubnetMask: EFI_IP_ADDRESS,
    pub DhcpDiscover: EFI_PXE_BASE_CODE_PACKET,
    pub DhcpAck: EFI_PXE_BASE_CODE_PACKET,
    pub ProxyOffer: EFI_PXE_BASE_CODE_PACKET,
    pub PxeDiscover: EFI_PXE_BASE_CODE_PACKET,
    pub PxeReply: EFI_PXE_BASE_CODE_PACKET,
    pub PxeBisReply: EFI_PXE_BASE_CODE_PACKET,
    pub IpFilter: EFI_PXE_BASE_CODE_IP_FILTER,
    pub ArpCacheEntries: UINT32,
    pub ArpCache: [EFI_PXE_BASE_CODE_ARP_ENTRY; 8usize],
    pub RouteTableEntries: UINT32,
    pub RouteTable: [EFI_PXE_BASE_CODE_ROUTE_ENTRY; 8usize],
    pub IcmpError: EFI_PXE_BASE_CODE_ICMP_ERROR,
    pub TftpError: EFI_PXE_BASE_CODE_TFTP_ERROR,
}
#[test]
fn bindgen_test_layout_EFI_PXE_BASE_CODE_MODE() {
    assert_eq!(::core::mem::size_of::<EFI_PXE_BASE_CODE_MODE>() , 10424usize ,
               concat ! ( "Size of: " , stringify ! ( EFI_PXE_BASE_CODE_MODE )
               ));
    assert_eq! (::core::mem::align_of::<EFI_PXE_BASE_CODE_MODE>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( EFI_PXE_BASE_CODE_MODE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_MODE ) ) . Started as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_PXE_BASE_CODE_MODE
                ) , "::" , stringify ! ( Started ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_MODE ) ) .
                Ipv6Available as * const _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_PXE_BASE_CODE_MODE
                ) , "::" , stringify ! ( Ipv6Available ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_MODE ) ) .
                Ipv6Supported as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_PXE_BASE_CODE_MODE
                ) , "::" , stringify ! ( Ipv6Supported ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_MODE ) ) . UsingIpv6 as
                * const _ as usize } , 3usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_PXE_BASE_CODE_MODE
                ) , "::" , stringify ! ( UsingIpv6 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_MODE ) ) . BisSupported
                as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_PXE_BASE_CODE_MODE
                ) , "::" , stringify ! ( BisSupported ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_MODE ) ) . BisDetected
                as * const _ as usize } , 5usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_PXE_BASE_CODE_MODE
                ) , "::" , stringify ! ( BisDetected ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_MODE ) ) . AutoArp as *
                const _ as usize } , 6usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_PXE_BASE_CODE_MODE
                ) , "::" , stringify ! ( AutoArp ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_MODE ) ) . SendGUID as
                * const _ as usize } , 7usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_PXE_BASE_CODE_MODE
                ) , "::" , stringify ! ( SendGUID ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_MODE ) ) .
                DhcpDiscoverValid as * const _ as usize } , 8usize , concat !
                (
                "Alignment of field: " , stringify ! ( EFI_PXE_BASE_CODE_MODE
                ) , "::" , stringify ! ( DhcpDiscoverValid ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_MODE ) ) .
                DhcpAckReceived as * const _ as usize } , 9usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_PXE_BASE_CODE_MODE
                ) , "::" , stringify ! ( DhcpAckReceived ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_MODE ) ) .
                ProxyOfferReceived as * const _ as usize } , 10usize , concat
                ! (
                "Alignment of field: " , stringify ! ( EFI_PXE_BASE_CODE_MODE
                ) , "::" , stringify ! ( ProxyOfferReceived ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_MODE ) ) .
                PxeDiscoverValid as * const _ as usize } , 11usize , concat !
                (
                "Alignment of field: " , stringify ! ( EFI_PXE_BASE_CODE_MODE
                ) , "::" , stringify ! ( PxeDiscoverValid ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_MODE ) ) .
                PxeReplyReceived as * const _ as usize } , 12usize , concat !
                (
                "Alignment of field: " , stringify ! ( EFI_PXE_BASE_CODE_MODE
                ) , "::" , stringify ! ( PxeReplyReceived ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_MODE ) ) .
                PxeBisReplyReceived as * const _ as usize } , 13usize , concat
                ! (
                "Alignment of field: " , stringify ! ( EFI_PXE_BASE_CODE_MODE
                ) , "::" , stringify ! ( PxeBisReplyReceived ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_MODE ) ) .
                IcmpErrorReceived as * const _ as usize } , 14usize , concat !
                (
                "Alignment of field: " , stringify ! ( EFI_PXE_BASE_CODE_MODE
                ) , "::" , stringify ! ( IcmpErrorReceived ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_MODE ) ) .
                TftpErrorReceived as * const _ as usize } , 15usize , concat !
                (
                "Alignment of field: " , stringify ! ( EFI_PXE_BASE_CODE_MODE
                ) , "::" , stringify ! ( TftpErrorReceived ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_MODE ) ) .
                MakeCallbacks as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_PXE_BASE_CODE_MODE
                ) , "::" , stringify ! ( MakeCallbacks ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_MODE ) ) . TTL as *
                const _ as usize } , 17usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_PXE_BASE_CODE_MODE
                ) , "::" , stringify ! ( TTL ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_MODE ) ) . ToS as *
                const _ as usize } , 18usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_PXE_BASE_CODE_MODE
                ) , "::" , stringify ! ( ToS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_MODE ) ) . StationIp as
                * const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_PXE_BASE_CODE_MODE
                ) , "::" , stringify ! ( StationIp ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_MODE ) ) . SubnetMask
                as * const _ as usize } , 36usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_PXE_BASE_CODE_MODE
                ) , "::" , stringify ! ( SubnetMask ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_MODE ) ) . DhcpDiscover
                as * const _ as usize } , 52usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_PXE_BASE_CODE_MODE
                ) , "::" , stringify ! ( DhcpDiscover ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_MODE ) ) . DhcpAck as *
                const _ as usize } , 1524usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_PXE_BASE_CODE_MODE
                ) , "::" , stringify ! ( DhcpAck ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_MODE ) ) . ProxyOffer
                as * const _ as usize } , 2996usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_PXE_BASE_CODE_MODE
                ) , "::" , stringify ! ( ProxyOffer ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_MODE ) ) . PxeDiscover
                as * const _ as usize } , 4468usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_PXE_BASE_CODE_MODE
                ) , "::" , stringify ! ( PxeDiscover ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_MODE ) ) . PxeReply as
                * const _ as usize } , 5940usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_PXE_BASE_CODE_MODE
                ) , "::" , stringify ! ( PxeReply ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_MODE ) ) . PxeBisReply
                as * const _ as usize } , 7412usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_PXE_BASE_CODE_MODE
                ) , "::" , stringify ! ( PxeBisReply ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_MODE ) ) . IpFilter as
                * const _ as usize } , 8884usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_PXE_BASE_CODE_MODE
                ) , "::" , stringify ! ( IpFilter ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_MODE ) ) .
                ArpCacheEntries as * const _ as usize } , 9016usize , concat !
                (
                "Alignment of field: " , stringify ! ( EFI_PXE_BASE_CODE_MODE
                ) , "::" , stringify ! ( ArpCacheEntries ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_MODE ) ) . ArpCache as
                * const _ as usize } , 9020usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_PXE_BASE_CODE_MODE
                ) , "::" , stringify ! ( ArpCache ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_MODE ) ) .
                RouteTableEntries as * const _ as usize } , 9404usize , concat
                ! (
                "Alignment of field: " , stringify ! ( EFI_PXE_BASE_CODE_MODE
                ) , "::" , stringify ! ( RouteTableEntries ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_MODE ) ) . RouteTable
                as * const _ as usize } , 9408usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_PXE_BASE_CODE_MODE
                ) , "::" , stringify ! ( RouteTable ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_MODE ) ) . IcmpError as
                * const _ as usize } , 9792usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_PXE_BASE_CODE_MODE
                ) , "::" , stringify ! ( IcmpError ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_PXE_BASE_CODE_MODE ) ) . TftpError as
                * const _ as usize } , 10296usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_PXE_BASE_CODE_MODE
                ) , "::" , stringify ! ( TftpError ) ));
}
pub type EFI_PXE_BASE_CODE_START =
    ::core::option::Option<unsafe extern "win64" fn(This: *mut _EFI_PXE_BASE_CODE,
                                                UseIpv6: BOOLEAN)
                               -> EFI_STATUS>;
pub type EFI_PXE_BASE_CODE_STOP =
    ::core::option::Option<unsafe extern "win64" fn(This: *mut _EFI_PXE_BASE_CODE)
                               -> EFI_STATUS>;
pub type EFI_PXE_BASE_CODE_DHCP =
    ::core::option::Option<unsafe extern "win64" fn(This: *mut _EFI_PXE_BASE_CODE,
                                                SortOffers: BOOLEAN)
                               -> EFI_STATUS>;
pub type EFI_PXE_BASE_CODE_DISCOVER =
    ::core::option::Option<unsafe extern "win64" fn(This: *mut _EFI_PXE_BASE_CODE,
                                                Type: UINT16,
                                                Layer: *mut UINT16,
                                                UseBis: BOOLEAN,
                                                Info:
                                                    *mut EFI_PXE_BASE_CODE_DISCOVER_INFO)
                               -> EFI_STATUS>;
pub type EFI_PXE_BASE_CODE_MTFTP =
    ::core::option::Option<unsafe extern "win64" fn(This: *mut _EFI_PXE_BASE_CODE,
                                                Operation:
                                                    EFI_PXE_BASE_CODE_TFTP_OPCODE,
                                                BufferPtr:
                                                    *mut ::ctypes::c_void,
                                                Overwrite: BOOLEAN,
                                                BufferSize: *mut UINT64,
                                                BlockSize: *mut UINTN,
                                                ServerIp: *mut EFI_IP_ADDRESS,
                                                Filename: *mut UINT8,
                                                Info:
                                                    *mut EFI_PXE_BASE_CODE_MTFTP_INFO,
                                                DontUseBuffer: BOOLEAN)
                               -> EFI_STATUS>;
pub type EFI_PXE_BASE_CODE_UDP_WRITE =
    ::core::option::Option<unsafe extern "win64" fn(This: *mut _EFI_PXE_BASE_CODE,
                                                OpFlags: UINT16,
                                                DestIp: *mut EFI_IP_ADDRESS,
                                                DestPort:
                                                    *mut EFI_PXE_BASE_CODE_UDP_PORT,
                                                GatewayIp:
                                                    *mut EFI_IP_ADDRESS,
                                                SrcIp: *mut EFI_IP_ADDRESS,
                                                SrcPort:
                                                    *mut EFI_PXE_BASE_CODE_UDP_PORT,
                                                HeaderSize: *mut UINTN,
                                                HeaderPtr:
                                                    *mut ::ctypes::c_void,
                                                BufferSize: *mut UINTN,
                                                BufferPtr:
                                                    *mut ::ctypes::c_void)
                               -> EFI_STATUS>;
pub type EFI_PXE_BASE_CODE_UDP_READ =
    ::core::option::Option<unsafe extern "win64" fn(This: *mut _EFI_PXE_BASE_CODE,
                                                OpFlags: UINT16,
                                                DestIp: *mut EFI_IP_ADDRESS,
                                                DestPort:
                                                    *mut EFI_PXE_BASE_CODE_UDP_PORT,
                                                SrcIp: *mut EFI_IP_ADDRESS,
                                                SrcPort:
                                                    *mut EFI_PXE_BASE_CODE_UDP_PORT,
                                                HeaderSize: *mut UINTN,
                                                HeaderPtr:
                                                    *mut ::ctypes::c_void,
                                                BufferSize: *mut UINTN,
                                                BufferPtr:
                                                    *mut ::ctypes::c_void)
                               -> EFI_STATUS>;
pub type EFI_PXE_BASE_CODE_SET_IP_FILTER =
    ::core::option::Option<unsafe extern "win64" fn(This: *mut _EFI_PXE_BASE_CODE,
                                                NewFilter:
                                                    *mut EFI_PXE_BASE_CODE_IP_FILTER)
                               -> EFI_STATUS>;
pub type EFI_PXE_BASE_CODE_ARP =
    ::core::option::Option<unsafe extern "win64" fn(This: *mut _EFI_PXE_BASE_CODE,
                                                IpAddr: *mut EFI_IP_ADDRESS,
                                                MacAddr: *mut EFI_MAC_ADDRESS)
                               -> EFI_STATUS>;
pub type EFI_PXE_BASE_CODE_SET_PARAMETERS =
    ::core::option::Option<unsafe extern "win64" fn(This: *mut _EFI_PXE_BASE_CODE,
                                                NewAutoArp: *mut BOOLEAN,
                                                NewSendGUID: *mut BOOLEAN,
                                                NewTTL: *mut UINT8,
                                                NewToS: *mut UINT8,
                                                NewMakeCallback: *mut BOOLEAN)
                               -> EFI_STATUS>;
pub type EFI_PXE_BASE_CODE_SET_STATION_IP =
    ::core::option::Option<unsafe extern "win64" fn(This: *mut _EFI_PXE_BASE_CODE,
                                                NewStationIp:
                                                    *mut EFI_IP_ADDRESS,
                                                NewSubnetMask:
                                                    *mut EFI_IP_ADDRESS)
                               -> EFI_STATUS>;
pub type EFI_PXE_BASE_CODE_SET_PACKETS =
    ::core::option::Option<unsafe extern "win64" fn(This: *mut _EFI_PXE_BASE_CODE,
                                                NewDhcpDiscoverValid:
                                                    *mut BOOLEAN,
                                                NewDhcpAckReceived:
                                                    *mut BOOLEAN,
                                                NewProxyOfferReceived:
                                                    *mut BOOLEAN,
                                                NewPxeDiscoverValid:
                                                    *mut BOOLEAN,
                                                NewPxeReplyReceived:
                                                    *mut BOOLEAN,
                                                NewPxeBisReplyReceived:
                                                    *mut BOOLEAN,
                                                NewDhcpDiscover:
                                                    *mut EFI_PXE_BASE_CODE_PACKET,
                                                NewDhcpAck:
                                                    *mut EFI_PXE_BASE_CODE_PACKET,
                                                NewProxyOffer:
                                                    *mut EFI_PXE_BASE_CODE_PACKET,
                                                NewPxeDiscover:
                                                    *mut EFI_PXE_BASE_CODE_PACKET,
                                                NewPxeReply:
                                                    *mut EFI_PXE_BASE_CODE_PACKET,
                                                NewPxeBisReply:
                                                    *mut EFI_PXE_BASE_CODE_PACKET)
                               -> EFI_STATUS>;
pub type EFI_PXE_BASE_CODE = _EFI_PXE_BASE_CODE;
#[repr(C)]

pub struct _EFI_PXE_BASE_CODE_CALLBACK {
    pub Revision: UINT64,
    pub Callback: EFI_PXE_CALLBACK,
}
#[test]
fn bindgen_test_layout__EFI_PXE_BASE_CODE_CALLBACK() {
    assert_eq!(::core::mem::size_of::<_EFI_PXE_BASE_CODE_CALLBACK>() , 16usize
               , concat ! (
               "Size of: " , stringify ! ( _EFI_PXE_BASE_CODE_CALLBACK ) ));
    assert_eq! (::core::mem::align_of::<_EFI_PXE_BASE_CODE_CALLBACK>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! ( _EFI_PXE_BASE_CODE_CALLBACK )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_PXE_BASE_CODE_CALLBACK ) ) .
                Revision as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                _EFI_PXE_BASE_CODE_CALLBACK ) , "::" , stringify ! ( Revision
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_PXE_BASE_CODE_CALLBACK ) ) .
                Callback as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                _EFI_PXE_BASE_CODE_CALLBACK ) , "::" , stringify ! ( Callback
                ) ));
}
impl Clone for _EFI_PXE_BASE_CODE_CALLBACK {
    fn clone(&self) -> Self { unimplemented!() }
}
pub const EFI_PXE_BASE_CODE_FUNCTION_EFI_PXE_BASE_CODE_FUNCTION_FIRST:
          EFI_PXE_BASE_CODE_FUNCTION =
    0;
pub const EFI_PXE_BASE_CODE_FUNCTION_EFI_PXE_BASE_CODE_FUNCTION_DHCP:
          EFI_PXE_BASE_CODE_FUNCTION =
    1;
pub const EFI_PXE_BASE_CODE_FUNCTION_EFI_PXE_BASE_CODE_FUNCTION_DISCOVER:
          EFI_PXE_BASE_CODE_FUNCTION =
    2;
pub const EFI_PXE_BASE_CODE_FUNCTION_EFI_PXE_BASE_CODE_FUNCTION_MTFTP:
          EFI_PXE_BASE_CODE_FUNCTION =
    3;
pub const EFI_PXE_BASE_CODE_FUNCTION_EFI_PXE_BASE_CODE_FUNCTION_UDP_WRITE:
          EFI_PXE_BASE_CODE_FUNCTION =
    4;
pub const EFI_PXE_BASE_CODE_FUNCTION_EFI_PXE_BASE_CODE_FUNCTION_UDP_READ:
          EFI_PXE_BASE_CODE_FUNCTION =
    5;
pub const EFI_PXE_BASE_CODE_FUNCTION_EFI_PXE_BASE_CODE_FUNCTION_ARP:
          EFI_PXE_BASE_CODE_FUNCTION =
    6;
pub const EFI_PXE_BASE_CODE_FUNCTION_EFI_PXE_BASE_CODE_FUNCTION_IGMP:
          EFI_PXE_BASE_CODE_FUNCTION =
    7;
pub const EFI_PXE_BASE_CODE_FUNCTION_EFI_PXE_BASE_CODE_PXE_FUNCTION_LAST:
          EFI_PXE_BASE_CODE_FUNCTION =
    8;
pub type EFI_PXE_BASE_CODE_FUNCTION = ::ctypes::c_uint;
pub const EFI_PXE_BASE_CODE_CALLBACK_STATUS_EFI_PXE_BASE_CODE_CALLBACK_STATUS_FIRST:
          EFI_PXE_BASE_CODE_CALLBACK_STATUS =
    0;
pub const EFI_PXE_BASE_CODE_CALLBACK_STATUS_EFI_PXE_BASE_CODE_CALLBACK_STATUS_CONTINUE:
          EFI_PXE_BASE_CODE_CALLBACK_STATUS =
    1;
pub const EFI_PXE_BASE_CODE_CALLBACK_STATUS_EFI_PXE_BASE_CODE_CALLBACK_STATUS_ABORT:
          EFI_PXE_BASE_CODE_CALLBACK_STATUS =
    2;
pub const EFI_PXE_BASE_CODE_CALLBACK_STATUS_EFI_PXE_BASE_CODE_CALLBACK_STATUS_LAST:
          EFI_PXE_BASE_CODE_CALLBACK_STATUS =
    3;
pub type EFI_PXE_BASE_CODE_CALLBACK_STATUS = ::ctypes::c_uint;
pub type EFI_PXE_CALLBACK =
    ::core::option::Option<unsafe extern "win64" fn(This:
                                                    *mut _EFI_PXE_BASE_CODE_CALLBACK,
                                                Function:
                                                    EFI_PXE_BASE_CODE_FUNCTION,
                                                Received: BOOLEAN,
                                                PacketLen: UINT32,
                                                Packet:
                                                    *mut EFI_PXE_BASE_CODE_PACKET)
                               -> EFI_PXE_BASE_CODE_CALLBACK_STATUS>;
pub type EFI_PXE_BASE_CODE_CALLBACK = _EFI_PXE_BASE_CODE_CALLBACK;
#[repr(C)]

pub struct _EFI_SIMPLE_NETWORK {
    pub Revision: UINT64,
    pub Start: EFI_SIMPLE_NETWORK_START,
    pub Stop: EFI_SIMPLE_NETWORK_STOP,
    pub Initialize: EFI_SIMPLE_NETWORK_INITIALIZE,
    pub Reset: EFI_SIMPLE_NETWORK_RESET,
    pub Shutdown: EFI_SIMPLE_NETWORK_SHUTDOWN,
    pub ReceiveFilters: EFI_SIMPLE_NETWORK_RECEIVE_FILTERS,
    pub StationAddress: EFI_SIMPLE_NETWORK_STATION_ADDRESS,
    pub Statistics: EFI_SIMPLE_NETWORK_STATISTICS,
    pub MCastIpToMac: EFI_SIMPLE_NETWORK_MCAST_IP_TO_MAC,
    pub NvData: EFI_SIMPLE_NETWORK_NVDATA,
    pub GetStatus: EFI_SIMPLE_NETWORK_GET_STATUS,
    pub Transmit: EFI_SIMPLE_NETWORK_TRANSMIT,
    pub Receive: EFI_SIMPLE_NETWORK_RECEIVE,
    pub WaitForPacket: EFI_EVENT,
    pub Mode: *mut EFI_SIMPLE_NETWORK_MODE,
}
#[test]
fn bindgen_test_layout__EFI_SIMPLE_NETWORK() {
    assert_eq!(::core::mem::size_of::<_EFI_SIMPLE_NETWORK>() , 128usize ,
               concat ! ( "Size of: " , stringify ! ( _EFI_SIMPLE_NETWORK )
               ));
    assert_eq! (::core::mem::align_of::<_EFI_SIMPLE_NETWORK>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( _EFI_SIMPLE_NETWORK ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_SIMPLE_NETWORK ) ) . Revision as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_SIMPLE_NETWORK ) ,
                "::" , stringify ! ( Revision ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_SIMPLE_NETWORK ) ) . Start as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_SIMPLE_NETWORK ) ,
                "::" , stringify ! ( Start ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_SIMPLE_NETWORK ) ) . Stop as * const
                _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_SIMPLE_NETWORK ) ,
                "::" , stringify ! ( Stop ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_SIMPLE_NETWORK ) ) . Initialize as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_SIMPLE_NETWORK ) ,
                "::" , stringify ! ( Initialize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_SIMPLE_NETWORK ) ) . Reset as *
                const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_SIMPLE_NETWORK ) ,
                "::" , stringify ! ( Reset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_SIMPLE_NETWORK ) ) . Shutdown as *
                const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_SIMPLE_NETWORK ) ,
                "::" , stringify ! ( Shutdown ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_SIMPLE_NETWORK ) ) . ReceiveFilters
                as * const _ as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_SIMPLE_NETWORK ) ,
                "::" , stringify ! ( ReceiveFilters ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_SIMPLE_NETWORK ) ) . StationAddress
                as * const _ as usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_SIMPLE_NETWORK ) ,
                "::" , stringify ! ( StationAddress ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_SIMPLE_NETWORK ) ) . Statistics as *
                const _ as usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_SIMPLE_NETWORK ) ,
                "::" , stringify ! ( Statistics ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_SIMPLE_NETWORK ) ) . MCastIpToMac as
                * const _ as usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_SIMPLE_NETWORK ) ,
                "::" , stringify ! ( MCastIpToMac ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_SIMPLE_NETWORK ) ) . NvData as *
                const _ as usize } , 80usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_SIMPLE_NETWORK ) ,
                "::" , stringify ! ( NvData ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_SIMPLE_NETWORK ) ) . GetStatus as *
                const _ as usize } , 88usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_SIMPLE_NETWORK ) ,
                "::" , stringify ! ( GetStatus ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_SIMPLE_NETWORK ) ) . Transmit as *
                const _ as usize } , 96usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_SIMPLE_NETWORK ) ,
                "::" , stringify ! ( Transmit ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_SIMPLE_NETWORK ) ) . Receive as *
                const _ as usize } , 104usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_SIMPLE_NETWORK ) ,
                "::" , stringify ! ( Receive ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_SIMPLE_NETWORK ) ) . WaitForPacket
                as * const _ as usize } , 112usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_SIMPLE_NETWORK ) ,
                "::" , stringify ! ( WaitForPacket ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _EFI_SIMPLE_NETWORK ) ) . Mode as * const
                _ as usize } , 120usize , concat ! (
                "Alignment of field: " , stringify ! ( _EFI_SIMPLE_NETWORK ) ,
                "::" , stringify ! ( Mode ) ));
}
impl Clone for _EFI_SIMPLE_NETWORK {
    fn clone(&self) -> Self { unimplemented!() }
}
///////////////////////////////////////////////////////////////////////////////
#[repr(C)]

pub struct EFI_NETWORK_STATISTICS {
    pub RxTotalFrames: UINT64,
    pub RxGoodFrames: UINT64,
    pub RxUndersizeFrames: UINT64,
    pub RxOversizeFrames: UINT64,
    pub RxDroppedFrames: UINT64,
    pub RxUnicastFrames: UINT64,
    pub RxBroadcastFrames: UINT64,
    pub RxMulticastFrames: UINT64,
    pub RxCrcErrorFrames: UINT64,
    pub RxTotalBytes: UINT64,
    pub TxTotalFrames: UINT64,
    pub TxGoodFrames: UINT64,
    pub TxUndersizeFrames: UINT64,
    pub TxOversizeFrames: UINT64,
    pub TxDroppedFrames: UINT64,
    pub TxUnicastFrames: UINT64,
    pub TxBroadcastFrames: UINT64,
    pub TxMulticastFrames: UINT64,
    pub TxCrcErrorFrames: UINT64,
    pub TxTotalBytes: UINT64,
    pub Collisions: UINT64,
    pub UnsupportedProtocol: UINT64,
}
#[test]
fn bindgen_test_layout_EFI_NETWORK_STATISTICS() {
    assert_eq!(::core::mem::size_of::<EFI_NETWORK_STATISTICS>() , 176usize ,
               concat ! ( "Size of: " , stringify ! ( EFI_NETWORK_STATISTICS )
               ));
    assert_eq! (::core::mem::align_of::<EFI_NETWORK_STATISTICS>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( EFI_NETWORK_STATISTICS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_NETWORK_STATISTICS ) ) .
                RxTotalFrames as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_NETWORK_STATISTICS
                ) , "::" , stringify ! ( RxTotalFrames ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_NETWORK_STATISTICS ) ) . RxGoodFrames
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_NETWORK_STATISTICS
                ) , "::" , stringify ! ( RxGoodFrames ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_NETWORK_STATISTICS ) ) .
                RxUndersizeFrames as * const _ as usize } , 16usize , concat !
                (
                "Alignment of field: " , stringify ! ( EFI_NETWORK_STATISTICS
                ) , "::" , stringify ! ( RxUndersizeFrames ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_NETWORK_STATISTICS ) ) .
                RxOversizeFrames as * const _ as usize } , 24usize , concat !
                (
                "Alignment of field: " , stringify ! ( EFI_NETWORK_STATISTICS
                ) , "::" , stringify ! ( RxOversizeFrames ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_NETWORK_STATISTICS ) ) .
                RxDroppedFrames as * const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_NETWORK_STATISTICS
                ) , "::" , stringify ! ( RxDroppedFrames ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_NETWORK_STATISTICS ) ) .
                RxUnicastFrames as * const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_NETWORK_STATISTICS
                ) , "::" , stringify ! ( RxUnicastFrames ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_NETWORK_STATISTICS ) ) .
                RxBroadcastFrames as * const _ as usize } , 48usize , concat !
                (
                "Alignment of field: " , stringify ! ( EFI_NETWORK_STATISTICS
                ) , "::" , stringify ! ( RxBroadcastFrames ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_NETWORK_STATISTICS ) ) .
                RxMulticastFrames as * const _ as usize } , 56usize , concat !
                (
                "Alignment of field: " , stringify ! ( EFI_NETWORK_STATISTICS
                ) , "::" , stringify ! ( RxMulticastFrames ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_NETWORK_STATISTICS ) ) .
                RxCrcErrorFrames as * const _ as usize } , 64usize , concat !
                (
                "Alignment of field: " , stringify ! ( EFI_NETWORK_STATISTICS
                ) , "::" , stringify ! ( RxCrcErrorFrames ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_NETWORK_STATISTICS ) ) . RxTotalBytes
                as * const _ as usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_NETWORK_STATISTICS
                ) , "::" , stringify ! ( RxTotalBytes ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_NETWORK_STATISTICS ) ) .
                TxTotalFrames as * const _ as usize } , 80usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_NETWORK_STATISTICS
                ) , "::" , stringify ! ( TxTotalFrames ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_NETWORK_STATISTICS ) ) . TxGoodFrames
                as * const _ as usize } , 88usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_NETWORK_STATISTICS
                ) , "::" , stringify ! ( TxGoodFrames ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_NETWORK_STATISTICS ) ) .
                TxUndersizeFrames as * const _ as usize } , 96usize , concat !
                (
                "Alignment of field: " , stringify ! ( EFI_NETWORK_STATISTICS
                ) , "::" , stringify ! ( TxUndersizeFrames ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_NETWORK_STATISTICS ) ) .
                TxOversizeFrames as * const _ as usize } , 104usize , concat !
                (
                "Alignment of field: " , stringify ! ( EFI_NETWORK_STATISTICS
                ) , "::" , stringify ! ( TxOversizeFrames ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_NETWORK_STATISTICS ) ) .
                TxDroppedFrames as * const _ as usize } , 112usize , concat !
                (
                "Alignment of field: " , stringify ! ( EFI_NETWORK_STATISTICS
                ) , "::" , stringify ! ( TxDroppedFrames ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_NETWORK_STATISTICS ) ) .
                TxUnicastFrames as * const _ as usize } , 120usize , concat !
                (
                "Alignment of field: " , stringify ! ( EFI_NETWORK_STATISTICS
                ) , "::" , stringify ! ( TxUnicastFrames ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_NETWORK_STATISTICS ) ) .
                TxBroadcastFrames as * const _ as usize } , 128usize , concat
                ! (
                "Alignment of field: " , stringify ! ( EFI_NETWORK_STATISTICS
                ) , "::" , stringify ! ( TxBroadcastFrames ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_NETWORK_STATISTICS ) ) .
                TxMulticastFrames as * const _ as usize } , 136usize , concat
                ! (
                "Alignment of field: " , stringify ! ( EFI_NETWORK_STATISTICS
                ) , "::" , stringify ! ( TxMulticastFrames ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_NETWORK_STATISTICS ) ) .
                TxCrcErrorFrames as * const _ as usize } , 144usize , concat !
                (
                "Alignment of field: " , stringify ! ( EFI_NETWORK_STATISTICS
                ) , "::" , stringify ! ( TxCrcErrorFrames ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_NETWORK_STATISTICS ) ) . TxTotalBytes
                as * const _ as usize } , 152usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_NETWORK_STATISTICS
                ) , "::" , stringify ! ( TxTotalBytes ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_NETWORK_STATISTICS ) ) . Collisions
                as * const _ as usize } , 160usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_NETWORK_STATISTICS
                ) , "::" , stringify ! ( Collisions ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_NETWORK_STATISTICS ) ) .
                UnsupportedProtocol as * const _ as usize } , 168usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( EFI_NETWORK_STATISTICS
                ) , "::" , stringify ! ( UnsupportedProtocol ) ));
}
impl Clone for EFI_NETWORK_STATISTICS {
    fn clone(&self) -> Self { unimplemented!() }
}
pub const EFI_SIMPLE_NETWORK_STATE_EfiSimpleNetworkStopped:
          EFI_SIMPLE_NETWORK_STATE =
    0;
pub const EFI_SIMPLE_NETWORK_STATE_EfiSimpleNetworkStarted:
          EFI_SIMPLE_NETWORK_STATE =
    1;
pub const EFI_SIMPLE_NETWORK_STATE_EfiSimpleNetworkInitialized:
          EFI_SIMPLE_NETWORK_STATE =
    2;
pub const EFI_SIMPLE_NETWORK_STATE_EfiSimpleNetworkMaxState:
          EFI_SIMPLE_NETWORK_STATE =
    3;
///////////////////////////////////////////////////////////////////////////////
pub type EFI_SIMPLE_NETWORK_STATE = ::ctypes::c_uint;
#[repr(C)]

pub struct EFI_SIMPLE_NETWORK_MODE {
    pub State: UINT32,
    pub HwAddressSize: UINT32,
    pub MediaHeaderSize: UINT32,
    pub MaxPacketSize: UINT32,
    pub NvRamSize: UINT32,
    pub NvRamAccessSize: UINT32,
    pub ReceiveFilterMask: UINT32,
    pub ReceiveFilterSetting: UINT32,
    pub MaxMCastFilterCount: UINT32,
    pub MCastFilterCount: UINT32,
    pub MCastFilter: [EFI_MAC_ADDRESS; 16usize],
    pub CurrentAddress: EFI_MAC_ADDRESS,
    pub BroadcastAddress: EFI_MAC_ADDRESS,
    pub PermanentAddress: EFI_MAC_ADDRESS,
    pub IfType: UINT8,
    pub MacAddressChangeable: BOOLEAN,
    pub MultipleTxSupported: BOOLEAN,
    pub MediaPresentSupported: BOOLEAN,
    pub MediaPresent: BOOLEAN,
}
#[test]
fn bindgen_test_layout_EFI_SIMPLE_NETWORK_MODE() {
    assert_eq!(::core::mem::size_of::<EFI_SIMPLE_NETWORK_MODE>() , 656usize ,
               concat ! (
               "Size of: " , stringify ! ( EFI_SIMPLE_NETWORK_MODE ) ));
    assert_eq! (::core::mem::align_of::<EFI_SIMPLE_NETWORK_MODE>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( EFI_SIMPLE_NETWORK_MODE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_SIMPLE_NETWORK_MODE ) ) . State as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_SIMPLE_NETWORK_MODE
                ) , "::" , stringify ! ( State ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_SIMPLE_NETWORK_MODE ) ) .
                HwAddressSize as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_SIMPLE_NETWORK_MODE
                ) , "::" , stringify ! ( HwAddressSize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_SIMPLE_NETWORK_MODE ) ) .
                MediaHeaderSize as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_SIMPLE_NETWORK_MODE
                ) , "::" , stringify ! ( MediaHeaderSize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_SIMPLE_NETWORK_MODE ) ) .
                MaxPacketSize as * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_SIMPLE_NETWORK_MODE
                ) , "::" , stringify ! ( MaxPacketSize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_SIMPLE_NETWORK_MODE ) ) . NvRamSize
                as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_SIMPLE_NETWORK_MODE
                ) , "::" , stringify ! ( NvRamSize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_SIMPLE_NETWORK_MODE ) ) .
                NvRamAccessSize as * const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_SIMPLE_NETWORK_MODE
                ) , "::" , stringify ! ( NvRamAccessSize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_SIMPLE_NETWORK_MODE ) ) .
                ReceiveFilterMask as * const _ as usize } , 24usize , concat !
                (
                "Alignment of field: " , stringify ! ( EFI_SIMPLE_NETWORK_MODE
                ) , "::" , stringify ! ( ReceiveFilterMask ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_SIMPLE_NETWORK_MODE ) ) .
                ReceiveFilterSetting as * const _ as usize } , 28usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( EFI_SIMPLE_NETWORK_MODE
                ) , "::" , stringify ! ( ReceiveFilterSetting ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_SIMPLE_NETWORK_MODE ) ) .
                MaxMCastFilterCount as * const _ as usize } , 32usize , concat
                ! (
                "Alignment of field: " , stringify ! ( EFI_SIMPLE_NETWORK_MODE
                ) , "::" , stringify ! ( MaxMCastFilterCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_SIMPLE_NETWORK_MODE ) ) .
                MCastFilterCount as * const _ as usize } , 36usize , concat !
                (
                "Alignment of field: " , stringify ! ( EFI_SIMPLE_NETWORK_MODE
                ) , "::" , stringify ! ( MCastFilterCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_SIMPLE_NETWORK_MODE ) ) . MCastFilter
                as * const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_SIMPLE_NETWORK_MODE
                ) , "::" , stringify ! ( MCastFilter ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_SIMPLE_NETWORK_MODE ) ) .
                CurrentAddress as * const _ as usize } , 552usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_SIMPLE_NETWORK_MODE
                ) , "::" , stringify ! ( CurrentAddress ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_SIMPLE_NETWORK_MODE ) ) .
                BroadcastAddress as * const _ as usize } , 584usize , concat !
                (
                "Alignment of field: " , stringify ! ( EFI_SIMPLE_NETWORK_MODE
                ) , "::" , stringify ! ( BroadcastAddress ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_SIMPLE_NETWORK_MODE ) ) .
                PermanentAddress as * const _ as usize } , 616usize , concat !
                (
                "Alignment of field: " , stringify ! ( EFI_SIMPLE_NETWORK_MODE
                ) , "::" , stringify ! ( PermanentAddress ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_SIMPLE_NETWORK_MODE ) ) . IfType as *
                const _ as usize } , 648usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_SIMPLE_NETWORK_MODE
                ) , "::" , stringify ! ( IfType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_SIMPLE_NETWORK_MODE ) ) .
                MacAddressChangeable as * const _ as usize } , 649usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( EFI_SIMPLE_NETWORK_MODE
                ) , "::" , stringify ! ( MacAddressChangeable ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_SIMPLE_NETWORK_MODE ) ) .
                MultipleTxSupported as * const _ as usize } , 650usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( EFI_SIMPLE_NETWORK_MODE
                ) , "::" , stringify ! ( MultipleTxSupported ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_SIMPLE_NETWORK_MODE ) ) .
                MediaPresentSupported as * const _ as usize } , 651usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( EFI_SIMPLE_NETWORK_MODE
                ) , "::" , stringify ! ( MediaPresentSupported ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EFI_SIMPLE_NETWORK_MODE ) ) .
                MediaPresent as * const _ as usize } , 652usize , concat ! (
                "Alignment of field: " , stringify ! ( EFI_SIMPLE_NETWORK_MODE
                ) , "::" , stringify ! ( MediaPresent ) ));
}
impl Clone for EFI_SIMPLE_NETWORK_MODE {
    fn clone(&self) -> Self { unimplemented!() }
}
///////////////////////////////////////////////////////////////////////////////
pub type EFI_SIMPLE_NETWORK_START =
    ::core::option::Option<unsafe extern "win64" fn(This:
                                                    *mut _EFI_SIMPLE_NETWORK)
                               -> EFI_STATUS>;
///////////////////////////////////////////////////////////////////////////////
pub type EFI_SIMPLE_NETWORK_STOP =
